[
  {
    "post_text": "Is win by inwi not working",
    "comments": [
      "ISPs in Morocco are the biggest scam artists"
    ]
  },
  {
    "post_text": "IAM, ORANGE, INWI misleading game (please read)\n\nAll three Moroccan ISPs just dropped new offers flexing about “superfast” speeds like 100 Mb/s, 200 Mb/s, even 500 Mb/s  But it's kind of scam sense they don't explain this:\n\nThey say Mb/s (megabits per second)\n\nBut your downloads happen in MB/s (megabytes per second)\n\n1 MB = 8 Mb, so divide that number by 8.\n\nExample:\n\nThat “100 Mb/s” plan? You’re actually getting 12.5 MB/s download speed.\n\nThey’re not lying but it’s misleading AF. Most people hear “100” and assume it’s 100 megabytes 🤓.\n\nEDIT: No one said it’s new and yes ISPs worldwide use bits but that doesn’t make it not misleading.\n\nThe point is: they count on the average person not knowing the difference just because it’s common practice doesn’t mean it’s not manipulative.\n\n",
    "comments": [
      "This is nothing new, providers have been advertising internet speeds like this in Europe for decades afaik…\n\nComputers grew from Mb/s to MB/s, 8x as fast. Providers never grew with the market, their prices sure did though…",
      "But it is misleading don't u think that?!",
      "Wait until you learn about gold weighing and troy ounces\n\nEverything is misleading",
      "I think what is announced is in the best case scenario, don't forget, speed changes when wifi vs cable, server host location, protocol used, dns, vpn, time of connection night or day etc..\n\n100 mb/s is for a direct connection to operators server using cable only at some hour or something like that..",
      "Its true real world speeds vary with Wi-Fi, server distance, congestion, etc. \nbut even in ideal conditions 100 Mb/s ≠ 100 MB/s.\n\nIt’s a fundamental difference:\n8 bits = 1 byte, so 100 Mb/s = 12.5 MB/s max, always.\n\nThat’s the misleading part, ISPs advertise in megabits knowing most people confuse it with megabytes.",
      "Its true real world speeds vary with Wi-Fi, server distance, congestion, etc. \nbut even in ideal conditions 100 Mb/s ≠ 100 MB/s.\n\nIt’s a fundamental difference:\n8 bits = 1 byte, so 100 Mb/s = 12.5 MB/s max, always.\n\nThat’s the misleading part, ISPs advertise in megabits knowing most people confuse it with megabytes.",
      "Aaah i got your point it's logical i think it's the difference between how internet speed is measured and how files can be weighed, thanks for the info",
      "It’s not misleading at all buddy , it’s like saying this cost 100dh or 10000 cents, both are correct representation of bandwidth.\nThe misleading part is that they write (virtual debit: best case scenario you will receive 80-90% of what you paid for)",
      "I agree, but as you stated, it is UP TO xx mb/s, so 10mbit/sec would still be as advertised on a connection UP TO 100mbit/sec, it’s usually in the small print…",
      "Wach khadam b IE ?\nthis is nothing new, and it's not a scam, since all ISP over the world use bit over byte for cnx ads.",
      "Just to add, most users don't have storage speed to handle 100MBs write xD",
      "Actually, this is wrong. Hard drives have a write and read speeds of 100MB/s to even 300MB/s, and ssd which are more common today have speeds from 400MB/s to 14000MB/s, that said there are other bottlenecks like cpu speed if you're decompressing the files while downloading like steam does, and more importantly the local network speed, some people will not benefit from the new speed because even though they hav 200mb/s internet their router is only 100mb/s ethernet or 2.4ghz wifi.",
      "Yes I agree.",
      "Interesting! Quick question, Let say an HDD supports up to 50 MBs, connected to a 100MBs network,  will that number in download section be showing actual network speed or just what the drive support?",
      "It will throttle the download",
      "I doubt anyone these days use HDDs that are THAT slow. I'm currently still using my 15+ years 2.5' sata HDD that I extracted out of my old laptop to use for clip recordings and it still writes well above 100 megabytes!",
      "My 5700mb/s read 5000mb/write SSD: Am I a joke to you?",
      "You are not everyone you are special, you are the one who has a 5000MB w/r SSD, you should be proud.",
      "I'm a bit proud since it's a gen4 NVMe SSD but I think most people have SSDs now, at least SATA for OS, HDDs are so slow and degrade over time, not to mention that sata ssd's are now relatively cheap (depends on capacity) so if one can afford a computer, might as well get an SSD for it",
      "Trust me alot of people don’t know that...",
      "Its not \"misleading\" nor a \"scam\", more of a user error if you ask me, using bits for bandwidth IS convention, the standard unite for bandwidth and data transfer rates is bits since network data transfer happens at the bit level, this convention dates back to the early days of telecommunications invention, file size standardized measure on the other hand is bytes, and thats because the standard unite for encoding a character is 1 byte (ie 8 bits), calling it a scam is a serious accusation, which it isnt in this case, so calm down.",
      "Spare me the textbook. we both know ISPs intentionally blur bits and bytes in ads because the average user doesn’t speak your networking language.\nIt’s not a user error when the ads built to confuse.\nSo you calm down.",
      "No \"we\" both don't\n\n&gt;know ISPs intentionally blur bits and bytes\n\nand asking an ISP to use bytes as to not confuse\n\n&gt;the average user who doesn’t speak your networking language\n\nis an unreasonable thing to say at best, its not the place of an ISP to explain the difference between those unites of measure nor to change standard practice as to not confuse consumers, nor to help consumers make good decision when considering a product, that is an unreasonable expectation, its called marketing for a reason, marketing strategies capitalize on consumer psychology and on gaps in consumer knowledge, and it is lawful as far as its not an intentional strategy on the part of X company to actively mislead a customer, otherwise ISPs around the world would find themself in courts for using bits instead of bytes, which is not the case, if the confusion is primary caused by user ignorance good luck proving to a court,  or me for that matter, that ISPs are intentionally using a \"convention\" to mislead.\n\nAND it is a user error for the reasons i already layed out, which you chose to ignore and insist on claiming that an ISP using bits instead of bytes is primarily a scam tactic instead of what it actually IS and WAS long before any ISP existed on this planet, notice that any tool used to test bandwidth uses bits instead of bytes, surly those tools are conspiring with ISPs too, what part of \"its a standard of networking\" dont you understand?",
      "hasn't it been like this even before this new offer?",
      "Yes 😃 you can notice in the ads that they write Mb not MB",
      "Isn't this the same all over the world? They use Mb 😅",
      "Yes ISPs worldwide use bits but that doesn’t make it not misleading.",
      "So basically you re saying nothing interesting. It’s been and is like this all over the world.",
      "yep actually some providers write Mbit instead of just Mb",
      "yes ISPs worldwide use bits but that doesn’t make it not misleading.",
      "that's not new though... ISP's all over the world have been doing this since forever gigabit was never 1gigabyte per second.. it's more like 250MB/s",
      "More like 125MB/s = 1000/8",
      "maths be mathing bro, but u r right, usually ISP talk about mbit and download is also in mb or MB, u could just the unit u want to be displayed,\n\nfiles size on the hand is always inn MB",
      "This is the way it's done worldwide. You always divide speed by 8 to get the download speed.",
      "Dude that’s done everywhere and the speed given to customers is the correct one",
      "correct but how it’s marketed is what confuses non tech consumers.",
      "non tech consumers have no idea what Mb nor MB mean.\n\nthey don't even know their download speed and wouldn't notice anything - all they care about is their whatsapp calls, Netflix shows and youtube videos. If they all load instantly, that's their limit",
      "Yeah it's been this way forever... ISPs always advertise in megabits not megabytes everywhere.\nTechnically accurate, but they know some people might confuse the two and it might come as misleading if you don't know the difference.",
      "This is normal globally, Canada &amp; UK do the same. \n\nEveryone doing speedtests though are probably testing their internet speeds within Morocco or the continent, but the majority of data-centers (gaming is a big one) are hosted in Europe or the Middle East. Morocco are working on expanding their capacity across borders but unless you're downloading items that are cached inside Morocco or using Moroccan services, increasing internet speeds might saturate this link.\n\nYou're looking at a difference of 100Gbps capacity in Morocco ([via Casablanca](https://www.peeringdb.com/ix/2713)) vs 72Tbps in the UK for example.",
      "Me when i discovered the difference between MB &amp; Mb:",
      "That’s actually hilarious 😂",
      "im not even joking i fell for that shit fr lmao",
      "You figured it out Einstein, you're a genius.\n\nJoking aside, in IT, speeds/bandwidth are always written in bits/s and this isn't exclusive to internet, local networking also use bit/s, in video the bitrate (how much a video/audio second takes) is written also in bit/s, the download speed you see in the browser or download managers are not the norm they use byte/s because its easier for the user to understand because filesizes are bytes.",
      "I stopped reading your reply when you said 'IT speed' 😭",
      "Here I fixed it.",
      "That’s the standard everywhere worldwide",
      "I agree but It’s misleading to the average consumer khososan in Morocco.",
      "I'm sorry but this is the dumbest shit I've read in a while. We were saying this among friends in high school back in 2004 with Menara ADSL. This should be common knowledge in 2025.",
      "You’ve known about this since 2004? Good for you But not everyone is a genius like you.",
      "All it takes is downloading something to see the actual speed you have. Unless they've been living under a rock, everybody should know this.",
      "Exactly, everyone is aware of it and those who are not aware, don't even know their download speed and don't feel mislead cause they don't even notice the \"misleading\" thing",
      "LOL, that's **not** misleading at all. that's literally how it works. and yes an average person that is not acquainted with how Networks work then they would assume that their down speed would be 100mbytes/sec but in reality they are paying for 100mbites/sec. Also why would an ISP would explain any of that? anyways, this is very basic. but sure, you did an okay job at clarifying to those whom aren't aware.",
      "\"That's how it works\" isn’t an excuse it’s exactly why it's misleading.\n\nISPs advertise layer 1/2 throughput to consumers who interpret it as application layer transfer rate which are 1/8th of what’s advertised. That’s a  marketing sleigh of hand, not transparency.\n\nYou’re right that it's basic networking—but the average user doesn’t operate at OSI Layer 1 or 2. They see download speed ls at Layer 7, in megabytes. \n\nAnd no ISP's not explaining that to the average consumer.\n\nSo yes, it’s misleading.",
      "I am not going to argue with you, my friend. A user is expected to ask questions and do homework before purchasing a service of such (especially when they don't know shit about, technical-wise). Anyways, have a good day.",
      "i literally just stepped in a inwi agency and this is the first notification i got",
      "This is really not misleading but misinformation from the people and they exploit that, i had many people asking me why they have 100 and downloading at 10/11 i was like Megabytes and Megabits are not the same, they just exploit people not being technically aware of things like this",
      "It’s the case worldwide. \nGenerally, bits are used for bandwidth, whereas bytes are used for disk read/write (storage).",
      "1Megabye = 8 Megabit\nIt always been this way",
      "The same marketing strategy is used everywhere you go, in our case it's more about the high price than anything else. 12MB/s is still more than enough for the majority of people.",
      "The trick often is \"up to x MB/S\" it'll never reach that, it is best effort most of the time.",
      "I remember seeing an advertisement of 20mbps internet in 20MB/s , soooo false advertisement",
      "Ppl with gigabit internet reading this, what do you think of this slow as internet 😭?",
      "I read the thread, I get your point, but your argument doesn't hold for the simple reason that anyone in need of high speed/accurate detailed break down of speed and usage already knows this\n\nThose who don't, likely only need 20/50mbps for streaming etc... so its doesn't change anything",
      "This is so cute You're like a child who discovered something that all grown ups know but thinks it's a big misleading idea that everyone falls for and he tries to blow it wide open and explain it to everyone lol i mean this in the nicest way by the way hhhhh its actually sweet",
      "Who said I'm not a kid 😃",
      "Hahaa nice! Thanks, thats pretty clever and screams competition collusion.",
      "? This is literally how it's marketed around the world, they never use MB/s.",
      "no it's only you who think 100mb mean 100MB/s as everyone i know knows it's not and everyoen aroun the world knows as the offers are never about MB/s as if u see in EU/ASIA/NA.. WHEN THEY SAY 1GB SPEED they don't mean 1GB/S as everyone know i think only you didn't",
      "Cool you know the difference but most people don’t and that’s the whole point.\n\nISPs rely on that confusion. It’s not about you, it’s about how they market to the average user who thinks Mb = MB.",
      "Most people don't even know how this works , the just know big number = better",
      "uh, this is something literally every internet company in the world does -\\_-",
      "It would be misleading if there is any company in the world uses MB/a but that's not the case",
      "![gif](giphy|l46CyJmS9KUbokzsI|downsized)",
      "most people ? i do think u r the only one thinking that hhhhhhh, every one who studied network knows this, so basically almost everyone",
      "If you can’t tell the difference between Mbits and Mbytes, just ask the ISP or take responsibility. you can’t be a fhamator and when you’re wrong hold ISPs responsible. Mbits are the standard for measuring network speed, Mbytes are standard for measuring file size. Not the same.\n\nIt’s like calling a seller scammy because he’s selling bananas 2dh/banana instead of 15dh/kilo cuz you’re too proud to ask and too dumb to read.",
      "Using transport-layer metrics in consumer-facing ads without context is misleading.",
      "consumer don’t even know the difference in speed between 12mb and 100mb. anyone savvy enough would know that speed in networking is measured in bits not bytes.\n\nma3reftch chno jak s3ib tfehmo, bits for networks, bytes for file sizes.\n\nanother thing, people get the fastest internet they can afford, so Dh matters more than Mb. layje3lom y3ebro speeds in banana/s (mchehi lbanane)",
      "Its always been like that and i think its commone knowlege always divide ur offer per 8 to have ur download speed",
      "every single provider in the world does this and it has been this way for decades idk why you think about it only after the new offers",
      "My guy discovered something new ! Congrats 🎊 \nNow post it on linked in",
      "Glad your mom taught me that last night \nI’ll let her help me post about it on LinkedIn next weekend, you know how supportive she is.",
      "Yeah , mom jokes , as you got nothing to defend yourself. Be humble and say you did not know something that has been around for ages and admit it , what a narcissist",
      " Never noticed that!!! 🙀🙀🙀",
      "It has been always the case, here and even in Europe and USA...",
      "Bro thats the same in The whole world not just here",
      "This is just how it works bro. Same thing f aya dawla thats the numbers used its normal",
      "This is common practice in the entire world, all ISPs advertise their internet speed in bits per second, and it's an industry standard used by IT professionals that is also convenient in terms of marketing, in the grand scheme of things, you ll be getting that Byte speed in 8 seconds.",
      "that’s how bandwidth was marketed since the inception of the internet, this debate would have been interesting when we had 56k modems, dude.",
      "Non it guys finding about a notion : \n\n(Did you know oil companies are misleading they use kilometers instead of centi 🤓)",
      "Schizophrène",
      "It's just a question of common knowledge, most people know that internet speed is measured by bits and storage is measured by bytes, not really ISPs being misleading or anything imo",
      "Bro just discovered internet.",
      "Just checked orange's fiber optic offers, they explicity mention \"Mbits/s\"",
      "I noticed this a while ago while in the car with my dad and I was like if I had money I would have sued them and he said you’ll prob get nothing out of it other than wasting your money which is probably true unfortunately",
      "nah ARNT wouldnt allow that",
      "Mb is not MB so technically it's not a scam",
      "i know the difference , but im sure it wont allow anything misleading",
      "Because it's not misleading, OP just found out that Santa doesn't exist.",
      "Bandwidth is almost always measured using bits per second, be it ISPs or other applications. It is the more reliable metric seeing how Windows doesn’t even agree with others about how to represent byte orders of magnitude (powers of 2 vs powers of 10). This is a nothing burger.\n\nEDIT: in fact in your example, 1 MB/s for windows is certainly not 8 Mbps. It’s 8.389. That only applies to Mac, Unix… unless if expressed as MiB in which case it’s also 8.389. See OP? Mbps make sense.",
      "Love how you threw in that “edit” like it was some mic drop. It’s still misleading to the average consumer (not you, ofc you’re a smart boy).\n\nNote: 9ra l post kaml",
      "World wide they use Mb, that’s not “moroccan ISPs”’s fault"
    ]
  },
  {
    "post_text": "So, seems like IAM, INWI, and Orange's internet deals (ADSL and fiber) are probably gonna look kinda like this soon.",
    "comments": [
      "These prices are a joke. People in other countries with much better income and living conditions only pay like 400dh for 8 Gbps (download and upload). Not saying that we need 8 Gbps, but 50 and 100 Mbps should not exist in my opinion, the lowest speed should be 200 Mbps and should cost no more than 200dhs/month. But hey, it's Morocco.",
      "i agree 100%",
      "u said it all",
      "Where do you get 8Gb/s for 400dh?",
      "France and Belgium and some other countries.",
      "pls show me country's with 8gb speeds as all i see is 1gb everywere",
      "Just an example: https://www.free.fr/freebox/",
      "Algerians pay 300 DH for  1.2Gbps fiber plan and here in Morocco we have to pay 300 DH for 100Mbps LOL What a joke ! We have the most overpriced internet in Africa",
      "100 Mbps costs 459 dh. 350dh no more than 50Mbps.",
      "Is this for real? I mean is there any confirmation by the company in charge?",
      "No official stuff, just rumors based on what's happening right now",
      "I confirm that IAM did change it from 100mb  to 200 mb in Casablanca, Orange so far no changes.",
      "Greedy prices",
      "Has anyone tried inwi and Orange? the 500/500 looks better than 500/250, but are those two as stable as IAM?",
      "I have inwi working fine so far just make sure they do a good job welding the fiber line so you have a good signal, \nShouldn't go past -25dbm",
      "Tried Orange. No changes.",
      "first those are lie it's not 500/250, as it's will be 500/500 for sure as all numbers are wrong i have IMA 100mb before and now the new update is 200mb/200mb on both no 200mb down and 100mb up as they have same same",
      "Where I live Orange is the best , but I heard it's not the same everywhere",
      "I'm curious, what do people on this subreddit who need more than 100Mbps do? cuz I've been using that speed for years and I never felt the need to upgrade.",
      "Gaming, businesses, and so on—clearly, if there’s a plan for it, there’s a demand for it.",
      "for gaming u need like 50mb fiber at best and u will have sable gaming as it's more about ping which don't change with speed , unless you mean streaming then yeh",
      "true, the streaming discord and all that i meant",
      "Gaming, streaming, work and more",
      "اسعاركم افضل منا في السعوديه لي فايبر",
      "What are the prices over there?",
      "700 درهم مغربي في الشهر \n\nهذا لسرعه 200 ميغا \n\nو 3000 درهم تقريبا في الشهر \n\nلسرعه 1000 ميغا",
      "الأنظمة العربية كلها بنت 🐶",
      "المقارنات ديه لازم تاخد بعين الاعتبار المدخول الشهري و المعيشة في كل بلد",
      "Expensive",
      "May you provide source,thank you.",
      "No official stuff, just rumors based on what's happening right now",
      "When will it get updated?",
      "this, no one knows exactly, probably somewhere between 1 year to 5 years until 2030",
      "What kinda of prices are these?\nLike how much profit margin are they looking for 1000%?",
      "People complaining about pricing: You have to be thankful that the world cup pushed the telecom companies to bump up the fucking speed to 1Gb. That’s 5x the max we had, once that works and everyone switched to FTTH, they will have no choice but to bump it up to more. Be patient MFs, everything in this country is slow.",
      "This is fake, someone just translated that table from english, IAM is 200/200 not 100 upload",
      "Daaamn . I remember I was paying almost 8 euros for fiber 500 when I was in Romania 10 years ago. I always felt it was affordable but could be cheaper. Now looking at the prices in Morocco, Romania kanet ra7ma",
      "Oh demn that's way too much",
      "totally wrong and why is that because for IMA upload and downloads are same i have 200/200 not 200/100",
      "Moroccan average salary is 3000-3500 dh if u want a good internet lets say 200m thats almost 17% of ur salary just for internet fuck this country and people who own this companies and people who are in power and dont do nothing",
      "lol, still ridiculously high. 200-300 DH for 1 Gbps is the bare minimum",
      "I think 50mb with 300dh not 250dh."
    ]
  },
  {
    "post_text": "Fiber optic in Morocco \"Had prices it's not for us, it's for Inwi and orange.",
    "comments": [
      "Ouahbi is a good lawyer... Won inwi Vs IAM battle in court.",
      "Hahahaha yep 3ta9hom men $615M",
      "Imagine paying 300 dhs for 1gb 🤑🫠. I want to live in this reality.",
      "IAM said 1000DH just for you, rab7in chi 7aja 9lila 🤥😆",
      "sme3t dakchi bach khalssa o3ad homa khassrin fiha, hit b9atlhom hadik 7ba taliya obghaw ibi3oha",
      "Because we are just students 🥺",
      "don't worry it's will happen like 2030-2035 for sure maybe max 2040",
      "😌",
      "Interesting 🤔, thanks for the info",
      "🤙🏻🙏🏻",
      "Does that mean we can sign up for orange fiber if my area is only connected by Maroc Telecom?",
      "Yes exactly, but not at the moment.",
      "Any idea when?",
      "1st i went to orange agency today as i live in taza where orange or inwi have 0% fiber cables of there own so only IMA and they sad i can apply on the 1st of the next month it's will be possible",
      "Thank you, that sound promising.",
      "They're already doing that with ADSL but i don't have any idea about when they can start this with Fiber optic.",
      "may 1st",
      "Turned out tisalat were hindering competition, good deal for inwi + winning 4.4 billion dirham on top of that. But who know if the prices will be good for us or not.",
      "We'll see. Many countries around us have better prices... 🥴",
      "Are the prices not going to get cheaper this year for inwi and orange? Since they didn’t even change the price for 20 mega",
      "unfortunately not too much, they need more profit llah ishel 3lina o 3lihom 🤑",
      "IAM doubeled the Fibre debit for their customers as well with the same prices, pressing the other 2 to do the same, this will take action in the few coming days, if not hours.",
      "hhhhhhh, its actually funny how the real story is totally different from the outside world info, \n\ni was SI engineer in orange and just left 2 months ago, this project was being developped for 2 years and a half (Partage de l'infrastructure FTTH) and i personally worked in developping its tools in orange  for more than a year and a half, it was an idea coming from Orange france which was the leader for it in france o daba daro ghi copier coller,\n\nalso the price thing, it has nothing to do with any ISP, it was the ANRT who officially told them they could double their internet speed for customers\n\nlets not act as if IAM or INWI or orange is there for the people, they are in it for the money and what benefits them only",
      "i'm currently working at inwi and i can confirm that the price thing is a news at least for our department. didn't know it was from the ANRT though.",
      "well it was well known for all orange employees though,\n\n[told people in reddit like months ago](https://www.reddit.com/r/Morocco/comments/1jab2oa/comment/mhl9m8t/)",
      "Yes exactly it's not something new but it is for a lot of people.\n\nMoroccanhackers page talked about this more than a month ago?!\n\nThis is the original post.\n\nhttps://www.instagram.com/p/DHHhgX0Iv7k/?igsh=dmcwbHlnaWw2Mnln\n\n.",
      "to ask i have IMA now 200mb with test seed 3-4 ms an i wanna change to orange 200mb will my ms have any affect since it's going through IMA",
      "They already did tho?",
      "inwi and Orange haven't communicated about it yet.",
      "THIS is the fucking issue of selling public sectors to private companies , they will use your infrastructure then monopolize it",
      "we would agree with you if ADSL was still a thing but no one care for that anymore as it's old tech that reach it's max power and speed while fiber is full private infrastructure made by them so you can't blame that",
      "you are wrong , because even if for example fiber   is made by them they are still using public infrastructure and establishing it on a public space, not just that but they did monopolize it, the infra structure was made and paid by the money people gave them as part of the service they didn't do it for charity work.   \nthis is the issue, people like you defending this oligarchy",
      "yeh sorry but space outside isn't yours or mine and there they say government  tax to use it. like power companies and water setting pipes underground the ADSL time that was private then went private but fiber it's made by private sector, but also there pricing and other shit it's not just them it's *ANRT* who control there pricing and don't care to gave us fair prices as that is why you don't see ima have 20-50mb fiber offers as there not allowed since they expanded in fiber sector  much more then the others in all cities",
      "sources ?\n\nand are these offers official or not ?(they started doing this or it is just their future plans)",
      "These offers are not for us; the prices we are talking about...\nIAM is going to sell fiber optic to INWI and ORANGE, and then they will resell it to us at higher prices to make a profit — and there's no problem with that. The problem is that they take a huge profit margin."
    ]
  },
  {
    "post_text": "New fibre optique prices (INWI)",
    "comments": [
      "Getting even more disappointed though idk why I was expecting anything atp",
      "Real….",
      "lol 20 mega and fiber in the same phrase ahah",
      "You do realize thats uts faster than adsl 20 mo right?",
      "It's the same in terms of download speed in the 20 mbps plan. It's the upload speed where fibre shines. I remember getting 1 mbps upload in ADSL at best.",
      "Honestly i wouldnt agree with u as a netowrk administrator and manager and given my experience with both (orange isp btw) there is a clear difference between the adsl and fibre since the data transfer method is completely different and faster",
      "Just imagine paying 750dh for 500mg and not get all the speed",
      "The prices are high. But to be honest, Inwi delivers speed and more. I'm now getting 120 Mbps for Downloads and around 140 Mbps for Uploads.",
      "Same for me but orange , I think this is just big cities",
      "How much you paid for it?",
      "Kid7ko 3lina",
      "Everyone talking about these new prices, this has to be one of the greatest marketing strategies ever implemented in morocco",
      "so if IAM is forced to share their infrastructure , why would anyone use iam ?  \nalso i sure hope they're not pulling any of that \\*drops to -50% after 3 months bs",
      "Packet routing matters, it determines your latency with servers outside of Morocco. Some providers have bad routing which can give you higher latency. Usually its best to stick with the provider that manages the infrastructure.",
      "I don't think that they're donna drop it \nBecause now it's official that these are the new prices",
      "Ah yes that is what we call a healthy competition.",
      "i don't think so , orange and inwi have the exact same offers",
      "yes, it was sarcasm.",
      "I just subscribed to Inwi 50Mbps offer in February, and was receiving double the speed for the first 3 months, and paying 349 MAD for it.\n\nwith the new prices, they are cleverly making me stay and paying for 100Mbps while paying the same. you can always downgrade, but they played it very well, since a customer wouldn’t want to do that, it’s a win-win for them.\n\nP.S them also not reducing the prices for the entry offer is just a scam, this entire thing is a scam.",
      "Salam alaikum))\n3afak bghit nsawalk ch7al kitla3 lik f ping ?)) fach kadir speed test ch7al katlae f latency??",
      "4-7 ms",
      "Chokran:)",
      "They're trying to get people to go for 50 mb",
      "True",
      "Why didn't they change the 20mb offer?",
      "Same question, za3ma 50dh it's a loss for them hhh",
      "It will eat into their baseline profits. They also want to put psychological pressure on you, for an additional 50dhs you get X2.5 the speed (50 mb/s)...",
      "b7al orange",
      "Ah",
      "Amazing that there is competition now and prices are going down.\n\nIf the latency is good even the lowest one is sufficient for most people."
    ]
  },
  {
    "post_text": "Inwi Fibre Optique\n\nSalam, déjà 3andna fibre D 100mb mais Ma3omra katwsal kamla (60mb to 70mb in a good day) , kankhamem nbedlouha n Inwi D 200Mg, so lakyn shi wahd 3andu fibre d Inwi would you be kind to share your experience. Is it slightly better than what I am getting right now wla slightly worse? Thank you",
    "comments": [
      "even if you upgrade you will not get the full speed..., it is what it is....",
      "Totally agree. I just wanna know the lesser evil. With Maroc Télécom, I only get 60 MB to 70 MB in a good day, so wanted to know could it be slightly better with Inwi.",
      "You know that street game with cards or some tricky hustle, where there’s a bunch of people standing around, and when you watch from behind, it looks like a random guy (the dud) is actually winning? So you decide to jump in, and you lose. Eventually, you realize it's all a scam, and you're the one getting screwed no matter what you do, because everyone around the table is actually friends working together.\n\nThe whole system is rigged.\n\nThat’s exactly what’s happening here. You're trying to switch from one ISP to another, thinking it’ll be different, but in the end, they're all the same and playing by the same dirty rules.",
      "Yeaah, it's a rigged game",
      "Salam,  \nFirst, **100mg**?  \nSahbi, are you trying to **inject fiber** or **download vitamins**?  \nIt’s **Mb** — **megabits**, not milligrams.  \nAlready off to a great start. 📉\n\nSecond,  \nyou have 100Mb that **never reaches 100**,  \nand your galaxy-brain solution is to **buy 200Mb** and hope Inwi sprinkles fairy dust on your router?\n\nSwitching providers in Morocco isn’t a fix —  \nit's just changing which company disappoints you slightly differently.\n\nAsking for \"user experiences\" with Moroccan ISPs is like asking:  \n*\"Which broken elevator should I take to the 10th floor?\"*  \nSpoiler: you're still gonna take the stairs.\n\n**Summary:**\n\n* Wrong units.\n* Wrong expectations.\n* Same slow tears.\n\nGood luck,  \nfuture fiber philosopher.",
      "feels like chatgpt but okay",
      "Ch7al kaywsslek en general?",
      "60mb w shi haja. Shi marat katwsal n 70mb",
      "Hello, normally with Fibe optic you should get more than 100mb, but you get less, I assume you have a bad router or you are speed testing with your phone (wifi). Try speed testing with pc with cable ethernet",
      "Yes I did that before. Bl cable in a good day katwsal n 80mb, that's it. Ma3omra fatet 80mb",
      "Hi, you have an issue with you internet. There is no way good day katjik 80mb, rah fiber optic machi adsl,",
      "what router are you using",
      "depends on your wifi router, cause the thing is if u have 100mb fibre but a bad wifi router, you won't get the best amounts possible  \nalso depends on if you want the best experience, i'd recommend ASUS routers  \nspecifically, \" RT-AX3000S \" 7itach howa li 3ndi and i always get the best performance from my 100mb deal, but ofc you won't get the full 100mb cause rak fmghrib ljamil, but still i get 90mb+",
      "Okay thanks. Will try this router",
      "i don't recommend buying it new, it's quite expensive, i got mine from facebook market for a crazy price of 400dh.  \nbut buying it new is easier to find and it can go for the price range of 500-800dh.",
      "Yeaah, for 400dhs that's a steal. Jbart b 800 to 1000dhs new. I guess I'll wait for shi hamza F FB Market. Thanks for the heads up",
      "happy to help :)",
      "How much do you get on an Ethernet cable connexion? if it's under 100 by 15% then see if you can switch providers if possible",
      "You should try a cat6 ethernet cable/or another router before trying something else",
      "La . Khesek point dacces o ykun ax . Linkih b 1 cable rj45 . O ha nta meziane "
    ]
  },
  {
    "post_text": "Your honest reviews of Win by INWI",
    "comments": [
      "i have it for a looong time, since they started, i used to game with it.\n\nfor the first 2 years it was probably the best internet provider i have ever used, veeery stable, zero problems.\n\nand than they decided to change something, ping is all over the place, packet loss is more like a bitcoin chart.\n\ni still use it but mainly when im not near a stable wifi.\n\n15gb&amp;1hour for 50dhs is a very good deal for me",
      "That's true, it's very cheap, i'm using it over 2 years now",
      "Yeah, some online games can't even operate with win.\nAlso, weird behaviour woth whatsapp : You only receive msg if you enter app or after a long time, like if 4G has a sleep mode and do period wake ups to receive updates. ..",
      "I have been a customer of Win for more than four years now. Never had one single problem.",
      "Hey so I’m a new customer I received my sim card yesterday and activated it lbar7 and it says that time left one working day for portability, how much does it usually take to change numbers if u have an idea and how much to activate offre?",
      "Chfara, drt abonnement 3ndhom b 79dh, wslatni simcard l dar walakin kan fiha mochkil. Drt réclamation w glt lihom bli Brit n 7yd contrat w rj3o lia flossi bqaw kayjrjro fia 2 ans Tal daba ma chft mnhom walo. Mn had lminbar lah in3l lihom lwalidin",
      "Valid crash out",
      "Pro: the deal is real, it's the cheapest mobile data (15GB and 1h of talk for 50dh) and mostly performs well. If you use up your monthly data, you can seamlessly move into the next package as if you had bought it at the beginning of the month, which is really nice! Speeds are satisfactory when the network doesn't hang. \n\nCon: at times unreliable: WhatsApp calls and messages don't come through, everything takes 10 seconds to load instead of tenth of a second, and sometimes it absolutely refuses to work with my VPN. Very frustrating. \n\nWhen this month ends I'll go back to IAM for 5GB/50dh to see if the performance is more reliable, since most of the time I didn't even use more than 5GB. Since it is month by month, it's no problem.",
      "Yep just said the same on a nother comment.\n\nMy main issues has been this :\n1. Whatsapp\n2. Few games not working with win network\n3. Some corporate VPN can't connect\n4. Sometimes, would struggle with DNS resolution, and forcing it to use google DNS 8.8.8.8 will result in full internet blocage\n\n\nOverall it is still good value for price and the flexibility to change subscription plan is unmatched. Orange has a similar concept with YOXO but Orange coverage is just awful.",
      "The price compared with what you get is a good value, however they have one of the worst and quite scary customer support i’ve ever seen..\n\nSo basically one day i had a problem with my internet so i reach out to them to solve it.\n\nAt first everything was normal, they asked me their usual useless questions like what’s my email and name and stuff….\n\nWe talked a bit but it was all in vain, they told me that my request is sent to the department of something like they always do\nThe scary part is the following, after some time of talking I realized that the typing animation appeared for quite a while(a solid 30-40 seconds) and no message was sent by them, and out of curiosity I looked at my front camera and i did the ✌🏻sign just for fun, then a paragraph appeared and disappeared so quickly, and all my eyes could catch from that paragraph is:\n( Mr Houssaine dok joj sba3……) \nI immediately shutdown my phone, my heart sank, I couldn’t believe it, how tf a company that provides telecom services can spy on people like that.\n\nIt’s unacceptable and illegal, what guarantees that they’re not spying on you right now reading this\nSeeing what you’re doing, and hearing what you’re saying.\n\nThis is tough people, turn off camera access from any application you have on your phone as well as microphone.\n\nGo watch a tutorial if you don’t know how, make sometime for your own privacy, god knows what these monsters can do with your informations.\nStay safe my friend.",
      "Lol, I checked the win app on play store and it actually asks for Camera/storage permission (maybe to send photo id?). Always deny permissions for apps that don't need your data.",
      "Yeaah they ask for permission to send them some photos if needed but not the camera or the microphone, even when I checked in settings, there is no permission for camera.",
      "why is mobile services so expensive in Morocco? we need real competition.",
      "Used it from 2020 to 2023. \n\nThey migrated my number from my former Télécom operator flawlessly and delivered the new sim card to my door step.\n\nAfter that it was very nice to have the option to change the number of hours and data plan every month if I needed to. I could add more GB to my data plan or hours for calling according to what I needed to do the next month.\n\nPayment online only failed once and then I got reimbursement.\n\nIf you don't mind inwi's network coverage, then it's probably the best way to manage your sim currently if you looking for a 100% online experience.\n\nDisclaimer: I'm a current employee of Inwi but I wasn't at the time when I was a Win customer.",
      "Used it for a few months before I needed to share internet with my laptop. Realized that they somehow prevent that. Cancelled the next day and went to Maroc Telecom. Hate MT to the bones but like it or not their services &amp; coverage are better.",
      "I have the same problem with yoxo by orange, fast on my phone, super slow when i share with my laptop idk why that is, i just got it 3 days ago",
      "It do be like that. fwiw, IAM don't do any blocking or limiting.",
      "I had no idea, i would have just installed wifi instead ,but IAM doesnt have good offers tbh",
      "Wdym they prevent that? How on earth can they do that? You can do whatever you want with your internet lmfao",
      "I'd share interent with my laptop and it wouldn't work. Then I'd eecharge IAM sim, (have 2 sims) and get internet working. That's how I came to that conclusion. How did they do that? I don't know and I don't care.",
      "I have win sim and I share internet with my phone, pc and tv all at once and everything works smoothly… I don’t think this is a win problem.",
      "I like the ability to customize your plan and pay whenever you need it, however the deal breaker for me was the internet-only customer service, like if you don't have any coverage or data you're left stranded. I was about to make the same mistake with Orange's Yoxo but I badgered them to cancel my order.",
      "Practical but not always reliable",
      "I have been use it since they launched.. great service.. if you face any issue you contact support and they resolve it for you (only had an issue once, i bought a pass but it expired before the duration it was meant to last, contact support and they gave me more data)\n\nThe only con for me was that it was not difficult to activate a plan without internet.. you can't just go a shop and buy a refill. But they solved that and you can access they website and activate a plan even if you do not have internet on your mobile.\n\nI would recommend",
      "I've been using it for a year or so, it's good.",
      "My older brother had been using it for 3 months then he stopped it for no reason but when i asked him once he told it’s a good offer so You can try it for 1 month then if you found it bad offer just talk with costumer services to stop it for you with no interest service",
      "10/10. I had it since 2020 and i only pay 49 mad for 1 hour and 15 go of internet. Highly recommended",
      "Used it for some years now, no major problems so far.",
      "Used it for years, not a single problem so far",
      "I have to SIMs, got WIN as my backup. I only pay when I need it, so it's pretty handy. \n\nNetwork is a bit meh compared to MT, but gets the job done for cheap.",
      "The best one. Never disappoints",
      "I ve been using it for 4 years, never disappoints. I did transfer my number from maroc telecom and I still have this rage in me. They used to steal my very expensive forfait. Dima mty7ini en panne when I needed solde the most \n\n Win was a game changer, not only did I have flexible affordable abonnement,  I can charge via card with 4g even if I don't have a paid internet subscription and out of wifi.",
      "10/10",
      "The best saraha and its cheap hwa ola yoxo both are good",
      "Suck, like Yoxo, was good at first i have the 199 dhs abonnement with unlimited 4g, at first it was good till you download 50 go, you have a slower connection, but now at 20go you're limited to 56 kbs for 200 dhs it's a scam",
      "Been using it [since the lockdown](https://blog.pingfrommorocco.com/2020/04/my-experience-with-win-by-inwi.html), no major complaints. It worked fine in Casablanca and Ifrane. It had some rare issues when I was using it in 3G mode, but it's been smooth sailing since I switched to 4G. Also fwiw, [imgur](https://blog.pingfrommorocco.com/2022/03/imgur-fails-to-load-with-inwi.html) doesn't work for some reason",
      "0/10. It was working fine for 4 months and then my line got disconected without any reason. And given that they dont have any physical location you can go to and complain, the problem didnt get resolved. All i could do is chat with someone on their app, each time the person is different and they say your problem is getting treated without any actual results. I tried for like 3 months and then i gave up and threw their sim card. I totally dont recommend."
    ]
  },
  {
    "post_text": "Which one is worst, IAM or INWI ?\n\nMy take is IAM is the worst, whats your opinion ?",
    "comments": [
      "For signal IAM is better, for the offers inwi is better",
      "How better of a signka though?",
      "IAM is expensive af\n\nThe same 45go+5h offer in Orange for 100dh is on IAM for 250dh",
      "They are both worse at there ways, but IAM is much worse especially there US/EU prices... ",
      "Telecom services in our country are a joke especially IAM god how much I just hate them",
      "IAM by a long shot",
      "Inwi is better for sure",
      "Orange better 🍊",
      "As a user of both IAM is somehow better"
    ]
  },
  {
    "post_text": "How much time does inwi/orange take to install fiber internet, from subscribing to the contract to having a working internet at home ?",
    "comments": [
      "ela ma dwrtich m3ahom, nta wzhrk hhhhhhh",
      "about 30 minutes to set up and one /two days to start working.",
      "thx",
      "Orange I had the 100mo plan , they came to install it in 2 to 3 business days and installation kant fdik 20 to 30 min , it starts working immediately",
      "thanks",
      "From 48 hours to 4 months. Depends if your region/building has a box",
      "thx",
      "about 2 days in normal cases mine took about 3 weeks\n\n![gif](giphy|qQdL532ZANbjy)"
    ]
  },
  {
    "post_text": "4G wifi with Inwi Idar or Win by Inwi\n\nSalam, \n\nI can't find the information online, if I take a Idar offer or a 70gig Win offer with no subscription, can I stop paying when not in Morocco and resume payment when I come back? Exemple, I pay 6 months when in Morocco, then leave abroad for a couple of months then come back. Should I pay the months I was not there to resume the internet or can I just pay current month?\n\nthanks a lot",
    "comments": [
      "you should end the contract when you go abroad, otherwise you'll have to pay",
      "Ok that's what I thought thanks",
      "Just install a cheap adsl line and maybe put an online camera there. If you live abroad you can afford 10-20€ a month to keep that internet line",
      "I don't live abroad, I can't afford and I don't way to pay for something I am not using.. especially to those companies..",
      "For Win you can preserve you SIM for (dozen of) months without paying anything, don't worry, you pay whenever you want to use the SIM",
      "ah really ? and when I want to use it again I just start paying again ?",
      "Just checked, I have a substitution Win SIM that I've not payed since 15 months, but still receiving calls",
      "Ok cool ! Thanks so much",
      "I think with Win you can pause and resume your subscription whenever you want.",
      "i think you better go to a nearby agency and ask",
      "[removed]",
      "Orange dar Box ?"
    ]
  },
  {
    "post_text": "Wana/Bayn (now Inwi) nostalgic photos in 2000s Morocco",
    "comments": [
      "A little fewer pixels and this would become radio.  \nBest thing that came out of Bayn back then was that thing El fed and Koman made. Absolute comedy",
      "Koman ?",
      "You forgot the iconic charji b 1dhs hdr 1min",
      "my hecking nostalgic ads (kids today will never know)",
      "Anxiety for poor kids who had to own that god damn 3g modem, not to brag but i download 3d studio max and my studio and after fx with it"
    ]
  },
  {
    "post_text": "1gpbs price Orange/Inwi\n\nhttps://preview.redd.it/u3lc4zruwlwe1.png?width=993&format=png&auto=webp&s=d3bd5b9c15a4ff58f84da68ad53dd0a1257ebf28\n\nhttps://preview.redd.it/h3cjl03xwlwe1.png?width=1070&format=png&auto=webp&s=0b41525d4bf8208ea5bf0cc925c5b6c0308339bb\n\n",
    "comments": [
      "\\- Hey Inwi 📞\n\n\\- Hey Orange 📞\n\n\\- Whatcha doing ?\n\n\\- 200M at 449DH, 500M at 749DH, 1G at 949DH, same ?\n\n\\- Same\n\n\\- Love you\n\n\\- Love you too.",
      "So they’re on the same page 🤔",
      "they now if one lower the price, they woul lose costumers and have to lower more and then the companies are the real losers",
      "Capitalism: vu.",
      "al monafasa a charifa , and other jokes you can tell",
      "U can't have that with 3 telecom companies. It's an oligopoly"
    ]
  },
  {
    "post_text": "Win by Inwi : Vraiment la meilleure offre internet pour un étudiant ? (50/70 Go par moi)\n\nhttps://preview.redd.it/e9y417anx3ne1.png?width=512&format=png&auto=webp&s=773df9e67dc48523ab2474d8f01b381b33fedd65\n\nالسلام عليكم , j'aimerais avoir des informations sur cette offre. Fonctionne-t-elle bien pour partager la connexion de mon téléphone vers mon ordinateur afin d'étudier et de regarder des vidéos en haute qualité (au moins 720p) ? Actuellement, j'utilise Inwi et je trouve que c'est correct ( je trouve des probleme pendant la nuit (19;00-22:00) , mais ça marche). Si vous avez de meilleures options, n'hésitez pas à me les recommander. Mon utilisation mensuelle se situe entre 50 Go et 70 Go, et je passe très peu d'appels.",
    "comments": [
      "5 years in and to be fair it's nice, I had exactly three issues in total, all related to payment but got sorted out in less than 15 minutes with customer service.",
      "Ok ty 👍",
      "Si tu trouves inwi correct dans ta région alors win aussi le sera, c'est le même réseau\n\nWin bien sûr c'est plus généreux, application impeccable, mieux que celle officielle d'inwi, rien d'inhabituel à signaler pour ma part",
      "I suggest to get a 4g sim router or an old phone to share the wifi via hotspot, don’t use your main phone it will harm the battery",
      "Best service in Morocco, boosting the plan is insane, 8Gb for 15dh and second boost 15gb for 25dh.",
      "Kifash blan had boosting the plan???\nZ3ma fash kait9ada lk 9bl MN xhar??",
      "Ouiiiiiiiii fash katsala lik 9bel chher kadir boost w katzid ya gb ya ls appels",
      "Blaaan makantsh 3arf hhh\nTyy💙",
      "i’ve been using it daba 2 years and a half. I don’t have any major complaints. Correcte kifma glti",
      "Mal9yti m3aha 7ta moshkil MN na7iya dial partage de connexion l PC ???\n7it sm3t belli kat3akess",
      "La la dima kandirha 3adi",
      "Ok thanks 👍"
    ]
  },
  {
    "post_text": "Anyone know how I can use my inwi balance? This is ridiculous, I somehow have 1200 dh in inwi balance but I literally can't use it... I tried doing *120# and it shows my balance as 1270 but when I try applying it to 4g it tells me my balance is insufficient",
    "comments": [
      "And before you ask moul hanout had no idea how tf to use it... one of them said \"tfilaw 3lik\" and the other one said \"wlad l7hram hadchi machi b7al tesalat\" LOL",
      "Did you ever figure this out? I have the exact same situation and I am nowhere remotely close to an inwi branch. \n\nI have tried to buy every package imaginable with my inwi balance and they all return error of insufficient balance. What is the balance even for?  Makes no sense. I just want data only.",
      "I did actually figure it out. Basically we fucked up and that balance can only be used for talk + text and you can buy a \"video pass\" that lets you use youtube and spotify which sucks. The balance allows you to make phone calls and texts, and the \"bonus\" balance they give you literally does nothing.\n\nBest way is to just recharge it again, to recharge connection only you do the normal recharge process but then when you put in the recharge code you put \\*3 after it to add data only. If you recharge more than 50dh at once you get double, so if you recharge 50dh you get 10gb so def do that if you use a lot. You can just go to any moul hanout and ask for a recharge card and if they have the rapid one (where you give them your phone number and they do it) that's even better.\n\nIf you're really in a bind you can use the dirham balance to get a video pass which will let you use google + youtube + spotify, but be warned, once it runs out, even if you have a 4g balance it will block google + youtube + spotify but everything else works. It's sooooo stupid. The only two solutions are adding another video pass which prolongs the process or just wait for the video pass to expire. Anyways inwi sucks lol. Lmk if you have any more questions",
      "Thanks this is exactly what happened. After talking with Inwi support, they tried to tell me I could convert the Dirham recharge to a data recharge with the Convert'n feature and they gave me a *120 code to use. Well they were wrong about that. This convert feature is for enterprise accounts and only converts unused talk time hours to data gigabytes. With a Dirham recharge you don't have any actual voice hours. When they couldn't explain why it kept failing they said go to one of their branches, the closest being over 4 hours a way. Nope.\n\nSo for anyone else reading this, if you want data only you have to use the *3 on the recharge. Do it as mentioned above in the other post or, like I did, put the inwi app on your phone, navigate to the data package you want and when it asks for payment choose the scratcher code and enter it then.",
      "Good tips for people finding this thread. Hilarious that ofc they did not know what they were talking about. I will say though with the dirham recharge you can talk on the phone and text afaik. Hope you are enjoying your time in morocco",
      "Just use it on calls",
      "I don't have any use for calls - nonetheless I'm p sure it just tells me I have no minutes when I try calling anyway lol.",
      "I guess because its a bonus, you can only use the amount you paid to 4G but not the bonus you had from your recharge, i recommend you to switch your number to win by inwi its good and really cheap comparing to normal inwi sim card",
      "If you are living in Morocco! I am not sure if you are a tourist if it works or not",
      "So I didn't pay anything to 4g, the card came with 20dh initial and I added a 50dh card to the account. Then they gave me the bonus which i dont care about. I'm guessing this is where I messed up because I didn't add it to the 4g specifically. Idk am I basically just screwed out of that 50dh card now?",
      "Yeah exactly you have chosen the normal way it will give you 1250dh + 500Mo 4g if you need 4G you need to add *3 to the serial number and you will get 10 Go 4g access",
      "If it doesn't work on *120 *10# pass it's just a bonus (I didn't know they still do this since I moved to forfait a long time ago)\n\nBasically the bonus is at least the amount of the recharge. It went up to x25 at a time (10=250). I remember you can't use it to buy pass but directly (for calls/internet) once your pass runs out. But ofc it runs out very quickly.",
      "How can I use the 50dh card I added then? I don't even care about the bonus atp. I added the card by doing *120# and then choosing the 6: Recharge option (i think this is where I screwed up). I already had 20dh that came with the sim card and then the 1200 bonus which is bs..",
      "Yeah I think it's no longer possible to choose an internet/calls pass after doing recharge. Only réseaux sociaux and other bs",
      "Your local inwi branch will probably give you better information than reddit.\n\nIs this actually paid balance or some kind of points/bonus that you acquired?",
      "J’ai essayé d’ acheter un pass dans un jeu utilisant ce Solde Dirham et c’était bien effectué. Mais cela ne s’appliqué pas sur le Bonus Dirham (il ne sert à rien)"
    ]
  },
  {
    "post_text": "Frutiger Aero ads in Morocco for Wana/Bayn telecommunications (now called Inwi)",
    "comments": []
  },
  {
    "post_text": "My internet with Orange & Inwi works fine… until night hits\n\nNot sure if anyone else is going through this, but internet in Morocco (specifically with Orange and Inwi) is becoming a joke at night. During the day, it works fine. But as soon as the sun sets, the speed drops hard and the connection keeps cutting every couple of minutes.\n\nWe called Orange once and they told us it might be a power issue—yeah, apparently our router just gets tired at night. Said we should try plugging it into a separate socket. Fair enough. But right after the call ended, the connection magically fixed itself (though we didn’t do what they suggested right away, but we tried it the next day). Two days later, the same issue returned.\n\nWhat’s worse is we’ve switched between multiple providers—same exact issue. It’s like all of them are running off the same broken setup or just don’t care about ADSL users anymore.\n",
    "comments": [
      "I know it's awful I haven't had WiFi for 2 days now. Inwi ADSL. I'm at a loss with these companies. ",
      "It's unbelievable. ISPs in Morocco are a joke and fiber optics are overpriced.",
      "Not to mention the time wasted speaking to customer service. I'm tired. "
    ]
  },
  {
    "post_text": "INWIS:DS un juego cubano created by RPG maker por Dead Dog Studios®\n\nINWIS:DS\nUn RPG cubano bugueado, embrujado y hasta el cuello de sátira.\n\nRegino es feo. Tan feo que ni los NPCs lo miran bien. Cansado del bullying y las tallas pesadas, su fiel socio Sementín lo manda pa’ donde un padrino brujo a ver si con un poco de magia se puede arreglar la cara. Pero esto es Cuba, mi hermano, y la brujería no es garantía. El ritual sale del carajo y, en vez de hacerlo lindo, rompe el mundo entero.\n\nAsí comienza una aventura entre lo absurdo y lo infernal: texturas mal hechas, bugs visuales, personajes corrompidos, vacas que hablan de política y una realidad más glitch que lógica. Regino, sin quererlo, queda atrapado en un mundo destruido por un hechizo fallido... y lo peor es que aún quiere ser lindo.\nEn el camino, muere —literal— y va a parar al infierno, un lugar que se parece sospechosamente a Cuba, gobernado por un Diablo con uniforme verde olivo, para escapar, deberá derrotarlo, sobrevivir a discursos eternos y enfrentar horrores del más allá… y del más acá también.\n\nINWIS:DS es una sátira pixelada sobre la fealdad, el poder, el absurdo y la vida en un país donde lo más normal ya parece bug. Un juego hecho en RPG Maker con texturas rotas a propósito, humor cubano del más negro, y una historia tan loca como cercana.\n\nMás información en el canal de WhatsApp\nhttps://whatsapp.com/channel/0029VbA8fqN5q08fpzpSMv0V\n\nPronto la versión Demo disponible totalmente gratuita ",
    "comments": [
      "Avisa para descargar el demo y probarlo"
    ]
  },
  {
    "post_text": "Inwi Lance 50 Postes de Recrutement en 2025",
    "comments": []
  },
  {
    "post_text": "Carrière chez inwi: plus de 50 postes à pourvoir dans plusieurs villes",
    "comments": []
  },
  {
    "post_text": "Carrière chez inwi: plus de 50 postes à pourvoir dans plusieurs villes",
    "comments": []
  },
  {
    "post_text": "Is inwi's fiber optic any good ?\n\nHello guys, ramadan moubarak ! \n\nI am considering switching from IAM's 12 Mbps ADSL to Inwi's 50 Mbps fiber optic, it seems to me like the perfect option given that we do not have a coverage from Orange in our area, and I cannot afford to pay for the 100 Mbps that IAM suggests. \n\nWhat are you experiences with Inwi, is it any good, should i go for it ? ",
    "comments": [
      "yes it's better from iam , Maroc Telecom is just a sh**t",
      "There is no \"good \" fiber optic in Morocco",
      "Connection here isn't the best i'm aware but is fiber optic better than what i currently have ?",
      "Yep it's good , i recommend it"
    ]
  },
  {
    "post_text": "Carrière chez inwi: plus de 50 postes à pourvoir dans plusieurs villes marocaines",
    "comments": []
  },
  {
    "post_text": "Inwi i-dar duo plans\n\nIs there any body in here that has confirmed information about inwi i-dar duo (350dhs plan) data limit before the drop of the debit ? ",
    "comments": [
      "Yes",
      "So ? Tell us please 😅",
      "After a certain amount of GB, kiti7 debit. That's the case for all boxes. Ghir howa orange box 3ndhom a monthly amount (for example 300gb for the whole month) and inwi have a daily amount (10 gb/day). These are just estimates because it's been years since I used these boxes.",
      "Thanks, but I m looking for confirmed information not estimates.",
      "Good luck finding that info",
      "[deleted]",
      "There call cnter agents are  like robots all they say is : it is unlimited even if i make my question crystal clear about the data limit before debit drop down",
      "350DH dkhol fibre hsen lik"
    ]
  },
  {
    "post_text": "Maroc Telecom, Inwi partner to deploy fiber and 5G",
    "comments": []
  },
  {
    "post_text": "Inwi sim card recharge\n\nSo last night I purchased additional 100 Dhs on my inwi sim card but cannot seem to recharge for 4G internet. It says insufficient balance (using google translate) when I even tried only the 50 Dh internet package. Can someone please help me? I also tried using the app but it keeps getting error.",
    "comments": [
      "first things make sure the sim card is working well, second thing if you want internet u use *3\ncall\n120 wait then press 4 then enter the numbers code recharge then *3\n100dh =20Gb\nif you want no limit internet you can go to any agency inwi ask them for sim card vacay \n\nits 20dh then charge it by 300dh in any shop that sells phones electronic...\n\nrecharge normal without any *",
      "if you faced any issues DM me"
    ]
  },
  {
    "post_text": "INWI Recrute (57) Profils Différents dans Plusieurs Spécialisations",
    "comments": []
  },
  {
    "post_text": "Imessage on Win by Inwi\n\nHello, has anyone activated imessage on win i'm tried everything but i didn't succeed ",
    "comments": [
      "Endi win by inwi and i have iMessage activated. Idk how i did it though mais it is possible",
      "hhhhhhhh okey thank you"
    ]
  },
  {
    "post_text": "how to modify INWI ONE TOUCH X080C into a bootable USB ?\n\nis there a way to make it a bootable USB using a SD card ?",
    "comments": [
      "What even is this device you're talking about?",
      "Its an usb you put a SIM card on it to get wifi, there is a place for SD card but the pc dont recognize the card ( i tried 3 SD cards, all of them work fine on phone)"
    ]
  },
  {
    "post_text": "how to modify INWI ONE TOUCH X080C into a bootable USB ?\n\nis there a way to make it a bootable USB using microSD ?",
    "comments": [
      "Transforming your INWI ONE TOUCH X080C into a bootable USB using a microSD card is definitely interesting! Typically, the process can involve using some specific software applications like Rufus or Etcher to create a bootable drive. However, since this device primarily operates as a tablet, you might need to check if it recognizes the microSD in a way that allows booting.\n\nHave you already tried connecting the microSD to your PC first to create the bootable image? It might be easier to use a laptop or desktop to format and prepare the microSD before inserting it back into your tablet. \n\nAlso, what operating system are you looking to boot from the microSD? That could influence how you go about the process. Would love to hear your thoughts!"
    ]
  },
  {
    "post_text": "I stopped paying for an inwi subscription without ending it \n\nso I had a 200dh per month abonnement m3a inwi since I turned 18 Which I'm almost 23 now. the thing is with the pandemic my dad just decided to stop paying for it altogether without letting me know so I can terminate it, and since then I got orange and never looked back then I heard that you can't leave Morocco if you don't pay things like these? and also since orange absolutely sucked for me in MARRAKECH and ben guerir+ chefchaon and other cities and places tbh I heard that I can't get another abonnement with inwi.\nnow idk are these infos true? if so how can I fix it? if thet kept charging 200dh all these years then I have no god damn way of paying all that( and terribly don't wanna they cut off the internet after the first month of not paying so it would be crazy if that's the case)",
    "comments": [
      "They will charge 2 months but that's it, nothing else will come out of it",
      "Did they cut the service when you stopped paying?",
      "yes they did",
      "Then you don't owe them anything, they weren't charging you all these years because they stopped the service after your father stopped paying. They probably terminated your contract. I would ask someone in their agency just to make sure.",
      "thank you",
      "He owes whatever was \"used\" until they cancelled him. That's going to be a few months",
      "[deleted]",
      "I don't have anything from that time..",
      "I did the same. Mind you on the suggestion of the INWI guy in the agency.\n\nTurns out, you can't close your contract as long as it's arrears and they will potentially come after you",
      "the fuck and wth is arrears",
      "It means as long as you owe them you can't cancel the contract. If they know who you are then just not paying is definitely bad advice.\n\nAlso the fuck, translate your own words.",
      "okay fuck I will translate them myself next time\nthank you Imma go to the agency to check",
      "Dont be afraid! You can leave the countey even if you dont pay the two months! Because if its an old contract they will let you use the service 2 months after you stoped paying..",
      "Hello i have the same problem as you can you tell me what they told you in the agency?",
      "Me too!"
    ]
  },
  {
    "post_text": "Win by inwi connection ports\n\nSalam ikhwan knt drt abonnement dyal win by i inwi and when i tried using it to play a game on my laptop the servers dont allow me to join. After some research i figured out bli they r blocking connection ports and i wanna know ppl that r facing same problem ig they got any solutions ?",
    "comments": []
  },
  {
    "post_text": "Is there an Internet Outage with Inwi? Tetouan–Tangier region\n\nFor the past week and so and my router's signal been incredibly unstable. Is it happening to anyone else too??\n",
    "comments": []
  },
  {
    "post_text": "Campagne de Recrutement chez Inwi (58 Postes)",
    "comments": []
  },
  {
    "post_text": "Win by Inwi Issues\n\nAs the title goes , I am having problems with Win by Inwi .during the day thr speed is good . i can play with it with no lag spikes and minimum 60ms \nBut once l7al kaidlam and it reaches 7 dl3chya . The speed kati7 bezaaaaaaaf o it s impossible to play like 300ms with it but l3chya katkon mkhyra perfect . \nAre there any alternatives?",
    "comments": [
      "It's very common with 4G internet, it's unstable everywhere. Even with a good ping, you might notice some packet loss, and there's not much you can do about it. If you game a lot and want a more reliable connection, try getting a fiber line",
      "Dude I live in a university residence. That is the only option",
      "Oh, that’s unfortunate. I suggest finding a good spot with a stable network to play, and try limiting anything that might affect your ping, like Windows updates or other applications that consume internet.",
      "I do have Win by inwi, been using for months now, everything works well for me all day night, m not sure if this has to do to with your signal or you area! Any way regarding to ping it’s common with data internet it is indeed unstable, that’s why you need Fiber or at least Vdsl for gaming.",
      "Thats not a win by inwi issue \nThats a 4g issue at the night kaykoun deght bzaaf thats why it becomes unstable \nYou will not notice it if you're on social media or youtube but you will notice it while gaming",
      "In the evening it’s just the corn users who usually fuck up the bandwidth due to their watching hours 😂 so you will always have a struggle 😆"
    ]
  },
  {
    "post_text": "Win by inwi service\n\nBghit nbedel men Iam to Win by inwi, mes mnin chet lyouma review par internet l9ito 1 star, mes ana 3a9el chi 3 dial nass kano khedamin m3aya o 3endhom o khedam mezyan, bghit ghi nssowel is it worth it or not nbedel l win by inwi",
    "comments": [
      "Ana khedama bih, works totally fine for me",
      "Win by inwi &gt; Maroc telecom. hadok gha mkelkhin ola charyenhom maroc telecom",
      "Mafhemtch chnou bghiti te9ssed, mes Maroc telecom 3iy9o bzaf, ana db khdemt o tan deplaca bzaf maymkench lia ndir wifi o maroc telecome zero 3orod me9toula chekwa الله",
      "chno bghit n9ol lik hia Win by inwi houa a7ssen service lik. Maroc telecom tl9ahom khelsso bnadem bach i diro les bad reviews l win by inwi. T9der tdir mch7al bghiti f 4G o mch7al bghiti f les appels sms mzyana",
      "Not it’s good I use it, you can do a commitment free contract and cancel whatever you want, Also everything is in the app so you won’t have to move",
      "[removed]",
      "Mes hadak l3ard mab9ach kayen",
      "orange nadi sara7a dwzt m3ah chi 8 snin",
      "Orange fih 3orod mezyanin chwiya mais probleme dial mataychedch f ga3 lblayess inwi hssen meno f réseau",
      "fhmtk 7it ana knskon f blasa aktarya chadda l blasa"
    ]
  },
  {
    "post_text": "Is inwi 20 mega Fibre optique a good deal i'm a 12 mega adsl iam user \n\nFibre orange madayzex l 3ndna l9iit inwi dayz lina o maz3mtx hit katkhles ta router 150 dh ",
    "comments": [
      "fiber gives reliable internet even at peak hours. If you have shitty internet at 6/7pm, yes take fiber.",
      "I have a shitty internet all the day hhhhhhh",
      "ما بيهاش، الثمن مزيان، المهم أحسن بزاف من اللي عندك",
      "Lmhm hwa ykon lfer9 f lkhedma hit had adsl makaywslk.ta nes dyl dakchi li katkhles ☹️",
      "you'll get 20mbit/s download, 10mbit/s upload, very low ping, 249dhs a month, I think the router and installation is free. some users reported unstable connection, it could be true, or maybe they're just using wifi. what you have now is unstable 12mbit/s download, 1mbit/s upload. ping is 60 ms higher than fiber.",
      "They said i will pay 150dh for the router 🤷🏽‍♂️",
      "good",
      "I’m using 20mb adsl extra from inwi and it’s good so far with some minor bugs from time to time but it costs only 149 for the first year not like paying 249dh and still have suck interest",
      "Yeap that's the problem high price bad service maroc telecom",
      "Cracking deal!",
      "Im using 100mbps maroc telecom ou Im suffering I can't even watch  full hd videos",
      "I hate this operator 😤 no quality neither good prices",
      "Check Orange 50mb, way better for the same price",
      "are you sure?",
      "Orange madayzax lina fl 7oma hiya knt baghi ndir wlln 50mega dayra 350dh"
    ]
  },
  {
    "post_text": "STORMY participated in an advertisement for INWI with Achraf Hakimi by remixing his song POPOPO",
    "comments": []
  },
  {
    "post_text": "who had an inwi esim then transitioned to win\n\ni have an inwi esim and i wanna try smtg!!",
    "comments": [
      "I still dk kifach chihed chra lk sim and she cant be contacted rn to do the esim transition",
      "la asln u can’t lol"
    ]
  },
  {
    "post_text": "Inwi card limitless?\n\nGood evening everyone! \nI landed on monda in morocco and purchased a simcard with limitless internet and a few minutes of talking and i think 500 sms for 500 mad now when i use the internet it constantly sends me texts that my balance is empty.. \ntoday it was like 25 sms but i can still use the internet, made maybe 1 call which lasted 10 seconds and wrote not one sms \nCheers Mani",
    "comments": []
  },
  {
    "post_text": "Colleges and inwi sim card.\n\nCan I use it for everyday internet browsing or is it exclusively for educational purposes?",
    "comments": [
      "what",
      "They are giving out free sim cards when you enroll in a university so you can \"stay connected\" all the time",
      "I got one too , I think it's only working inside the university so u can connect to their wifi",
      "They looked me in the eye and lied to me,free internet they said,unlimited they said,everywhere you go they said. Time to do what my dad once did time to burn that shi",
      "So .I just learned it's practically as useful as sndala mwdra liha frda.",
      "Yh it only gives u  access without internet to the website of the uni"
    ]
  },
  {
    "post_text": "Win by inwi Lol",
    "comments": [
      "la3eb league tanta, daro fik khir , tstahl a bro",
      "Inwi told you to go touch some grass",
      "fach kano ybaniwni 14 knt kanfr7, kansmih conge hadak",
      "Get Orange, in one year I only had my wifi lose internet once for a few hours. That's a very good record.",
      "Game d zab khasshom gha 3la ybaniw bnadem (I got perma banned f chi 4 accounts hhhhhhhhh)"
    ]
  },
  {
    "post_text": "(40) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "(40) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "INWI recrute (50) Profils dans Diverses Spécialités",
    "comments": []
  },
  {
    "post_text": "résilier abonnement inwi\n\nBonjour,\nsvp comment résilier un abonnemet inwi? je me suis installée à l'étranger. J'utilise le chat sur what s up pour leur demander de résilier mon contrat, j'ai donné toutes mes infos, et là il me dit l'adresse que j'ai donné n'est pas correcte. je suis sûre qu'elle est correcte à moins qu'il y est une petite erreur . mais c'est injuste ils veulent pas me résilier et je n'est pas le contrat ici avec moi pour avoir l'adresse lettre par lettre. que faire svp? je souhaite aussi garder mon num marocain c est possible car je retournerai rarement au maroc.\nmerci",
    "comments": [
      "[removed]",
      "They refuse to let you go from abonnement to the free option and keep the number. But they have no right to refuse you end your contract and lose the number. Gotta choose one of the two tho",
      "i tried to do that last year, it was infuriating.\n\nSo i stopped paying and a few months later, they did it themeselves",
      "but I want to keep my morocczn number?",
      "you'll be able to keep your whatsapp number.",
      "Go to your myinwi account and check all your infos."
    ]
  },
  {
    "post_text": "What do y'all think??",
    "comments": [
      "IAM really said “pay more, get less”",
      "definitely a \"pay more, fck you\"",
      "well they might decrease their current pricing so that's a win.. assuming this is true it means my current internet 100mbps plan will get an additional 100mbps download upgrade so yeah.. and Inwi and Orange aren't everywhere you need like the whole building to want fiber for them to actually make the installation",
      "GPT : Maroc Telecom (IAM) and Inwi have entered into a strategic partnership to share their fiber optic infrastructure in Morocco. In March 2025, the two operators agreed to create two joint ventures—FiberCo and TowerCo—each owned equally (50/50). FiberCo is dedicated to expanding fiber optic networks, aiming to connect 1 million homes within two years and 3 million within five years   \nI think that won't be a problem anymore",
      "Overpriced asf, 1gbps makhasch tfout 500dh, and 1mbps upload speed is some stone age bs, they shouldn't advertise it in the first place",
      "I agree 100%, galik tandim mondial hhhhh",
      "I think that the ADSL cannot offer more than 1 Mb in upload speed because of cable limitation or something",
      "Yeah u're right, thanks.",
      "Il existe une technologie qui multiplie considérablement la vitesse de l'ADSL, jusqu'à 100 Mb/s si tu vis à quelques mètres du NRA, [**c'est le VDSL**](https://www.wikiwand.com/fr/articles/VDSL). Tu peux monter jusqu'à 100, voire 200Mb/s avec le VDSL version 2.\n\nJe ne sais pas si le Maroc y travaille ou non, mais ça peut être un bon moyen de palier à l'absence de fibre optique dans les quartiers \"moins prioritaires\", c'est à dire les plus populaires à faible pouvoir d'achat et qui ne peuvent pas mettre 1000 MAD/mois dans un abonnement.",
      "ignorance is bliss. that's the maximum possible upload speed of ADSL in the entire world.",
      "Sorry about that, I should've looked it up first. Thanks tho",
      "it's fine mate, we all didn't know at some point",
      "DSL cannot offer more than 1mbps in upload because its running on coper cables unlike fiber cables",
      "well considering its gonna be mainly for businesses thats kinda a fair price as long as its in the 900 - 800 range",
      "France:  \n\\&gt; 1Gb/s: €30\n\n\\&gt; Minimum wage: €1400\n\nMorocco:\n\n\\&gt; 1Gb/s: €100\n\n\\&gt; Minimum wage: €300\n\n💀",
      "Comparing France with any other country in the world regarding internet or phone packages is the biggest bullshit I've ever seen on reddit\nEven if you compare it with the minimum wage",
      "In Germany 1Gb/s is still 70€.",
      "Whats the minimum wage in Germany?",
      "Free's 8 Gb/s for 40€ 💀💀",
      "comparing things with other countries literally means nothing each country is different there is a reason why internet is far more expensive here that goes with the operating costs and so many things and limitations by ANRT alot of things are involved to make it expensive and the fact they need very expensive equipment to make new fiber optic lines basically sometimes block an entire road just so they can install a few cables and it can take a while too its really expensive to do that stuff here so that ends up hurting us aswell with the prices so dont be comparing a completely different country with something like this where everything is totally different also the standard for 1gbps is around 80 to 100 dollars so that price is fair enough and your not gonna be needing it anyways because its mainly focused on businesses anyways what you gonna do with 1gbps connection your not trading you dont have a hosting company most people wont need it",
      "seeing how you are using pixels so frivolously, clearly we need better internet",
      "hhhhh I need more of them pixels",
      "So expensive, sorry man I’m paying about 200dh in France for 1g/s, all of them are scams in Morocco.",
      "So sad to see these prices",
      "Really? Which provider?",
      "Wtf, why is Morocco so expensive...",
      "1 Mb/s in upload is a joke, a joooke, they didnt even increase it",
      "half assed speeds with double price",
      "ADSL limit.\n\nnothing they can do.",
      "ADSK is dead, as the cables can support a max 20mb, but in realty they support less like 17-19mb att max that is why they have 16up and 1mb down, don't expect any increases in ADSL as they will not spend money to change cables with batter new ones for old technology as that is why fiber is becoming more cheaper its just that IMA don't offer like 50mb for 250dh or everyone will change to it , if your still ADSL user don't expect any more speed increases",
      "Bjouj ghalyine af",
      "wayeh bzaf",
      "So basically AFAIK IAM is gonna rent their FTTH infra to both Inwi and Orange. That is good IMO since it's been years of waiting for Orange to install That shit in my neighborhood, where IAM been there for years. the disadvantage was that IAM prices are too high and they have limited options.",
      "The point is to have new companies selling internet to customers while the large internet provider sell in bulk.",
      "wlad l97ab 7awyinna f kolchi",
      "hawina men lor o l9dam wlad 9hab",
      "Pause",
      "LOL HAHAHAHAHAHAHAHAHAHAHAHAHHAHA PAUSE!!!",
      "wdym l9dam",
      "![gif](giphy|ltoVrEYgv30GJvSDOk)",
      "This shit should be met with boycotting",
      "Boycotting the internet? Thats literally impossible for most people.",
      "you def can they'll feel they're not making a profit, in algeria they started with 300mbps for 22500 da now 1.2Gbps is for 4200da which was 4600da months ago prices keep crashing, they even introduced a weekend pass where u can get the max speed then back to ur offer",
      "definitely",
      "yeh will not happen ever as this are lower prices then before why would anyone boycotte anything",
      "Source ?",
      "all of these are rumors",
      "3anzouni hhhh",
      "but mostly true right now there running test and people with 100mb like me in IMA did change to 200mb as im having 200mb, on 16th it's went from 100mb to 200mb then 14h later went back to 100mb, then also today back to 200mb again",
      "EVERYTHING is overpriced, price for 100Gb 5G in asia....around 30 dhs  \n\nWe want an end to that scam",
      "I feel you bro they're fcking us up the ass",
      "50MB orange is good",
      "U tried it ?",
      "I have it is good\nInternet market in here still sucks though",
      "a friend have 50mb and he did lower it to 20mb fiber and even that was good work fine for everything it's just that fiber is batter and more stable then ADSL unless u downloads and upload ton of stuff daily then all you need is 20-50",
      "yes",
      "Overpriced af",
      "Awdi I have the 20Mb/s inwi plan, on a good day it will reach 6-7MB/s.",
      "so sad 😞",
      "I have the inwi home sd card thing, on 1-2 pm it reaches up to 40mbps, but after that it can even reach 0.5mbps",
      "that ADSL, fiber is different thing as cables are batter i have 100mb IMA for 4 years now and it's been 99mb/95mb, all time and now it's 194mb/195mb , try to get fiber inwi i guess 20mb as its will be batter",
      "IAM will never reach what you pay for",
      "True but at least it’s very reliable unlike others",
      "Oh trust me it is the farthest thing from reliable. It keeps cutting off and their support service is asscheeks.",
      "Not true. I get what i pay for in optic fiber.",
      "That 20 for IAM is adsl while for orange and inwi it's via fiber optics",
      "Expensive",
      "Why is Inwi  cheaper than IAM? also i just saw in Inwi's website that their 50dh \\*3 =10Gb of data, while IAM 50dh \\*3= 7 GB of data",
      "As far as I know, they aren't allowed by the ANRT to make better offers because they have are an established company with very large infrastructure, so they can crush the competitors easily if they were allowed to, that's why Inwi and Orange will remain cheaper until they catch up to IAM.",
      "If I’m paying 500dhs for 100Mbps, is the price going to change automatically?",
      "No, the debit is gonna change, assuming all this is real.",
      "no i have 100mb rom IMA and now it's did turn to 200mb, but wait till it's official and we see prices and if 100mb is 350dh then go to them and ask to lower your speed back to 100mb and start paying just 350dh as myself im thinking about it as 100mb extra save only when downloads stuff",
      "If I’m paying 500dhs for 100Mbps, is the price going to change automatically?",
      "I've heard some people got their debit increased to 200mb",
      "No they only change the debit ,you still gonna pay 500 but for 200mb instead of 100mb",
      "Iam 20Mb/s 249dh is official?\nHit site mazal dayrin 399",
      "dakchi ligalo wlaho a3lam",
      "still not official there only testing cables now and people get this leaks as many people speed did change like my 100mb IMA did turn to 200mb 2 times now first was on 16th for 12-15h went from 100 to 200 then went back to 100 and today again im att 200mb, as once they change everything there website will change as will",
      "I pay 500dhs for 100mb whats going on here?",
      "same here",
      "you speed will change to 200mb up/ 200mb down as its did happen to me already now go from 100 to 200.",
      "7it m7takrin so9 kydiro mabghaw",
      "ANRT",
      "I heard that ANRT are the reason why its overpriced",
      "Hella overpriced",
      "Wa5oya hadak rah salir dyal wa7d 5daam nhar kaml",
      "Wayeh asadi9i rah maimkench",
      "Wladl97ab mdowrina hadchi li kain",
      "and the grammy goes to ..................... ANRT",
      "Whaaat since when do we have gigabyte internet, I thought we were still at 200mbs max.\n\nStill overpriced as shit tho",
      "This should be top comment. Mnin jabou les offres dyal 1Gb ?",
      "Yeah I just went on their website dial IAM o 3andhom 200mb b 1000dh. Rah hadchi ki tsmma ikhtissab",
      "Still overpriced for the services they are providing.",
      "20 mb for 159 dh is like heaven to me i pay 200dh for only 300kb , even if it's expensive asf it's better than mine",
      "50mb b 250 katban mzyana + 50mb kafya wla la ?",
      "Kafia pour naviguer et regarder des vidéos...etc même pour jouer en ligne avec un Ping de 20ms-100ms. Mais 250 ghalia comparée à d'autres pays où il y a de la conccurence.",
      "Still higher as fuck",
      "Wait. What we have 1Gb internet in Morocco. Fiber to your home. What city is that? That is nice to hear.",
      "all cities and homes as long fiber cable can be set to your home",
      "![gif](giphy|Q7EuOsu0mGeLDgwc9x)",
      "Can i get the source ?",
      "Wait! I pay 500dhs for 100Mbs of FTTH with IAM. Did they change prices ?? I only get IAM in my neighborhood",
      "The speed will probably double soon...",
      "u will get 200mb i have 100mb ima and now it's 200mb",
      "Algeria has better internet than us !",
      "Having 1GB available is definitely great, though it should be 500 mad at max if they really want to win this battle.",
      "500dm its impossible as they also don't want everyone with 100mb to have 1gb as im very sure they will not be able to handle that on there cables the outages will go everywhere, but atlas they should have made like 500mb att 500dh and 1gb att 750dh  its cost a lot but still a manageable price for people who want high speed as only need it to downloads as watching and streaming stuff 100mb is enough",
      "Still over priced , but better than nothing, c'est conferme ?",
      "Still rumors, although many people noticed their bandwidth doubled from 100 to 200 mb/s.",
      "Rumours say they rolled some tests and people with 100mb had their internet speed up to 200mb and that they will be rolling these changes starting from next week, we'll see if this is real or not, prices vs what you get is still expensive but if its true, this is better than what we had.",
      "just wait for ur neighbors to buy it then tap into their fiber duh",
      "is this real ? nice at least we got fibre IAM for 350 better than 500 dhs after all",
      "idk if this is real",
      "i think it's is i have 100mb and on 16th went to 200mb, then roll back to 100mb and today back to 200mb , at first i did think glitch but 2 time impossible so there testing before rolling it next week or week after i guess",
      "This is probably fake because companies cannot agree all at once idk if it ever happened",
      "no it's happening as reason why for myself i do have 100mb IMA, and on the 16th it's go from 100mb to 200mb for 15h then its did change back to 100mb and i did thin k it's was a glitch but ton of people did have the same thing and today again it's change to 200mb so this is them testing it i can see if they can manage the upgrade on there cables and system and they will roll it to everyone soon",
      "[ANRT](https://fr.wikipedia.org/wiki/Agence_nationale_de_r%C3%A9glementation_des_t%C3%A9l%C3%A9communications)",
      "I am 35 years old bro, you have to pay me if you want me to think",
      "I didn't realize Maroc telecom increased their download speed for FTTH for the 500dh pack until right now. Just checked my internet speed and it's actually averaging 190mbps",
      "I currently live abroad and i totally forgot how shitty internet speeds are in morocco. This is overpriced af btw. But this is \"normal\" since the 3 or 4 main service providers control the market prices without making the services any better.",
      "They're all shit",
      "Inwi lai3amerha dar",
      "Btw they use the same infrastructure",
      "Anyone here got inwi/orange fibre? Is it worth im thinking of buying it",
      "First of all, the infrastructure should be better if they really wanna sell for that high price and orange/inwi has network problems since they depend on iam cables but they have better wifi tbf",
      "In russia i used to pay 250 ruble per month for 200mg i’m not even kidding",
      "The upload speeds of maroc telecom might not be that acurate. At least I know that the 200mbps offer has 200 in upload also. Don't know about the others though.",
      "IAM sara7a dayr m3ahom fibre 100 mb diman tay3tini 99 / 100 bla cable ethernet ila nzal y9dar ywsal l 90 sara7a mzyan wakha prix machi b7al concurrence wlakin 3lama taygolo liya nass li 3andhom inwi ola orange blli internet 3andhom 3ayana \n3lama kan gal liya wa7ad technicien f inwi blli cable dyal lfibre dyalhom tayakhdoh mn 3and IAM l79ach hiya bo7dha li jayba net",
      "The prices should be like this:  \n25 mb : 40 dhs  \n100 mb :  99 dhs  \n500 mb :  149 dhs  \n1 gb   :  199 dhs  \n10 gb  :  299 dh",
      "I don't understand, someone care to explain?",
      "Its bout network instead of decreasing the price they gonna increase debit",
      "From where you get that ?",
      "From FB",
      "Source ?",
      "Taxi kbir lmao",
      "Trust me bro",
      "many people including me get there fiber speed 2x and after that soem leaks did show i have 100mb and now its 200mb",
      "When is that happening",
      "When's this taking effect ?? will people need to get new contracts or do they just start paying less for existing subscriptions ?",
      "no, if you have fiber like IMA and you pay 500dh for 100m then your speed will change to 200mb , and if you pay 1000dh then your speed will change to 1gb i think if 100mb is att 350dh then you can go to them and ask to lower from 200mb to 100mb and then you can pay less",
      "Bs the website shows the old plans",
      "the website is down, probably this post sent us all looking for confirmation on [iam.ma](http://iam.ma) :D",
      "Orange.ma and iam.ma neither is down",
      "because this are only leaks due to there testing as i have 100mb ima and now it's att 200mb, its went to 200mb then back to 100mb on 16th and today its 200mb so there testing there cables and stuff before this go official soon",
      "Any idea where this will happen? Right now, I'm using 20 Mb/s Inwi (250 DH/month).",
      "For people that say the prices are high compared to Europe lately i worked for a Canadian ISP and the prices are way more expensive then i checked prices for Australia and it's the same so you could say that we're not an exception , and apparently the prices are high because of the same reason as Morocco :Monopoly.\n\nAnother thing I've herd there was some sheets with prices circling the internet and they said that they are meant for each other  (IAM selling infra to Orange/INWI) and not for the client I'm not sure if this is one of them (hope that this one is for us the clients).",
      "Bro the reason why Canada is expensive is because it’s a very big country, covering it is difficult and snow conditions make maintenance even more expensive. Morocco is easy mode compared to that. Plus if you compare smig of both countries and how much a month of connexion cost in % we are more expensive than Canada. \nI’d be curious on margin levels on fiber sector by country, I’m sure that Morocco is on the top 10 at least.",
      "Did they. Change the speeds??",
      "for me yes, on 16th go from 100mb to 200mb for 15h then drop back to 100mb, and today it's back again to 200mb so there still just testing i guess",
      "When will these prices change? I atill pay 500dh for 100mg iam",
      "they will chnage your plan from 100mb to 200mb",
      "Kifesh IAM 100M at 349? Since when? Is this a special pricing?",
      "I am also looking for this price but nowhere to be found, website of [iam.ma](http://iam.ma) is not working",
      "this is not official yet as post didn't say this will go live soon as there testing speed now as i own 100mb ima and now it's did change to 200mb and people with 200mb did change to 800mb to 1gb speed, as they say next week or maybe longer as there testing now and many people get there speed 2x like me i have 100mb ima and now it's 200mb",
      "When those prices going to be  launch ? cuz last month i paid 499 dh for 100mb/s wwith IAM",
      "and you will still pay 500dh as your speed will change to 200mb when this is official so i guess after this go live you can go and ask to downgrade to 100mb for 350dh",
      "are these prices for normal internet or fibre? because at my place there is no internet yet and IAM want to lay fibre but they say they only have the 249 or the 499 option. For me the 349 option is enough, but idk if that's also an option in fibre",
      "this stuff is not official yet wait next week or the week after as they didn't change prices yet or doubles everyone speed, check there fakebook starting next week when they have 350, 100mb then go and get it",
      "O 3ad zid 3liha kat9eta3 bzzaaf",
      "Source please?",
      "non as this are just leaks due to testing going on by IMA like for me i have 100mb and on 16th its went up to 200mb for 15-16h then drop back to 100mb, but again tonight it's up again to 200mb",
      "I dont know from where you got those prices, but in orange website its more than that",
      "source: trust me bro",
      "what?? since when is Maroc Telecom offering asymmetrical internet speeds and since when are they offering 1gbps ??!!",
      "At least when it comes to Mobile, costs are fairly reasonable 250dh with Orange 🍊 for unlimited internet is a good deal. Usually it’s 50$ in most places outside Morocco",
      "when will this go into effect?",
      "When that shit is coming?",
      "Opportunistic accountability-free monopolistic capitalism haha",
      "just rumors",
      "aged like milk",
      "Is this true ? Where did you get this from ?",
      "it's crazy how this got all of us shocked , like 1 Gb for 1000 dh that's so expensive ( and it is ) but for the last gazillion years it was 200mb for the same price ; That just shows how crazy expensive it was ; i hope it's an eye opener for a the people still , in 2025 , saying why do i need 200 mbps ?",
      "My parents are still paying 249dhs for 12mb/s wtf\nEven these prices don't exist on their websites",
      "What funny, is that Moroccans have no issue with this at all",
      "Overpriced as Hell, yesterday I was approached by Orange offering 1Gb/s for 29€ and some good equipment offering WiFi 6E and many more including TV",
      "I’d love to replace my ducking 200mb for 1 gig for the same ducking price.",
      "there is no product such as 20Mb/s for 249dh the only product that IAM provides is 12Mb/s for 249dh also you pay 400dh upfront   \nthere is no product such as 50Mb/s for 249dh in Orange/Inwi they give you 50Mb/s in the 3 first months after that its 20Mb/s for 249dh but its FIbre Optic  \n100Mb/s same they give you 100 for the 1st 3 months then its 50Mb/s    \n100Mb/s is for 449dh in Inwi And Orange and they give you 200Mb/S for the 1st 3 months and 500dh in IAM  \n200Mb/s is for 650dh in Orange and Inwi and 1000dh in IAM which an insane difference.  \nwe dont have 500 nad 1G in Morocco yet but what do yall think its gonna be for ?? if the 200Mb/s is for 1000dh a month 1G will be f 5000dh a month ?! LOL",
      "dima 7awina",
      "Where have you seen the orange offer of 100mb for 350dh, when I looked it up I get 3 months 100mb for 350dh then 50mb for the rest of the subscription",
      "For inwi adsl price is 149dh for one year after that it will be 199dh",
      "So current customers dyal 500dh, we will get the free 100mbps for download, or we have to pay smth else, and when will the changes be applied?",
      "u will get free 100 do and 1000 up as this info is wrong IMA is same as the others 200down/200up",
      "read this deleted pdf IAM published  \n[https://www.scribd.com/document/848179490/Partage-FTTH-OTT-IAM](https://www.scribd.com/document/848179490/Partage-FTTH-OTT-IAM)  \ngo to page 22",
      "Hmm it definitely looks like it needs more calculation and these speeds (from page 19) are probably for businesses (banks and similar stuff maybe ?)  \n100 MB/s &lt;= Débit &lt;= 200 MB/s123,00200 MB/s &lt; Débit &lt; 500 MB/s165,00500 MB/s&lt;= Débit &lt; 750 MB/s262,00750 MB/s&lt;= Débit &lt;= 1 GB/s335,002. ",
      "Greedy pigs overpricing things than Europe.",
      "not really then some europ country not all as ther eis overpricing in europ Germany with 75euro or more for 1gb and in Sweden as will as i know this 2 and USA as will",
      "Most of this is wrong",
      "for the people that are complaining that the prices are high in confront to europe , you need to know that  these companies have a fixed cost , and they set the prices  to the potential number of customers , morocco has a rate of 7 people  to 100 having a landline subscription in confront to france that have 50 ."
    ]
  },
  {
    "post_text": "Inwi top up cheap from outside Morocco",
    "comments": [
      "Jumiapay, u re welcome",
      "Finally worked. Thanks.",
      "Unfortunately never received the sms code for opening account",
      "Been using it for months, weird",
      "For me it didn't work unfortunately. I tried to use revolut virtual credit card.",
      "i love u so much",
      "I have the same issue with Orange Maroc, I think they don't accept EU cards anymore.\n\n  \nI either use Orange Transfert Pays or Xoom with PayPal to top up the card.",
      "What card are you using?",
      "I have tried with Caisse d'Epargne and LCL cards from France and I see this issue.",
      "I mean, what card you topping up with xoom?",
      "Ah sorry, the ones listed above. I bank with LCL and Caisse d'Epargne and I use them with Xoom. However, someone else recommended Jumia Pay and I feel it's better because you can select what kind of top up you want (at least with Orange Maroc)",
      "ok thank you bro",
      "I have an account with CIH, I’m in Canada and I just recharge with the app on my phone",
      "It works because you have a CIH account. I don't have a banking account in Morocco and just for that, i want to open one.",
      "Finally, I found the solution with the JumiaPay app.\n\nThe registration process is a bit complicated, everything is in French.\n\nThey will send you an SMS code to complete the registration. They only accept numbers from certain countries, otherwise the SMS code will never arrive. I suppose they only accept numbers from Morocco or Africa.\n\nAfter registration, you can pay without fees and with a credit card. I used my Revolut card and it worked."
    ]
  },
  {
    "post_text": "طلب استرجاع رقم الهاتف النقال من إنوي WORD PDF INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك فورفي إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب استرجاع رقم الهاتف النقال من إنوي WORD PDF INWI ",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك فورفي إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الهاتف النقال مع إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الهاتف الثابت مع إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الهاتف النقال مع إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الهاتف الثابت مع إنوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "yoxo by orange vs win by inwi\n\ni’ve had the 100dh/month yoxo plan (25Go et 3hrs natio) since last summer réseau is soooo good wakha e-sim mera mera katfa mais it’s fine, wlkn recently chft win dayra for 109 dh/month 3atyiiin 35Go et 3hrs too sooo im really tempted to switch but idk… WHAT SHOULD I DO\n\nps: 3dna fibre fdar ou wifi f la fac ou any uni mchit i just like to stay connected and keep my location updated f find my!!",
    "comments": [
      "Win katkhtar l plan li bghiti ou kigolo lik chhal atkhlss m3rt wch kyna hta f  yoxo oula la ou f win ila mkhlsstish l abonnement la ligne ktbqa khdama f yoxo waqila la , + win mafihash e sim",
      "Ana khdit e sim d INWI o switchitha l win , daba khdam b win, you can choose ch7al bghiti d internet o ch7al d hedra, ana db dayr 15G + 1h b 49dhs, t9ed twsl tal 70 Gega f internet je pense, o kaina ta l option dles réseaux sociaux pour 15dhs... ila kenti f medina fiha réseau inwi mzian ahsen offre how dial win",
      "so win kat supporti esim right ?",
      "Yes khod esim d inwi o 9lebha win ghatkhdem sur place",
      "Testithom bjouj o ngolik win r5issa t9der t5tar plan li bghiti o tbdaha w9tma bghiti katkoun 3ndk 30 jours dyalk yoxo ghalya 3la win katbda l abonement f 1 f cheher o katsali f le5er d cheher yoxo khfifa 3la win good ping f games , la bghiti abonnement ha 3la 9bl social media fb insta... go for win la bghitiha 3la 9bl chi haja kat7taj cnx khfifa go for yoxo",
      "saraa7a i noticed 4G nt3 yoxo khfiiifa wlkn i only use 4g l youtube safari etc…. saaafi hta social média ma3ndich wa9ila i better stick to yoxo wakha déjà requestiiit n résilier",
      "I use yoxo 50dh d orange and i love it, they give me 1H free calls and 2GO and when my data depletes i still have whatsapp, IG, facebook and snapchat illimitée and i have calls mn orange n orange for free",
      "hadi machi yoxo hada forfait yo 3adi",
      "Yesss"
    ]
  },
  {
    "post_text": "نموذج فسخ عقد اشتراك الانترنت مع انوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "نموذج فسخ عقد اشتراك الانترنت مع انوي PDF WORD INWI",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الانترنت مع انوي PDF WORD Inwi",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك الانترنت مع انوي PDF WORD Inwi",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك مع إنوي PDF WORD Inwi",
    "comments": []
  },
  {
    "post_text": "طلب فسخ عقد إشتراك مع إنوي PDF WORD Inwi",
    "comments": []
  },
  {
    "post_text": "Inwi Money still operates?\n\nI was abroad for a moment, the app is not working anymore and it is handy for me especially for my online phone plan bill. \nDid the usually uninstall/ install, used Android and iOS. No answer online … Anyone? ",
    "comments": []
  },
  {
    "post_text": "INWI website evolution",
    "comments": [
      "Really missing MSN :')",
      "Bayn 😔",
      "Bayn \"3G\" modem was gonna be my reason to end it all. Thanks the lord I survived that."
    ]
  },
  {
    "post_text": "Need Advice: Orange Dar Box 4G+ or INWI Vacay Wifi/I-Dar for 1-Month Stay in Morocco?\n\nHi everyone,\n\nI plan to go to Morocco for a month and need reliable WiFi for work while there. Since I think it would be best to have unlimited data, i've narrowed it down to the Orange Dar Box 4G+ and the INWI Vacay Wifi/I-Dar. \n\nHas anyone had experience with either of these services? Which one would you recommend or maybe another? Thanks!",
    "comments": [
      "Both are ok. Didn't see any difference.\n\n  \nThose aren't exactly unlimited. With both services you'll end up with limited rate if you've used too much data (hundreds of GB). Somehow, this can be circumvented with PairVPN, though it's a bit of a hassle.\n\n  \nIf you're working with web apps, or googling a lot, the limited rate can hurt.\n\n  \nI wouldn't bother buying a box, just insert the sim card in a phone."
    ]
  },
  {
    "post_text": "Inwi Morocco LTE B38 only test with roaming",
    "comments": [
      "Not bad speeds for roaming on another carrier and it's usable enough for the average consumer. Ping times are high due to routing back to home network servers and maybe; Inwi Morocco only provides (Telekom) customers to (b38) only; or that site doesn't have all their frequencies, bands deployed.",
      "Weirdly enough, if no B38 is present (or it's &lt;-120dBm), other available bands can be used.\n\nThough I have seen much better speeds, even on B38. So it's not that good, but I only have 5GB intl. roaming a month anyways."
    ]
  },
  {
    "post_text": "What's the Deal with Maroc Telecom and Wana Corporate (inwi) 's legal dipute?\n\nI Heard this morning about the Rabat commercial court ordering Maroc Telecom to pay Wana Corporate a gigantic compesation of 6.368.371.743 DH ( Six Billion ) for alleged  \"anticompetitive behaviors\" .\nI tried searching for further details about the dipute and its reasons but to no avail .\nCan anyone shed some light on the topic ?",
    "comments": [
      "Maroc Telecom is the historic operator, and had total monopoly before the sector liberalization. \n\nAfter the liberalization, it was still hard/impossible for new operators to compete with the historic one, especially for fixed broadband, as MT owns all the wire connection to the individual houses.\n\nMost developed countries implemented Local Loop Unbundling regulation, where the historic operators have to allow new entrants to use its physical connection (to the client) for a fee. \n\nThat's how a lot of cheap internet providers started popping up in Europe in the 2000s and 2010s (like free, for example).\n\nApparently, MT is not allowing other operators to use its local loops or making it complicated or something like that.\n\nBut the fine is very high (not the first one), and it's always suspicious, knowing who owns INWI...",
      "who owns inwi? lmalik?",
      "Yep, the royal holding Al Mada owns a majority 69% stake.\n\nNot saying that this had any impact on the judgement, but that's a LOT of money not to be asking questions about whether Inwi got a special treatment from the courts or not.",
      "Suspicious. But if it hurts Maroc Telecom I am for it. :D",
      "Maroc telecom is 20% state owned.",
      "ye idk, not sure being the king helps u out in court, im sure people sued the king before",
      "Sue the king? hahaha\n\nNo, I'm pretty sure MT is guilty, but 6 billion dirhams is a lot of money, and it's very healthy to wonder whether the fact that the plaintiff is a royal company might have had any impact on this.",
      "u cant sue the king? srsly?",
      "Bruh, until the 2011 consitution, the King was \"chakhssiya mo9adassa\". \n\nBut even with the new consitution, disparaging or insulting the king is a crime. Suing him... that's next level insults.",
      "ok but is it possible tho?",
      "Dunno, you can try haha",
      "bruh I wouldn't",
      "i mean sure i doubt anyone would try it, but is it possible is what im asking, legality wise",
      "MT is refusing / blocking access to the network infrastructures for other operators and thats illegal."
    ]
  },
  {
    "post_text": "(69) Nouvelles Offres d’Emploi chez Inwi sur Plusieurs Villes",
    "comments": []
  },
  {
    "post_text": "(69) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "INWI illusions \n\nI have been using inwi since 2020 and it was all good till yesterday when the wifi stops working  and when I called em they say u have a missed payment of November 2023 and bc there were a problem in our system it didn't appear till lately and u have to pay it now. I am sure that I was paying every month but I do not keep invoices.  \n\nDoes anybody here faced similar situation? Bc I have seen alot of ppl in the agency having similar prblm ",
    "comments": [
      "[deleted]",
      "I did ! But there were payments that my dad who paid em in inwi agencies",
      "Inwi is such a dog shit company, they have zero customer service. Ever since I switched to orange life's been good.",
      "The thing is where I live the signal is weak nd only one that worked a bit is INWI 🥲🥲",
      "I had a problem with them in the past concerning their ADSL service. Thank god for orange fiber lol",
      "Gotta think to switch then",
      "In terms of reliability I think orange is the best."
    ]
  },
  {
    "post_text": "Which operator is better in Agadir coast area (Inwi, Orange or Maroc Telecom)?\n\nSalaam, \n\nI'm wondering which one of the 3 network operators Inwi/Orange/Maroc Telecom has the best coverage and most stable data connection in the small coastal towns north of Agadir.   \nI'm looking for the one that I can use for a 1h zoom meeting because the hotel doesn't have wifi. \n\nShokran! ",
    "comments": [
      "[removed]",
      "Shokran for the help!",
      "[removed]",
      "That's perfect! Okay shokran again!",
      "maroc telecom actually has the best coverage...",
      "[removed]",
      "Depends on what you're talking about. Maybe all the people in your area have a maroc telecom 4g box. But in term of coverage maroc telecom is the best and inwi is the worst.",
      "Ugh, all of then suck ass. I had Maroc Telecom for basicly all my life here in agadir, their shit sucked, then changed to Orange, the fiber optic was good for a couple of months before it started being stupid.\n\nIf I was to pick the least bad option, then go with orange, they have the widest fiber optic network.\n\nAre you in Anza area by any chance?",
      "Thank you for your help! I'll probably go for Orange then. And I'm close to Imsouane."
    ]
  },
  {
    "post_text": "Got a message from a number I don't know on an inwi SIM card\n\nI'm on holiday in Morocco at the moment. I bought an inwi SIM card from a mini market near me (10gb of data) and I just got a message from a random Moroccan number I don't know saying \"slm\" and \"cv\". I have no clue who this could be, or how they got my number as even I don't know what my number is (my phone just says \"unknown\".) It's especially odd as I received the messages at around midnight.\n\nAny idea what this could be?\n",
    "comments": [
      "when you stop reloading your SIM card for a while the service providers resell it. they were probably trying to text the previous owner and weren't aware that their number was recycled.",
      "Mini market? You mean just out of the street, not in the main agency… if this is the case, probably the person who bought you this number is the one",
      "or a recycled sim card? Anyway, it's kinda weird to not activate your simcard in agency since it's associated to your ID",
      "- It may be the guy who sold you the card, he noted the number.\n\n- It may be someone trying to message the old number holder (but I don't think it's that)"
    ]
  },
  {
    "post_text": " Offres d’emploi à INWI Dans Plusieurs Spécialités (65 Profils)",
    "comments": []
  },
  {
    "post_text": "(65) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "Inwi sim router\n\nHello guys need help please. I got the inwi router, the one you place a SIM card in it and take everywhere you go. But wanted to know, if I buy a different router from the market and insert the SIM card, would it work? Or it must always be an inwi router. Thanks 🙏🏻",
    "comments": []
  },
  {
    "post_text": "Inwi's ADSL-Extra\n\nHey, so I've been using Inwi's ADSL for the past few months, while it never reached the promised 20mb/s but I was still happy with the \\~16mb/s I got, but since January the line went down and I've been calling them ever since but all they say is \"okay we're on it\" and they did nothing, is there anyone that has/had the same issue? and is Orange's fiber optique worth it ? ",
    "comments": [
      "Just get fiber optic if you can.\n\nHonestly it almost feels like they are purposely making the service worse on ADSL, as I remember when I was back in Morocco and was trying to fix my family’s internet in a limited time, they would always waste my time upselling me fiber instead of trying to fix the issue and check the local exchange whether some thing is wrong there or whether copper pair cable’s signal is deteriorating somewhere.\n\nBut ultimately fiber is the future in Morocco, so just commit to it if you are able to.",
      "I'll be getting fiber soon but I don't know which ISP I choose, IAM is kind of overpriced and there's no way i'm doing anything with inwi ever again",
      "Ive been using inwi ADSL since 2021 in two difderent cities, 3 houses. My experience was mostly positive, the speed is on average 16mb/s and at worse 8 mb/s for an hour at most. Everytime I had an outage I either fixed it with basic troubleshooting or just waited for few hours for the internet to come back (morocco). For the price I'm paying 150dhs a month I get to stream movies, download games, use multiple devices at the same time.\nP.S: your neighborhood plays a huge role too, if there are other inwi ADSL customera nearby, you'll have to share the internet with me, but most people don't use ADSL from inwi."
    ]
  },
  {
    "post_text": "Is someone was able to activate facetime using Win by inwi sim card?",
    "comments": []
  },
  {
    "post_text": "Campagne de Recrutement Inwi 2024 (66 Postes)",
    "comments": []
  },
  {
    "post_text": "شركة إنوي Inwi تعلن عن حملة توظيف (66) منصب في عدة تخصصات",
    "comments": []
  },
  {
    "post_text": "(66) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "Inwi eSIM issues\n\n\n,\nCurrently on holiday from\nLondon\n\n\nI bought an eSIM today in Essaouira. As my phone was bought in the US so or can only take esims. They helped me set it up and realised when I left the  data was not working and the pages not loading or what’s app messages not being delivered. \n\nI went back and they said give it an hour for it to activate. \n\nIs this normal? Now I had my\neSIM for two hours",
    "comments": [
      "Just in case, try reboot your phone, that’s usually fixes data issues for me.",
      "Shukran. I rebooted a few times and still no fix.",
      "That’s not normal. Just get Airalo. It’s just $5 for 1GB with a discount code MANOLE3606",
      "Yeah I used Airalo and I am ready to go in less than 5 mins.",
      "No, eSIM should work right after installing and activating it. Just install an eSIM app and purchase eSIM there - Yesim or Airalo are the best options. 5GBs of data in Morocco with Yesim cost 22EUR and 30EUR with Airalo."
    ]
  },
  {
    "post_text": "guys what is the best fiber optic iam or inwi?",
    "comments": [
      "IAM if you can afford it and/or you're a teacher (you get a discount)\n\nInwi if you're broke\n\nADSL line is oversatured in most neighborhood, 4g is starting to saturate too. But fiber is still decent",
      "Orange",
      "Orange is cheaper than IAM. \nYou get the same service"
    ]
  },
  {
    "post_text": "Inwi recrute des Responsables Data Centers",
    "comments": []
  },
  {
    "post_text": "شركة اينوي Inwi تعلن توظيف مسؤولين عن مراكز البيانات",
    "comments": []
  },
  {
    "post_text": "Inwi recrute des Responsables Data Centers",
    "comments": []
  },
  {
    "post_text": "(63) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "(63) Nouvelles Offres d’Emploi chez Inwi",
    "comments": []
  },
  {
    "post_text": "Inwi 2023 : (37 Postes)",
    "comments": []
  },
  {
    "post_text": "Maroc Telecom ordered to pay Inwi $635M for unfair practices",
    "comments": []
  },
  {
    "post_text": "شركة إنوي Inwi تعلن عن حملة توظيف في مختلف التخصصات بعدة مدن",
    "comments": []
  },
  {
    "post_text": "Campagne de Recrutement Inwi 2024 (59 Postes)",
    "comments": []
  },
  {
    "post_text": "Inwi recrute des Chargés de Clientèle",
    "comments": []
  },
  {
    "post_text": "شركة إنوي Inwi تعلن عن حملة توظيف في مختلف التخصصات بعدة مدن",
    "comments": []
  },
  {
    "post_text": "\"Immo Tommy\" – Abzocke mit Schrottimmobilien? | NDR.de - Nachrichten - NDR Info",
    "comments": [
      "Ach,  der Kerl bei dessen Reels ich immer gleich weiterwische, wenn er in meinen Empfehlungen auftaucht. Kerle mit fetten Uhren die mich auf Social Media an ihrer Weisheit teilhaben lassen kamen mir immer etwas spanisch vor.",
      "Ich hab (auf YouTube) gute Erfahrungen damit entsprechende Werbung als \"get rich quick-scheme\" zu melden. Hab da mehr als einmal ne positive Rückmeldung und die Info über Entfernung der Werbung bekommen. \n\nSollte dann ja bei content erst Recht funktionieren... :)",
      "Weiß nicht, vielleicht bin ich da etwas zu anspruchsvolle aber wenn man bedenkt wie Schnell Youtube \"überprüft\" of gewisse Content Creator Werbetreiber Freundlich sind und sie dementsprechend monetarisiert oder demonetarisoert, da sollten man meinen dass die im vornerein schon überbrüfen ob die Werbung Konsumentenfreundlich ist.\n\nDas da Leute wie du erst Werbung melden müssen ist finde ich inakzeptabel. \n\nAber ich sehe sie nicht, ich nutze ein Plugin, dessen Name mir gerade entfällt, das sämtliche Werbung anglickt und für mich ubsichtbar im Hintergrund laufen lässt.\n\nSo bekommt der CC Add Revenue weil die Werbung auf den Video \"gesehen und geklickt\" wird, die Website wie beispielsweise YouTube bekommt Geld vom Werbetreibenden weil die Werbung \"gesehen und geklickt\" wird, aber letztlich sieht niemand die Werbung.",
      "&gt;Das da Leute wie du erst Werbung melden müssen ist finde ich inakzeptabel. \n\nBin ich grundsätzlich bei dir, würde mir auch anderes Vorgehen an der Stelle wünschen. Und ja, meistens bin ich auch mit AdBlock unterwegs, deswegen begegnet mir das zum Glück auch selten. Ich wollte vor allem auf die grundsätzliche Meldemöglichkeit aufmerksam machen. \n\n&gt;Aber ich sehe sie nicht, ich nutze ein Plugin, dessen Name mir gerade entfällt, das sämtliche Werbung anglickt und für mich ubsichtbar im Hintergrund laufen lässt.\n\n&gt;So bekommt der CC Add Revenue weil die Werbung auf den Video \"gesehen und geklickt\" wird, die Website wie beispielsweise YouTube bekommt Geld vom Werbetreibenden weil die Werbung \"gesehen und geklickt\" wird, aber letztlich sieht niemand die Werbung.\n\nAuch eine sehr schöne Option! Gefällt mir gut!",
      "Spanier hassen diesen 1 Trick.",
      "Was können jetzt die Spanier dafür? No es su culpa!",
      "Dann gönn dir noch Inkasso Ingo 🤣",
      "Hab den Typen noch nie gesehen. Kann es sein das ich nicht Zielgruppe bin ?",
      "Möglich. Wobei ich auch nicht seine Zielgruppe bin. Der Algorithmus wird schon Gründe haben.",
      "Siehste, er ist nichtmal Spanier.",
      "&gt;\"Ich dachte, mit jungen Jahren kann man ja besser anfangen als mit 30.\"\n\nAlso das ist jetzt schon ein bisschen verletzend...",
      "Keine Sorge. In 30 Jahren ist es ihm peinlich :D",
      "Ruhig Opa das große Gruscheln auf StudiVZ ist lange vorbei",
      "Also bei Dates nicht mehr nach der ICQ Nummer fragen?",
      "ICQ gibt's nicht mehr.\n\nDas ist komplett abgeschaltet.",
      "Ich hab den Anfang und das Ende von ICQ mitgemacht, ich bin alt...",
      "Rheumsalbe gegen den Schmerz?",
      "Ja, bitte",
      "Jetzt pass mal auf du junger Stöpsel...",
      "So Jung bin ich auch nicht ich kenn noch die 50 Std AOL CDs 🤣",
      "Bitte um Verzeihung. Soll ich Ihnen über die Straße helfen?",
      "Werten Dank 😂",
      "🤣😂😅😁😄😃😀🙂🥲🤨😕😟😔😞😢😭",
      "Falls er noch minderjährig ist, kann Papi den Vertrag vielleicht anfechten… /s",
      "&gt; Einige Käufer haben die Immobilien vorab nicht einmal persönlich besichtigt.\n\nich hätte ja schon Angst beim Handykauf über Kleinanzeigen oder Autokauf, aber die finanzieren sich einfach eine Wohnung ohne die gesehen zu haben? \n\n&gt; Für welche Gegenleistung diese Summen bezahlt wurden, war in den Verträgen nicht ersichtlich und die Käufer sagen, sie wurden über den Zweck der Zahlungen nicht aufgeklärt. [...] Bei einem anderen Haus betrug der Kaufpreis rund 550.000 Euro -  hier erhielt Tomislav Primorac 90.000 Euro\n\nwieso unterschreibe ich etwas und bezahle etwas, was ich nicht verstehe, wofür ich das bezahle? Einfach mal 90.000 zahlen und nicht wissen, wofür?\n\nEdit: hier auf Reddit vor einem Jahr \n\nhttps://www.reddit.com/r/Finanzen/comments/17ueus6/hi_hat_jemand_von_euch_schonmal_erfahrungen_mit/\n\n&gt; Immobilie in der nähe Stuttgart (40 km) - Kernsanierung - KfW 55 - Kaufpreis pro qm über 6000€ für eine 20 qm Wohnung\n\n&gt; Bruttorendite 3% - Zinssatz 4% bei 1 % Tilgung\n\nlol",
      "Bei du versteht es einfach nicht deswegen bist du auch nicht reich. Gibt mir einfach 25.000€ und ich erklärs dir ganz im Detail undso /s",
      "Wenn du das /s weglässt, bist du nächstes Jahr auch Millionär",
      "Ich glaube da bin ich hier im falschen Sub 😋",
      "keine Sorge, das Idiotensieb ist sehr grobmaschig. Die Leute die auf sowas reinfallen sind hier nur am mitlesen, selbst schreiben werden sie nicht",
      "Ey, ich mach dich Millionär. Trust me Bro. Komm in die Gruppe und wir werden siegen. Die gleichen psychologischen Mechanismen, die bei großen roten Rabatttafeln einsetzen, setzen auch bei großen Renditeversprechen ein.\n\nViele Meschen haben in diesem Land keinerlei Finanzwissen und verstehen nicht, dass Rendite immer nur durch entsprechendes Risiko erkauft wird. Letzteres kann durch  Diversifikation zwar gesteuert werden, aber es gibt einen Leitspruch, den jeder verinnerlichen soll:\n\nNichts im Leben ist umsonst, nur der Tod – und der kostet das Leben",
      "Rendite und Risiko setzt voraus, dass auch tatsächlich investiert wird. \n\nProvisionen u.ä. fallen da nicht drunter.",
      "Und dann auch noch Kredite mit 10jähriger Zinsbindung und OHNE TILGUNG… - reicht die Fantasie nicht aus, um sich vorzustellen, dass man damit nur die Bank finanziert?",
      "Ist dann einfach ein endfälliges Darlehen. Kann man in bestimmten Situationen sicherlich machen, wenn man die finanziellen Konsequenzen versteht.",
      "Ich wollte doch nur mal aus der Komfortzone raus und was machen, was sonst keiner macht :(\n\nBeim nächsten Mal versuche ich mir dann einfach ins Knie zu schießen, ist auch außerhalb meiner Komfortzone und macht sonst auch keiner.",
      "Vermutlich wurden da Passagen nicht (richtig) gelesen, vielleicht auch zum Kauf gedrängt. Gibt es ja auch bei richtigen Immobilienmaklern.",
      "Das Bild sagt \"Vermögen aufbauen mit Immobilien\".  \nDas lässt ja erstmal offen, um wessen Vermögen es sich dabei handelt.",
      "Genau das. Er selbst hat ja offenbar gut daran verdient.",
      "Es... gibt Leute die \\*echt\\* bei den Youtube/tiktok/Insta \"Investment\" Leuten nicht nur irgend nen doofen \"Kurs\" oder ein \"Coaching\" kaufen sondern gleich ein Haus?",
      "Früher waren es geschlossene Immobilienfonds oder Schiffsfonds, die von windigen Bank- und Finanzvertretern den Leuten angedreht wurden, heute sind es windige Aktien-, Crypto- oder Immobilieninvestments, die von windigen Tiktokern / Youtubern angedreht werden.\n\nDu kannst die Menschen halt nicht vor ihrer eigenen Dummheit / Naivität / Gier nach Rendite schützen. Das sind alles erwachsene Menschen, die mündig und selbstverantwortlich leben und vielleicht irgendwann aus ihren Fehlern lernen.",
      "Ja vielleicht komm ich einfach trotz guter finanzieller Stabilität heute aus zu anderen Verhältnisse als das ich mir auch nur irgendwie vorstellen könnte „mal eben ungesehen“ ne fucking Immobilie kaufen zu können. \n\nIch mein, ich bin in der glücklichen Lage seit einigen Jahren tatsächlich eine zu besitzen aber ich war vor dem Kauf so völlig überspannt dass ich zweimal da mit nem Gutachter durch bin und dann immer noch vor dem Notartermin gefühlt ne Woche nicht geschlafen hab. \n\nUnd dann rennen irgendwo Leute rum die das auf Zuruf von nem TikTok Guru machen? \nDas… das krieg ich nicht ins Hirn, da weigert sich mein Kopf.\nAber vielleicht bin ich auch nicht gierig genug oder was auch immer. ",
      "ich finds auch unvorstellbar, weil ich mein Geld auch immer eng zusammenhalte. Aber ich glaube, die die da abgezockt werden, sind oft auch nicht Mittel- oder Oberschicht sondern Menschen mit sehr ausgeprägtem Aufstiegswunsch. Eine Finanzierung klingt da machbar und mit den tollen Versprechen dieser charismatischen (??) Männer, lässt man sich da wohl gut einlullen",
      "Herzlichen Kuchentag!",
      "Möchten sie einen Hochsee-Container kaufen ?",
      "Ich würde annehmen, dass sie diverse Coachings schon durchlaufen sind. Das Geld wollten sie vorher mit Juice Plus, Tupperware oder CFD Trading verdienen, haben aber alles an die Kursanbieter verloren und sind jetzt zu einem Erbe gelangt, womit sie den Eigenanteil decken konnten. Jetzt ist alles futscht und sie suchen weiter nach passives Einkommen.",
      "Vertrauenswürdiger und seriöser Name, wer kauft da nicht?",
      "Wer hätte es gedacht 🫠",
      "Das ist das grundsätzliche Problem mit allen Influencern. Tommy  praktiziert es halt nur im großen Stil und bei ihm kosten die Schrottprodukte dann statt 100€ gleich mehrere 100000€. Und schlechten Service gibt es dazu.\n\nKeine Ahnung,  inwiefern es überhaupt legal ist wenn man auf der einen Seite als seriöse Informationsquelle und Berater auftritt und das auf der anderen Seite dann zum abzocken der Verratenen benutzt.",
      "Diese ganzen immo Heinis auf YouTube sind mit immer sehr suspekt schön das mich mein Gefühl nicht trügt. \n\nSchade um die Leute.",
      "Sry, aber das ist halt echt verdient.\n\n&gt; Hinzu kommt: Einige Käufer haben die Immobilien vorab nicht einmal persönlich besichtigt, vertrauten offenbar den Versprechungen von \"Immo Tommy\" und seinem Netzwerk.\n\nWie dämlich kann man eigentlich sein?",
      "&gt; &gt; Hinzu kommt: Einige Käufer haben die Immobilien vorab nicht einmal persönlich besichtigt, vertrauten offenbar den Versprechungen von \"Immo Tommy\" und seinem Netzwerk.\n&gt; \n&gt; Wie dämlich kann man eigentlich sein?\n\nIch hatte mal beruflich mit dem Thema Betrug bei Immobilien zu tun und das passiert tatsächlich häufiger als man denkt. Teilweise sogar nicht nur keine Besichtigung, sondern nicht mal eine Suche bei Google Maps und die Person war dann voll überrascht, dass das Haus zwischen zwei Gleisen quasi unbewohnbar war.",
      "Ja.",
      "Typ verarscht Leute und kostet die ihre Ersparnisse.\n\nEin Redittor kommt ihnen zur Rettung: \"Bist halt selber schuld.\"\n\nUnd er flog wieder davon. Mit sich selbst glücklich, ohne etwas beigetragen zu haben.\n\nAuf, auf und davon!",
      "Leute die sich Immobilien ungesehen kaufen, würden dann eben auf einen anderen Betrüger reinfallen, wenns nicht der wäre. Anzumerken, dass das maximal dämlich ist, ist legitim.",
      "Weitere Beispielsätze die zum Nachdenken anregen:\n\nLeute die zum blöd zum fahren sind, sterben auch mit Airbag.\n\nWie war denn das Mädchen angezogen, als sie vergewaltigt wurde?\n\nDer kann ja nachts in der Gegend auch nicht mit so einer Uhr herumlaufen, dass schreit ja nach: Überfall mich!\n\nHat die nicht gewusst, dass der Kaffee bei McDonalds so heiß ist? Selber schuld wenn die sich verbrüht.\n\nHättest mal besser in der Schule aufgepasst, dann hättest du jetzt auch einen besseren Job. Wer wird auch Bäcker? Koch bei Burger King ist was für Teenager und nicht Erwachsene Familienväter.",
      "You could suck your own dick with that stretch.\n\nEs ist absolut nicht abwegig anzunehmen das Menschen die so gutgläubig sind das sie 6-stellige Beträge für ungesehene Immobillien raushauen auch auf andere Scams reinfallen.",
      "Kann ich verstehen. Richter entscheidet, selber schuld. Bitte weiter scammen. Sollen die alle selbst aufpassen. /s",
      "Wuäh, das Ding im Internet hat mir ein Spiegel vorgehalten. Ich mag nicht reflektieren. Sondern mich über andere erhaben fühlen. Wuäh. Lol",
      "Ist es nicht Tommy wäre es wahrscheinlich ein nigerianischer Prinz gewesen…",
      "und was hast du jetzt beigetragen? wie ist deine meinung und haltung zum thema?\n\n da wurden bzw. werden menschen abgezockt, die sich größte mühe geben, sich aber auch wirklich abzocken zu lassen. und in all diesen fällen ist es immer dieselbe kombi. menschen, die es zu einer relevanten sparsumme gebracht haben, wo das wort \"investieren\" am horizont auftaucht. aber eben auch das wort \"gier\".\n\ndas sind menschen, die immobilien unbesehen erwerben. die verträge nicht tiefergehend prüfen lassen. man sagt doch schon, dass man zum kauf eines gebrauchten autos jemanden dabei haben sollte, der zumindest nach dem wesentlichen schauen können soll.\n\naber nein. es ist halt auch zu verlockend, oder? wenn ich da jetzt meine ersparnisse von 100.000 euro rein buttere, purzeln in nur 8 jahren bestimmt drölf millionen euro wieder raus. sagt der tommy. und wenn der tommy das sagt... also dann.\n\nsolche sachen müssen fachlich, juristisch und gesellschaftlich aufgeklärt werden. es muss informiert, erläutert, abgegrenzt und beraten werden. und dann sind diese leute, wir, am ende des tages im rahmen ihrer mündigkeit halt unterwegs.",
      "Leute die Immobilien als reines Investment ansehen. Mein Mitleid hält sich in Grenzen.",
      "Was soll man denn sonst sagen bei so offensichtlichen Scams und der Ignoranz der Opfer?\n\n\"Oh das tut mir jetzt aber leid ich hoffe die bekommen Ihr Geld zurück und Tommy geht in den Bau!\"\n\nSchön, haben wir das abgehakt. Scammer wie Tommy gibt's schon so lange wie es eben auch eine Währung gibt, egal ob das Euro, Mark, Münzen oder damals andere Gegenstände waren und doch laufen immer wieder Leute quasi WISSENTLICH in diese Fallen.\n\nEs ist ja schon ein absolutes Lottospiel wenn man quasi Zwangsversteigerte Immobilien erwirbt ohne diese zu sehen, die Summen um die es dabei geht sind aber um einiges kleiner als bei den Immobilien hier. Sich da den Bums nicht mal anzuschauen ist schon eine Einladung auf die Fresse zu fliegen.\n\nIm Vertrag potentiell was zu übersehen, ok passiert, oder auch zu viel Zahlen weil man keinen Kollegen dabei hat der sich potentiell auskennt ist ja noch geschenkt.\n\nDiese Leute sind einfach gierig und müssen auf die Fresse fliegen und dafür auch geächtet, damit anderen nicht das gleiche Schicksal widerfährt.",
      "Wer so grenzdebil ist und sechsstellig Immobilien kauft ohne sie zu besichtigen nur weil ein Typ im Internet das so sagt dann hält sich mein Mitleid halt sehr in Grenzen.\n\nDas Geld wäre so oder so weg. Entweder an den nächsten Crypto-Scammer oder einen nigerianischen Prinzen.",
      "Findest du dann die Opfer des Enkeltricks sind auch alle selbst schuld?  Der ist ja auch total offensichtlich. \nWarum haben Leute es verdient betrogen zu werden nur weil sie gutgläubig oder etwas naiv sind?",
      "Opfer des Enkeltricks wollen ihre Liebsten in einer schwierigen Situation unterstützen, Opfer der Tommy Abzocke wollen aus Fremden gute Rendite für sich selbst erwirtschaften. Keine Ahnung warum du das in einen Topf wirfst.",
      "Und das rechtfertigt die Abzocke dann? Interessante Moralvorstellung...",
      "Auf der einen Seite werden die Opfer emotional unter Druck manipuliert. Hier hat sich das Opfer nicht einmal die Mühe gemacht die Immobilie vor dem Kauf zu besichtigen. Ein Immobilienkauf macht man nicht einfach so in wenigen Sekunden wie eine fälschliche Überweisung, sondern der Prozess dauert. Da fühle ich mich echt nicht schlecht, wenn man dem Opfer hier eine gewisse Verantwortung zuspricht und dann halt 'selbst schuld' sagt.",
      "Bei den Opfern des Enkel Tricks ist es deutlich nachvollziehbarer warum sie auf so einen Schwachsinn Reinfällen als bei den Leuten hier",
      "Und das rechtfertigt das dann? Interessante Vorstellung von Moral...",
      "Ich habe nichts gerechtfertigt, ich habe nur gesagt das nicht alles was hinkt ein Vergleich ist. \n\nIst klar asozial was der Typ abgezogen hat und gehört auch verfolgt, das spreche ich nicht mal ab. Ich sage nur das man von „digital natives“ eigentlich auch etwas mehr Medien Kompetenz Basics erwarten können sollte.",
      "Da sind aber schon ein paar kleine Unterschiede:\n\n1. Beim Enkeltrick wird i.d.R. mit einer dringlichen Situation Druck aufgebaut um das ganze schnell abzuwickeln\n\n2. Es wird eine emotionale Komponente ausgenutzt\n\n3. Es ist kein notarieller Vertrag nötig\n\n4. i.d.R. sind die Opfer des Enkeltricks nicht sonderlich vertraut mit dem digitalen Raum\n\n\nHier hingegen geht es um einen Prozess der Wochen bis Monate dauert, einen Notar beinhaltet und durch 30 Sekunden googlen ist der \"Betrug\" aufzuklären:\n\nhttps://www.schwaebisch-hall.de/baufinanzierung/wissenswertes/checkliste-hauskauf.html\n\n\nÜbrigens ist nicht mal sicher, ob das Ganze wirklich Betrug ist und die Hürden dürften sehr hoch sein, wenn das ganze ordnungsgemäß beim Notar abgewickelt wurde.",
      "Tut mir um die geschädigte Gier&amp;Oberchecker-Bubble nur eingeschränkt leid. \n\nAber vielleicht kriegen die das Geld über irgendwas mit Crypto wieder rein.",
      "Auf jeden Fall, komm in meine WhatsApp Gruppe und ich zeige dir wie /s",
      "Mir tust du dann später auch nur eingeschränkt leid, wenn du per enkeltrick abgezockt wirst. Aber vlt holst du das Geld dann bei ein paar Kaffeefahrten wieder rein :)",
      "Danke für den Hinweis mit der Kaffeefahrt, aber da ist mir eine Woche Bullreiten mit Rheiner lieber ü  \n  \nDeinen Vergleich der hier vorhersehbar gescheiterten Investoren und den hilflosen alten Leuten, die von Kriminellen in Angst und Panik versetzt worden sind, finde ich eher schäbig.",
      "Gibt immer Gründe für Leute die abgezockt werden. Ob du noch jungs bist und keine Ahnung vom Leben, oder alt bist und langsam senil wirst. So oder so sollte man Mitgefühl mit den Opfern haben.",
      "Immo Tommy macht miserable Verträge innerhalb geltenden Rechts. Ansonsten würde der Verbraucherschutz wohl empfehlen zu klagen. Die Enkeltrickbetrüger geben sich als etwas aus das sind nicht sind. Das ist nicht von der Kunstfreiheit gedeckt.\n\nDie Omi wird zu etwas verleitet, dass sie nicht möchte. Würde sie die wahren Umstände kennen. Verena möchte etwas und hat es auf Wish bestellt, weil sie die wahren Umstände nicht interessiert haben.",
      "Okay und was ändert das? Ich habe einfach nur ein überspitztes Beispiel dafür gebracht, dass jeder abgezockt werden kann und da nie die Opfer schuld sind.",
      "Menschen denken sie können als Vermieter ohne großen Aufwand auf Kosten anderer leben und werden dabei abgezockt. Tragisch. ",
      "Dazu sagt man dann auch \"Gier frisst Hirn\"",
      "Wenn man sich manche Mietpreise in Städten anschaut, ist diese Annahme aber auch nicht sehr weit her geholt.",
      "&gt; In der Regel handelt es sich um eine Kombination aus Kreditvertrag und Bausparvertrag, mit Laufzeiten von 20 Jahren und mehr - ohne Tilgung. Das heißt: Es werden nur Zinsen bezahlt, aber der Kredit wird nicht kleiner, die Immobilie wird in dieser Zeit nicht abbezahlt.\n\nWie kann so etwas überhaupt legal sein?",
      "Influencer verkaufen Schrott? Ja Leck mich fett, das ist ja Mal eine News! Eigentlich ist es egal ob ein Influcer das Produkt nur bewirbt oder es eines seiner Produkte ist, man kann sich in 99% der Fälle sicher sein das es im besten Fall irgendein unnötiger (Abo-)Schrott ist und im Schlimmste Fall sowas wie hier ist. \n\nWer dafür Geld ausgibt ist selbst Schuld.",
      "Soll ja auch influencer geben, die tatsächlich aufklären. Und Immo Tommy hatte einiges an Content, der genau das vermittelt hat. Natürlich ist es trotzdem doof, ihm einfach 90k € zu überweisen, aber nicht alles, was Influencer bewerben, ist automatisch Abzocke",
      "&gt;Hinzu kommt: **Einige Käufer haben die Immobilien vorab nicht einmal persönlich besichtigt**, vertrauten offenbar den Versprechungen von \"Immo Tommy\" und seinem Netzwerk. Dass sie den Kaufvertrag ohne Besichtigung unterschrieben haben, bereuen heute viele. **Der Käufer aus dem Raum Osnabrück etwa erklärt seine Entscheidung so: \"Ich habe mich zu sicher gefühlt. Ich wollte einfach mal aus der Komfortzone raus und etwas tun, was nicht jeder macht**. Im Nachhinein war das ein Fehler.\"\n\nIch würde sagen: Ziel erreicht, oder ?",
      "Ich denke, Häme und moralische Überlegenheit sind immer deplatziert, zumal die Leute wahrscheinlich schon genug gestraft sind. Aber eines möchte ich anmerken: Ich kann mir gut vorstellen, dass nicht wenige dieser Betrugsopfer genau diejenigen sind, die sich bei Berichten über Rentner, die durch Leichtgläubigkeit mit dem Enkeltrick oder Callcentern um ihr Vermögen gebracht werden, süffisant kommentieren, das könne ihnen nie passieren und ihr Unverständnis darüber zum Ausdruck bringen, wie naiv und unvorsichtig ältere Leute sind.",
      "Ich will mich nicht über diese Leute stellen und mir tut es leid, dass sie so abgezockt wurden, aber mein Mitleid hält sich auch in Grenzen, da Menschen aus dieser Bubble jetzt nicht die Sozialsten sind und immer die ersten die gegen den Sozialstaat hauen ala jeder könne reich werden alle andere seien nur dumm und faul.",
      "Es gibt zig verschiedene Betrugsmaschen.  \nDie einen kriegt man über Hilfsbereitschaft (Enkeltrick), die anderen über Gier (Crypto), die nächsten kann man einfach überrumpeln und zum Kauf \"zwingen\" (\"Butterfahrten\"), wieder andere über Gutglauben (\"brauche Geld für Operation\"), manche über Einsamkeit (Heiratsschwindler)...  \nVmtl. sind sehr viele Menschen für die eine oder andere Art empfänglich für Betrug, vlt. die meisten, keine Ahnung... Aber Menschen haben doch i.d.R. irgendwo einen wunden Punkt, und wenn man sie dort packt werden sie schwach.",
      "Es ist ganz einfach, der Mensch ist ein soziales Wesen und soziale Kooperation benötigt Vertrauen. Je misstrauischer man ist, desto weniger anfällig für Betrug, aber desto größer der Mehraufwand bzw desto häufiger unnötiger Verzicht auf profitable Kooperation.\nJe gutgläubiger man wiederum ist, desto stärker die Anfälligkeit für Betrug.\nUnd natürlich gilt die Kosten/Nutzen -Rechnung auch für den Betrüger. Daher sind es dann doch oft recht simple Maschen... Es pendelt sich alles irgendwo ein... Aber verwundbar ist prinzipiell jeder.",
      "Immer wieder Bemerkenswert wie viele auf so etwas reinfallen. Oder auf dubiose Windkraft oder Container Investments. Und gleichzeitig sind Aktien viel zu Risikoreich und böse.",
      "Jaja unterschrieben ist unterschrieben. \nDie Leute tun mir echt leid, deren nicht-wissen wurde von Hurensöhnen fatal ausgenutzt. Und das systematisch.\n\nPersönlich bin ich auch der Meinung das die entsprechenden Banken da auch den Kopf hinhalten müssen. Ich bin mir sehr sicher dass er da ein Netzwerk von Mitarbeitern bei paar Firmen hat und es immer die selben Berater sind.\n\nSelber haben wir auch ein sehr ähnliches Erlebnis gehabt . Gutes Angebot wurde vom ah so tollen Berater paar Tage vor Notartermin durch ein neues ersetzt wo verpflichtetende Sondertilgungen auf Seite 4 versteckt waren und die Konditionen einfach Dreck waren. Auf den ersten Blick war die monatliche Rate gleich. Wurde von mehreren Mitarbeitern ständig angerufen ich soll das Ding doch unterschreiben.\nDas alles vor dem Notar Termin, absoluter Albtraum. Und vorher war ja alles geregelt... Das ganze war ne bekannte Bausparkasse. Absolute Drückermethode! 'ich will das ursprüngliche Angebot!' 'ja das hängt im System und wird nicht mehr rechtzeitig fertig zu ihrem Termin' what???",
      "Danke das du die Banken mal erwähnst, finde das so suspekt dass die da gemacht haben. Hätte erst mal erwartet das die Kreditverträge über irgendwelche PE Fonds o.ä. laufen aber nicht über \"normale\", bekannte Banken. \nIch gebe zu ich habe von Immobilien keine Ahnung aber das es Verträge ohne Tilgung gibt finde ich sehr komisch.",
      "Wie kann man überhaupt irgendwas, das bei Youtube, Instagram und TikTok beworben wird für bare Münze nehmen, und sich bei einer so großen Investition wie einem Immobileinkauf auf einen windigen „Influencer“, der sich auch noch „Immo-Tommy“ nennt verlassen, anstatt auf einen Sachverständigen, der das Objekt überprüft bevor man einen Kaufvertrag unterschreibt…\n\nManchmal kann man nur den Kopf schütteln, aber das sind die gleiche Art Leute, die früher blindlings irgendwelche Schrottimmobilien im Osten gekauft hatten. Damals waren es aber immerhin Bankberater mit wenigstens einem Anschein von Seriosität, die die Dinger vertickten.",
      "Ach? Jemand der im Internet \"So wirst du reich\" Kurse verkauft will nur seinen eigenen Vorteil?\n\nNein!",
      "was tiktok investment verkäufer sind nur auf ihren eigenen gewinn aus? da konnte ja niemand mit rechnen \\*überraschtes donnermaus gesicht\\*",
      "&gt;Videos, in denen der bekannte Influencer mit insgesamt etwa zwei Millionen Followern auf Social Media Tipps gibt\n\nGrundsätzlich gilt wer via Youtube, Tiktok, Instagramm \"Tipps\" zu vermeintlich einfachen Vermögen o.ä. gibt ist nicht seriös. Immer wieder erstaunlich wie naiv die Leute mit diesen Medien umgehen aber gut für manche sind sie ein Quell unendlicher Wahrheiten...",
      "Der war mir schon immer suspekt mit seinen Tipps",
      "Interessant wie der Neid sich eine Wohnung leisten zu können hier auf einmal das ganze Mitleid mit Betrugsopfern beiseite wischen zu scheint. Die armen Leute! Wollten halt Investieren und wurden betrogen…",
      "Ich versteh es einfach nicht. Es gibt so viele kostenlose Tools zum vergleichen von Angebotspreisen und dann kauft man einfach so eine Immobilie? Ich will die Kraft der Manipulation durch solche Kanäle nicht verharmlosen, aber ist es so schwer mal nach Standortanalyse oder Immobilien Markpreise zu googlen und dann zu vergleichen? Es gibt doch genug kostenlose Möglichkeiten sich einen Überblick zu verschaffen. [interaktive-standortanalyse.de](http://interaktive-standortanalyse.de), [immobilienscout24.de](http://immobilienscout24.de) und auch [immowelt.de](http://immowelt.de) bieten richtig brauchbare Tools an und jeder mit einem Klaren Menschenverstand weiss doch, dass das die Wunschpreise der Verkäufer sind und da eher noch einiges von ab geht. Mal davon abgesehen: Niemand sollte kaufen ohne den Standort nicht vorher gesehen zu haben und sich mit Themen wie Soziodemographische Lage, Infrastruktur, Bevölkerungsentwicklung etc. beschäftigt zu haben. Auch wenn man da selbst nicht drin wohnen möchte: Die Der lärm am Standort, die Nähe zur Industrie und eine kleine Recherche in Sachen Stadtplanung (haben wir hier demnächst eine Spedition vor der Tür) muss doch drin sind. Ja das klingt jetzt sehr nach Moralkeule, aber irgendwie macht mich das wütend.",
      "&gt;  In der Regel handelt es sich um eine Kombination aus Kreditvertrag und Bausparvertrag, mit Laufzeiten von 20 Jahren und mehr - ohne Tilgung.\n\nDas ist an sich nichts unübliches. Statt ein Annuitätendarlehen zu tilgen, bespart man einen Bausparvertrag, bis dieser zuteilungsreif ist und zahlt die Zinsen einer Vorfinanzierung. Danach lösen Bausparguthaben und Bauspardarlehen die Vorfinanzierung ab und man zahlt nur noch die deutlich geringeren Zinsen auf das Darlehen.\n\nDas muss man halt im Detail durchrechnen und da vorsichtig sein. Der Vorteil bei Vorfinanzierung+Bausparvertrag ist, dass man schon jetzt weiß, welche geringen Zinsen man später zahlt. Es kann jedoch teurer sein, da das monatlich gesparte Geld nur rumliegt. Beim klassischen Annuitätendarlehen sinken die Schulden und so tilgt man bei konstanter Rate immer einen steigenden Betrag.\n\nEs kann günstiger sein, eine bestimmte Zeit eine Annuitätendarlehen abzuzahlen, solange man Zinsbindung hat, und währenddessen einen kleineren Bausparvertrag zu besparen, der ausreicht, um die Restschuld des Annuitätendarlehen abzulösen.\n\nAber was weiß ich schon. Ich habe von diesem ganzen BWLer-Zeug keine Ahnung.",
      "Hab relativ wenig Mitleid mit Menschen die das Grundbedürfnis Wohnraum als Investment mit Renditeabsichten sehen.  Nichtsdestoweniger muss so ein Fall Gerichtlich aufgearbeitet werden und geprüft werden ob dafür jemand zur Rechenschaft gezogen werden kann und muss",
      "Ich bezweifle, dass da viel rauskommen wird gerichtlich. Das sind alles notarielle Verträge, sprich der Notar hat den Vertrag den Käufern auch noch erklärt. Wenn da beim Notar alles sauber abgelaufen ist wird das richtig schwer.",
      "Schlimm, Abzocke sollte Bankberatern und Versicherungsvertretern vorbehalten sein für Produkte mit hohem Ausgabeaufschlag und laufenden Kosten.",
      "Also mehrere seiner vermeintlichen Wahnsinns Investments kann man mit Ahnung in 2 Minuten demontieren , viel Schrott auch so dabei",
      "Herrlich passend dazu schrieb das Inwis eben auf Linkedin: [https://www.linkedin.com/posts/inwis-forschung-beratung-gmbh\\_isa-inwis-immobilien-activity-7227660085374730241-ZbRO/](https://www.linkedin.com/posts/inwis-forschung-beratung-gmbh_isa-inwis-immobilien-activity-7227660085374730241-ZbRO/)",
      "Joa der Typ ist ja üverhaupt kicht shady oder so",
      "Hab mich gewundert, warum ich ihn bei Instagram nicht mehr finde. Siehe da: Habe ihn schon vor Monaten blockiert, weil seine populistischen Posts und teilweise auch leicht rechts angehauchten Aussagen mir damals schon auf den Sack gingen. Wundere mich aber über die knapp 1 Mio. Follower…",
      "Influencer, Makler und Bankverkäufer im Team. Was kann da schon schief gehen?",
      "Warum bin ich überrascht das er eine Kroate ist? 🤣 Er has sich wohl gut austrainiert in unsere Immobilien -Krimi Paradies Heimat 🤣🤣\nEin wichtiger Tipp für alle: kaufe niemals eine Immobilie in Dalmatien 😁",
      "Höre gerade Black Sabbath und hab den Namen im Titel als Tony Iommi gelesen..."
    ]
  },
  {
    "post_text": "This number just called me, anyone knows what it is?",
    "comments": [
      "Nigerian Prince who wants to move his money to your account",
      "Oh so I left a Nigerian prince on voicemail 😢",
      "Yeah. Prince Mamado Dyalo Nadlo",
      "😭😭😭",
      "Thats a senegalese name. If you wanna be funny atleast try to use the correct regional names",
      "Read the name one more time you ll understand it 🤣🤣 hint : it's dirty",
      "Ah lol",
      "Stfu and stop acting like a karen",
      "Why are you getting pressed 😂",
      "\"Dylo nadlo\" I still this name XD",
      "Steal*",
      "Still needs a lot to steal",
      "Your lucky that there wasn't a 6 in the middle",
      "Why?",
      "Some say \"666\" is shaytan's phone number. It's not true tho",
      "Lmaoo too bad a conversation with the shaytan would've been nice",
      "Lmao 🤣",
      "**It’s your service provider. I’ve had the same experience—I’m with** ***Orange*****, and when I call, a** ***Vendor Bot Responder*** **answers me.**",
      "it is plus six hundred six",
      "Orange bot, asking you to change your ring tone.",
      "But why would they call me?",
      "some genius manager thought it was a great idea, it is 5dh per month \n\n[https://www.orange.ma/Divertissement/Musique/Tonalite-D-appel/Tonalite](https://www.orange.ma/Divertissement/Musique/Tonalite-D-appel/Tonalite)",
      "A scammy way to *\"gift\"* you 3 days free of charge , then 5dh/month",
      "Very likely automated ads, either your ISP or your bank",
      "C'est orange, c'est pour les sonneries et tonalités. Bref c'est la pub orange pour acheter des sonneries",
      "That's a jinn that got his money stolen, his number is 606 and based on the book of misinformation page 66, if you flip the Moroccan flag and say \"Atay bzit\" btachl7it 55 times at 5am while calling IAM you'll get slapped by your housemate into the oblivion.\n\n(make sure to pay your bills before this all to get an 99% evasion rate)",
      "DST ( Moroccan intelligence Agency) selon truecaller",
      "That's me bro",
      "Oh my bad bro imma call you back",
      "Cheers bro",
      "Most probably scam..",
      "Ohh thank you",
      "The FBI",
      "This is some kind of a service thing number, they used to call me a lot 3 years ago for some reason.",
      "I've already received their call. It's a scam, don't answer them. They pretend to be Orange customer service, but they are not.",
      "Okay thank you",
      "I9der ikouno charika dyal Tislat o la scam",
      "Scam?",
      "Oh thank you",
      "Tisalat dyal Boîte vocale",
      "But why would they calle?",
      "I think rir bghaw ygolo lik bli 3ndk chi vocal ga3 ma sm3tih. \nila 3awdo sonaw 3lik ra ma3ndk mnach tkhaf machi spam deja tana sonaw 3liya.",
      "Ibliss",
      "Pete Hegseth wanted to share some spicy exclusive warplans with you",
      "Allal dlo bgha y3tik shwiya dl hndiya hhhhhhhhhhh",
      "It’s scam",
      "Wow this reddit is becomong fantastic....",
      "Automated call, asks you for your feedback regarding a service request\n\nUsually, from Moroccan ISP's (orange or inwi)",
      "It is most likely an automated advertisement system for your GSM provider. It could be calling you to advertise their \"change your voice\" offer which happened to me before",
      "Maby inwi",
      "It's the Police brother",
      "هاد النمرة ديال واحد الشركة ديال القوامج سميتها \"لاقاميجيك\".",
      "Donald Trump.",
      "Its Mekki Skhirat number, congratulations!",
      "google this \" - \"606\" maroc\" its orange",
      "I think that’s the number to hell’s lobby. 666 gets you straight to the manager.\n\nDid you have an appointment ?",
      "i got calls from same number, dont asnwer, its just some tards scaming people using old boomers ways",
      "just orange calling you about some deals or whatever its just promotional stuff"
    ]
  },
  {
    "post_text": "Maroc Telecom officially doubles speed for 100 Mbps customers",
    "comments": [
      "[deleted]",
      "Time for a change? huh",
      "[deleted]",
      "No one knows our struggle 😔. I feel you homie",
      "Unless you’re on a potato-only diet, that’s not possible.",
      "Please let me know where you can get one week's worth of food for 50dh?",
      "[deleted]",
      "So prison food?",
      "NOO! don't say that. I LOVE lentils!",
      "Yeah we all love lentils but as main course ? Everyday? God help the guy",
      "50dh of food per week ? Are you eating bread and drinking water only for every meal ?",
      "[deleted]",
      "People still have 4 mb/s 😲",
      "[deleted]",
      "![gif](giphy|XA9i7IZ96hE5O)",
      "I think since they changed the prices for fiber optic, they might also change prices for ADSL, or maybe upgrade 4mb/s to 12mb/s or 20mb/s",
      "Still overpriced for 200mbps these mfs need to be boycotted",
      "They can't be boycotted unless you want to return to Stone Age",
      "people will always hold the true power! but only if they unite",
      "Yeah, if there was a competitor who offers better prices. If there isn't, they can charge whatever they want.",
      "I dont mind not having internet",
      "Received the SMS, but no change to the bandwidth in Marakech",
      "Maroc Telecom's 100 Mbps price will change to 400 MAD and 200 Mbps will be 500 MAD. 1 Gbps will be introduced starting from May 1 which will cost 1,000 MAD. Unclear what other ISPs will have their pricing at",
      "100 Mbps is 350dh, or am I wrong?",
      "Yeah, 100 Mb for 349, 500 Mb for 749, and 1Gb for 1000",
      "its official? when changes will apply?",
      "I don't believe it is",
      "By may",
      "Why would someone need more than 200mbps anyway like you don't run a fucking company most of y'all are browsing Instagram all day and maybe downloading games sometimes if you do play",
      "Bro all i need is 50 max. 200 mb is too much and expensive",
      "500 dh",
      "Not with IAM, no. https://ibb.co/pBfxf5Cs",
      "Good, I hope the other ones will do the same",
      "Smart move",
      "My bro in france pays 23 euros for 8gb download speed lmao. Guess we're never getting to that level any time soon...",
      "we just don’t have the infrastructure for that yet, some areas don’t even have fibre lol",
      "the prices just seem a bit expensive in my opinion but hey maybe i'm wrong",
      "they are, no doubt about that",
      "nah you’re def right my friend in belgium gets like 300 mbps for a laughable silly little money",
      "What about the routers? Can they support 200mbps?",
      "Yes. They can support up to 1Gb i think",
      "Okay thank you. I’m in Rabat, and still no upgrade.",
      "Apparently the router they gave us supports 1Gb via LAN but only 150mbps via wifi. So i will request a new router than can actually deliver 200mbps wireless.",
      "It's not the router, is your wifi devices. Make sure to use 5Ghz Wifi",
      "I am using 5Ghz. It says in the specifications of the router that it can only go up to 150mbps wireless.",
      "Call the fiber support line, you can request a free wifi 6 router upgrade. This is done in the same day you call them and take 2 to 3 hours for the line to become active again.",
      "Not sure which router you have but mine does support 200mb (the one maroc telecom gave me) and it did get upgraded (i noticed it yesterday but it could have happened earlier) i live in Oujda",
      "I have the Huawei Echolife hg8245h.",
      "yes i have 120mb now",
      "ina mdina nta ? hna fsla mzl mazado walo",
      "what about Orange?",
      "They are all gonna change prices unless one of them wants to quit the market",
      "i have 100Mb and i didn't receive anything",
      "same i think it’ll get rolled out progressively by region idk tho",
      "I can confirm here in Marrakech the upgrade 200mb instead of 100mb what a great news !",
      "Good thing, but unfortunately the prices are still high compared to other countries.",
      "btw la fibre dial lmghrib is more fking expensive than dial franca",
      "bnadem wssl l + 500 o chof hnaya fine yallah wsslna",
      "200 Mbps is now 1 Gbps for IAM customer, the problem is the pricing, not the internet speed really. Nearly a $100 for 1 Gbps is a bit outrageous \n\nhttps://ibb.co/pBfxf5Cs"
    ]
  },
  {
    "post_text": "a 3ibad lah ana han hma9. wash kan tkhayel wla connection rj3et fhal zbel had el 3am? \n\n3am li fat kanet connection mezyana walakin had el 3am ki 9oli 3a9li n siyeb hza9 kamel o nwa9af internet hitash kan khales 250DH o khsni nzid nshri dwa d hri9 d ras hitash had zbel del wifi ki tala3li tension n rasi. kan his b rasi fhal connection d ADSL 9diiiiiiiima khsk d actualiser la page 7000000 d marat bash dtfarej video wahid. wash ana bwahdi wla shni wa9a3 hal 3aaaaaar.\n\nEDIT: moshkila mashi hir WIFI hta reseau MAKAYNSHI MARA awili kan 3ayet b solde khesni nb9a n 9ta3 o n3awed n 3ayet 372198476372890387 d marat bash i shebar!!!!! ulh ma fhamt shehad crimen li wa9a3\n\nEDIT 2: 3andi fibre optique d inwi",
    "comments": [
      "Khdam f Asia 150 dh tal 200 dh lchher fiber wassel 60 mb/s. Mgharba saktin 3la kolchi wa kayn i7tikar dyal maroc Telecom.",
      "[removed]",
      "3aychin 7ayat hna Nas f Asia kantfkr ch7al ghalya ma3icha fmghrib kayjini de7ek hhhh",
      "ana 3andi fibre optic ya hasra shi optic ma shofna tkharbi9 ha9 laaah",
      "cheffara mdewrin monopole binathom, layakhd fihom l7a9. chefra w makaynch li idaf3 3la 79ek",
      "ha9 lah karita o had maki hdar 3la ha9o",
      "Bro 3ndk l7e9 dir reclamation 3la days li g3ma khdmti bihom b connection ou maghadich tkhlss l montant li kayjik koula ch7er",
      "Kan 9ayel n 3ayet n ghawet o nshki maki 9diwli waaaalo",
      "Hhhhhhhhhhhhhhhhhhhh ui endo lha9 wlk mghadich yakhdi",
      "Katssema oligopoly; also known as cartel.",
      "Jbtiha hia hadik fach glti bhal connex d'ADSL, hhh, hrbtih lia, dakchi kan bl kb/s. Ach hadir a khoya rah kolchi kay3ani hadi 3amayn makayn halkawarit mn ga3 nawa7i, réseaux, makla, jafaf, kawarit tabi3ia, 9awanin dalima, dolm. Khoya ntlbo lah yr7mna wi njina wi fajiha 3l jami3, wla y3awn kola wa7d, lmochkil lkbir khwalati bjoj asatida jami3yin wo kaygolo lihom igado dakchi wistoh f24h m3a had lwifi. Dakchi s3ib sara7a. Lfasad ktr akhay",
      "Lah i rhamna o lah i shof mn halna",
      "Nfs problème dayrin tesalat 250dh lchher kna kanhsu brasna ha mqulbin db 2mois bdlnaah l fibre. Zhma ykun tahasun ms kayn ferq ghir chwya w blil mra mra katqtae cnx. Rah mn worst connection hya li endna f maghrib mdr",
      "Hta ana 3andi fibre optique makayen la fibre la walo makhadamashi",
      "BZAAAAF",
      "Hamdullah mashi ana bwahdi",
      "maytl3ch lik dem al3ayel, sir t9eda chi  comira b kalienti",
      "Hhhhhhhhhhhhhhhhhhhhhhhhhhh",
      "Maroc telecom ?",
      "inwi",
      "Inwi is scamy",
      "They all are istg",
      "Try Orange. I have nothing bad to say about them, they are really good.",
      "Ch7al dayr mn mb f Orange?\nDayr 50mb w ma3a dalik kat9te3 chwiya f TV wla f téléphone.\nDayra extra servers bach nfre9 ze3ma z7am wakha hakak sometimes it's shit w IP tv kaytblocka mra mra",
      "I have SIM d orange o reseau miiiyet so\nI think wifi hay kon kfes",
      "Oh really. Well I only have wifi with Orange. The speed is really good, it never goes out, I never had any issue, zero.\n\nMy parents have Maroc telecom and it’s always down.",
      "The best option available i think is CPE , you can buy an orange cpe and buy an cart for business even if you don't have a business , you can buy one from an orange Brokers there's too many of them out there just , search on FB marketplace about orange cpe the price goes between 500dh and 700dh , than you have two options the first one 12 Mb/s cart for 250 dh every month , \nor 30 Mb/s for 350dh \nIn my experience with orange cpe, i have a friend who has an orange dar box when you give me the router to try it on my house it was sh$t i test the speed on fast.com it's only 100kb/s but when i tried orange cpe with 30 Mb/s the lowest can do is 90Mb/s \n\" I live in rural places and i am really satisfied with orange CPE i think INWI also has this kind of service just take a look on YouTube you will find more detailed videos that could help you",
      "I'm in Toronto Canada and pay $40/month for 1.5 gbps...I knew Maghrib had shit internet but I never knew it was so expensive...",
      "Yalh baghi ndkhelha ach hadd khal3aa akhouya !!!",
      "wa ha tkhela3 sharikat kamlin fhal ba3tom",
      "Inwi kaychkiw mnha bzaf, Orange w IAM a7ssan wa9ila",
      "Nadi reseau o lwifi a3wam homa b3d lmrat kitra mochkil ms kikon mn charika kikon m9t3lihom chi khayt wla chi haja mra f l3am wla b3d lmrat ga3ma kayn had lmochkil bdl adsl dir fibre",
      "Ana 3andi fibre",
      "hna f dar d 3a2ila ba mkhales ghi 200dh mfere9 3la 4 etages o khadam mezyan kantfarej bih f tv khadam mezyan.  (tanger ) walakin dar dyalna f casa makhadmchi mezyan kandon wakila blassa li ntina saken fiha wach 3amra wla khawya.",
      "wa diro la fibre",
      "Rah galik mdayr fibre d inwi.",
      "Wla ma kantch la fibre f dark disponible?",
      "Suffering\n\nMa3ndk madir",
      "Literally me rn\n\nMdarb m3a lkhot pour les Megas",
      "Dir Starlink lmao",
      "isnt that shit madly expensive and unstable",
      "Just like every internet offer here",
      "3andi fibre o waalo",
      "ADSL is dead , they are forcing everyone to go to fiber or 4G",
      "I don’t have ADSL it was a metaphor i have fibre optique d inwi",
      "Ila kan réseau dyal inwi 3iyan 3ndk f derb wla f dar ra lwifi tahouwa ma3ndk madir, mn ghir tjrb ga3 les cartes f tel dyalk w tchouf achmn w7da khdama mzyan w tal3 réseau mzyan dik ghatgoul l inwi bslama w dir li lwifi dyal li khdama mzyan\n\nWl wifi sara7a kan 3ndi adsl iam l3adab chadid, gha kaytflaw 3la bnadm bih, mn l a7san chouf lik fibre orange wach dayza 3ndkom f derb ra 250dh tjib fibre 20mb w 7sen bzaaaaaf mn adsl w ga3 labghiti tzid tal 350dh ra kayna dyal 50mb w mkhayra f le3b ping habt w ta f download ra 5mb/s 7nina \n\nW ila makhdmat ta w7da 7awl matketerch mn dwa dyal 7ri9 ras alkhawa dyali ra mamzyanch lkbda",
      "3andi wifi d inwi o SIM d orange o 3a2ila 3andom SIM d itisalat tawahda ma hsn mn akhra kamlin karita. Ana ma3andishi ADSL ha shebaht wifi bih bash n biyen shehal t9il el wifi ms 3andi fibre",
      "Ila kan fibre ra lmouchkila mn 3nd inwi khask dwi m3ahom, ana kandon kaydiroha bl3ani bach tzid f débit ta orange flwl fach yalah drnah knt kantéléchargi bzaf w kan3rf imta download n9es bdebt w kano mn 5mb/s kayhbtoh l 0,5mb/s wla router katch3l fih bola 7mra w makayb9ach khdam khas tat3yt lihom w dwi m3ahom.... mn l a7san dwi m3a li rkeb lik lwifi wla li mklf bl fibre 3ndkom 7it ila ghir 3yti l service client ghaygoulou lik 7ga ra ghansifto lik chi wa7d ( wakha dakchi makhasoch wa7d yji tal dar ghir mn 3ndhom)",
      "makaynch la fibre 3andek felbatima ? rah kadir 7tahiya nefs taman\njereb la box 4g rah ba3d lmerat katsd9 7sen men l'adsl",
      "Sii 3andi fibre o walo ma khadamashi",
      "ana frbat o lmochkila ta3ek kant 3ndi b9it tan 3iyet l maroc telecom chi 1000 mera 3aaad jaw o gado liya mochkilti",
      "Hta ana idan khsni n hama9lom rasom ktar",
      "ah khasek dir lihom nefs l7aja hta tl9a rasek 3ndek blanek mgad",
      "Ana dert fibre d 100MB d Maroc Telecom bach thennit. If you can afford it, go for it",
      "I have fibre d inwi they are all the same istg all shit",
      "3ndk sah\nEven fibre optique isnt that good",
      "Yessss 3andi fibre optique d inwi just a scam",
      "Wa nare shabli GHa ana rah maymknch galik fibre optique lah ilgiha lihom",
      "IKR hta ana 3andi fibre optic waaaalo kaaaarita",
      "I lost many jobs offer due to this , jrabt nzid f debit jrabt nmchi l9hawi lblayes fehum wifi tyara and yet walo , Had l3am kan khayeb bzaf mna7iyat connection.",
      "Hamdullah mashi ana bwahdi li lahedt",
      "Boit ngoul gha ana but rah hta 4G makatchdch no more",
      "La 4G la wifi la app 3adi la walo",
      "Good internet in Morocco u need to have fibre optique",
      "I do it is a scam",
      "I have it my internet is stable all the time",
      "Les offres lwahidin li mezianin f mghrib kibdaw mn 250 end orange li machi ahssan haja tal la fibre d maroc telecom b 500 o 1000 ta 4g dial gae les conpagnies kamlin arnaque cnx katmchi lik ki lbrd alors que d autres pays 80go katchd biha chher kaml mfrj f ytb netflix b ahssan qualite 4g h24 mtloqa o tchiyt mnha",
      "your wifi code please",
      "Assalamu Alaikum wa rahmatu Allah wa barakatuh,\n\n\nBlasa li kheddam fiha ana connection mziana. \n\n-Y9der ykoun mouchkil mn router. \n-Wach f'ga3' devices had l'mouchkil 3endek?\n\n\nDo some troubleshooting, try to optimize your devices. Sometimes they are not configured correctly, or they do act out after an update. If after doing some troubleshooting the problem persists, contact your internet provider.",
      "Walaikum salam. This is actually helpful i will try doing this thank you",
      "La anak lha9 ana ri had 4 chhora la5ra ana o dar jadi o 3 dyal jirana li badlo adsl maroc telecom 12 o daro l Fibre 100. Hit dik 12 mg walat 5adama b slow motion. Adna f dar mbliyin b kora o l matchat o dik 12 mg had l3am walat mayta o bezaf chthom ya 5dam 100 maroc telecom wla Fibre 20 wla 50 dyal orange.",
      "Eda konti f Tanja rah chhar w connection adsl 250dh me9tola w kat9ta3 3yit man3aytlom walo akhir appel 9aloli Kayn installation d Fibre katkhales rir 500dh fhamt bli kay3mloha bel3ani wlad nas Bach tswetchi l Fibre",
      "Ana f casa o 3andi fibre optique d inwi",
      "Ana orange fcasa kan mkhyr vraoment top notch since 2021 21/22mbps\nDb mn dec ou ana 9ate3 lgaming 7it lping unstable asfffff mymkench ga3 t9esser ou debit hbet mn 21-22 chi merrat kan ga3 taywsel 30 db wella 17-16mbps ou lping unplayable",
      "Riiight hta ntina lahedti like hta ana f casa o wifi had el 3am just became FUCKED UP last year I didn’t have had el moshkil ms daba karita istg nothing i mean NOTHING works",
      "I mean its still useful imo debit stable 16mb and i can navigate yt and socialmedia ghir lgaming nsa",
      "Bruh inwi is shit ima tisalat ima orange",
      "Kamlin fhal fhal istg",
      "Nah kankhedem iam and it's good makatlagix it's fast o lgames kaykon 3ndi 60 ping.\nInwi jerebtha lmot o saf kent bax kankhedemha khasni ntle3 lste7 lmao.",
      "Inwi wlad 97 masd9osh, orange hsen menhom",
      "Call me stupid kankhls 3la wifi 3adi 250 dh wkayn fibre b250 dh soo is it gone be better douuuubt its all trash",
      "Machii gha tina htayana, wlkin akhawa kanfra3lihom karhom yawmiyan bach yjiw y3adloha wakha hakak t9ila",
      "Btw had comnt 7atito bara7 yalah tnazal",
      "nefss l7aja m3a 4G dial inwi hadak houa sokkar dial bssah 😔😔",
      "![gif](giphy|BbJdwrOsM7nTa|downsized)",
      "Always been",
      "Lmgharba saktin, o Consumer Protection department madayrinch khdamthom o katrarjo flmgharba",
      "Elik b orange, they promise they deliver.",
      "Taf Benslimane catastrophe kantbahdle bache ikhdam liya YouTube, sa3a daba Kina évolution walaw i9at3o tadaw 🤦‍♂️",
      "عيط لهم و طلب منهم ان يتدخلون في المنزل لإصلاح المشكل .، انا نفس المشكل   و لما تدخلوا لم يبقى مشكل .تلات ايام و انا اطلبهم حتى أتوا.",
      "We living in the same pain RA mymkensh sh7al wela t9il...khdama b WIFI dyal Maroc Télécom w mkhrej fiya l a3sab shi 3er9 aytrt9 fiya...w zid 3liha kyjih ykhser rie fash kan7tajo the most for school things ughhh..",
      "Inwi is trash \nTry other companies services when it comes to FIBRE.",
      "Ana 3ndi fibre Orange 20 o kan dima mzyan ila lhad chhora lekhrin wla bhal lkhra bghit nbdl lchi tisalat khorain wlkn m3rftch",
      "Awdiii khddamin b fibre 100 mega w lcnx ma'awda 3liha tbfh.",
      "Details\n\nPlan charge will be automatically deducted every 30 days from your account balance. Taxes extra.\n\nTalk &amp; Text: Includes unlimited talk and text within and between the U.S., Mexico &amp; Canada and unlimited text from the U.S. to over 230 countries. For the list of countries available for texting from the U.S., go to att.com/prepaidintltext.\n\nInternational calling from the U.S.: Includes 500 minutes of International Long Distance calling from the U.S. to over 30 countries. After 500 minutes, pay-per-use rates apply. See att.com/UnlMaxPlusILD for details.\n\nData: Includes unlimited data usage in the U.S. and Mexico. In Canada, if you exceed 25 GB of data usage in a monthly plan period, speeds will be reduced to 512 Kbps for the remainder of the period. 2G off-net data speeds may apply. See att.com/broadbandinfo for details on AT&amp;T network management policies.\n\nMobile Hotspot: Requires compatible device. Includes 35 GB of high-speed mobile hotspot/tethering data per monthly plan period in the U.S. After 35 GB, tethering slowed to a max speed of 128 Kbps for the rest of the monthly plan period. At this speed, hotspot use will not fully function.\n\n5G Access: Requires a compatible device and is not available everywhere. See att.com/5Gforyou for details.\n\nPersonal Cloud: AT&amp;T Personal Cloud 100GB is included with your plan. The Personal Cloud app provides a way to safely store and protect valuable mobile content in the cloud. Through the app, customers can backup, sync, restore, access, create, and share content. For more info go to att.com/prepaidcloud.\n\nVideo Streaming: Plan includes the Video Management feature. We aim to render streaming video in standard-definition (max speed of 2 Mbps for customers on both a 5G compatible device and rate plan, or 1.5 Mbps for other customers) though some video cannot be identified. Sometimes, other content that content providers bundle with streaming video may be impacted and slowed, including downloads. In certain situations, we may deliver video content faster or at higher definition. To experience higher definition video when available, or if you have an issue, turn the feature off or back on any time at att.com/myprepaid. Details at att.com/VideoFeature.\n\nFamily Plan: Plan eligible for enrollment in Multi-Line account. Account owner is responsible for paying monthly plan charges for all lines. Additional terms and restrictions apply. See att.com/prepaidfamily for details.\n\nHD Voice: Where available and with compatible device. See att.com/hdvoice for details.\n\nWi-Fi Calling: Requires compatible device and active Wi-Fi connection. See att.com/wificalling for details.\n\nAT&amp;T ActiveArmor: Requires app download, compatible device/service. Data charges may apply. Call Routing Settings, including fraud and spam risk blocking, may inadvertently block wanted calls; settings can be adjusted in app. Some mobile features are not available while roaming internationally. Details at att.com/activearmorapp.\n\nLimits: Max 5 devices per account. Not combinable with certain other offers. For more details on coverage area availability, charges, restrictions and conditions, go to http://att.com/myprepaid.\n\nGeneral: By activating/using AT&amp;T Prepaid service, you agree to the AT&amp;T Consumer Service Agreement at att.com/ConsumerServiceAgreement. Account will be canceled unless you add money within 26 days of activation. Active service requires account payment in full for monthly plans.Monthly plans: Calls to special and premium services may be blocked. Service cannot be resold or used for fraudulent purposes. Geographic, usage, and other terms, conditions, and restrictions apply. Taxes and other charges may apply. See http://att.com/prepaid for details. Plans subject to change and may be changed or discontinued at any time without notice. Service is subject to AT&amp;T’s network management policies, see att.com/broadbandinfo for details\n——-/\n550 dh a month",
      "Ki lkhra wlat 7ashak",
      "Kankhalas 25 euro li hiya 250dh f chhar w 3andi 500MB fibra w 20GB m9soma 3la 2 telefonat bsa7 hadchi kaml ga f españa ga jiran w tisalat mli n39al 3liha w hiya katchfar fina lah ykon fi 3wankom a khoya",
      "Hhhhhh 3ndi fibre dial maroc telecom 3ndk m3a 11:46am and 10:21pm bdebt kat7bess for 1 to 3 minutes o katrje3 gha bo7dha",
      "Kain mochkil had lyamat 3end chi service provider kbir, li mno wakhed lmghrib l bandwidth. Ana 3endi atonement m3a T-mobile d merican o tankhdem biha flmghrib b roaming. Dima kant mzyana o debit tale3. Simana li fatet knt ghantseta bl3asab. Kolchi wa9ef kolchi t9il. O 3endi atonement m3a orange 7ta hya t9alet mo9arana b9bel.\nTasselt f nass fyal t-mobile homa li 3tawni lme3lomat o 9alo bli khedamin 3la lmochkil. Lyom tnin t7el lmochkil. O rje3 lya debit mzn. Orange 3endi katwsel 40Mbps west dar, 60Mbps mn tankon kharej. Walakin l upload na9es bzf matayfotch 10Mbps. Fedar 3endi orange fiber, dayer 200Mbps katwselni dima mabin 200-220Mbps upload katb9a bin 150-200Mbps.\nSo TBH lmghrib is not really that bad. Jerebt dowal akhrin swa Africa swa dowal arab, lmghrib faythom bzzf d linternet. (Mn ghir UAE li 3endhom debit khayali walakin taykon ghir f dubai, lmodon sghar ba9in m3etlin chwya)\n\nP.S taman flmghrib dyal 4g tale3 bzf, walakin dyal fiber tayb9a me39ol chwya.",
      "3andi fibre optique 50 mb dyal orange, chi 3am daba 3amarni l9it chi mochekil. I live in marrakech, so chof lmedina dyalk cheno li khedam fiha mzian okhedam bih, 7it kola medina ocheno khedam fiha mzian.",
      "Not had l3am but this month, IAM Adsl and fibre became shit from my experience",
      "Hta ana noticit nfs lblan 3ndi fibre 100mb maroc telecom, speed mzyana, mais stability 0, dora dora kayt9t3, dima mdeconnecti wst lgame hta kanmot hili trj3ni tisalat has bihom kaydiroha bl3ani hitach timing dima maymknch",
      "Syad tytf9as, ontoma katzido 3lih fmallyzya ghir b... fkoria tyara 🤦‍♂️",
      "Kayn dak CPE Dya les enterprise ila kan endk chi wahed fi 3a2ila endo chi business i9dr dirih fi smiyto o mrta7a 100 mb bi 350 dh per month",
      "World cup 2030",
      "Adir 100mo 3nd tisalat o thni krk",
      "Hdr m3a support o chr7 lihom problem dialek, ila matwsltich bi solution, bdel charika lia mchark m3aha .\nRah Maghreb kaml fih had mwchkil, bi lkhsoss dial 200 dh w 250 dh",
      "Bghit ne3raf 3lash mghrba saktin 3la hadshi, ana makhalit fin khdemt fel Asia &amp; Middle east, conexion dima taman minasib w mezyana, 3lash 7na fel lmghrib la ? L3am li fat kont fel Philipines 3mart data fe telephone khlest 3liha 5dh .. conecion tiyara we wifi ghir b 120dh  7sen b 1000 mra 3la IAM w Inwi",
      "Kayd7ku 3lina w makaynch ta badil. nefsss les prix jaya daba 10 ans wsserf, w makayn la  fiabilité la cnx mzyana! lblan huwa f europe kayn prices khayaliin, tatl9a 500m/s b 20eur, they are literally \\*\\*\\*\\* us w ta hed matidwi",
      "Jrbty les réseaux lokhrin ?",
      "endna fibre optique wlbarh video 7lef labgha ikhdm lya mafhmt ta haja la wlat fibre atkhdem bhal routeur mobile 200mg blach mnha wahed icharji *6 ela had hsab o ythena",
      "Ana barah kont han hares zmar kamel ha9 lah ki b9a ymshi wifi o yji 3ayet n service 9aloli bash njiw mora 48H tkharbi9 ha9 lah",
      "I'm so sorry for but i think that you're living in place m9awda 3la dinmo 7ta mn réseau mafihch 🥹🥹 sorry",
      "I have orange 50mbps fibre optique and it's decent never had serious problems apart from slow upload from time to time but download is fine",
      "La ghi 3ndkom fchamal 7na hna 9adia nadya",
      "ana f casa... connection fhal khera la f chamal la f janob",
      "F taza nadia 5damin b starlink aji ojib m3ak dhb olflos dyalk and any recreational drug you take",
      "so you are paying 4000dh for starlink global?",
      "Chafrha mn lbrans",
      "[deleted]",
      "ana f casa",
      "Rah 3la 7ssab lminta9a 3awtani, kayn lblayss li chadahom orange o kayn lboayss li chadahom inwi o maroc telephone chada kolchi o machada walo",
      "Ana jit in a centered area the internet in supposed to be TAYRA",
      "Wlkin ma7ad reseau tahowa m3ndakchi then i suggest tbdli lchi 7aja khra li strongly kayn fyour area.",
      "Lmaarif ou fih cnx d3ifa",
      "Hhhhh dhktini awdi but relatable. Hadshi kadwi adsl tisalat yak?",
      "ha ntina kad shof ham ki dahak welah... no fibre optic d inwi",
      "ana walidya kaytl3o lsteh bax ihdro f telephone, mais wifi 3adi saraha",
      "ana la wifi la reseau del 3ayta o ana f casa ya hasra",
      "Inwi is a bullshiit change it to IAM",
      "Iam is worse trust me orange is the best imo",
      "How come?? \nOrange use IAM internet infra !!",
      "Iam's service sucks dude whenever u got a problem with the router or sum shi they always say we'll send someone to check after 48h but they never do also the wifi keeps cuttin off randomly, we changed to orange nd we never faced such as problems since then",
      "I had this issue when I upgraded to 12 mb/s \nThey always send me an agent but my issue never got solved so I downgraded to 4 mb/s and I paid 100 Dh for this shitty service. \nBut as I know if you got a problem with orange u will suffer more.",
      "Kamlin worse jarebt kolshi tahaja ma khadama",
      "Really !? \nSo where r u living? What about your neighbors ?? \nDo they have the same issue ? \nSomething is strange here in your story!",
      "What’s strange about my story? Why would push me to lie about how bad my internet is willy nilly HHHHHHHHHH za3maaa… \n\nWell Mr. Detective I didn’t ask my neighbors and i am in casa and i use fibre optique d inwi",
      "I'm not pushing you to lie !! \nI mean by strange that there are missing informations in your story, I'm IT engineer and sometimes the users KEEP blaming about a problem without giving the whole story. \nI'm asking the neighbors because if the source of the issue is coming from the ISP all nighbors will be impacted if not something going wrong with your router configuration or something going wrong with your line like a bad config or your line need to be reseted from ISP but it's rarely when It happened. \n\nMr. detective gets paid when he gives his time but unfortunately for me not.",
      "So this is my story: basically we bought this router last year we have inwi fibre optique and it was working PERFECT last year it was fast, smooth and just perfect even tho multiple devices PLUS the TV were connected it still worked fine. Now it is shit it doesn’t work at all if i am watching a movie i have to reload the page 888888 times, it cuts off randomly i’d be working on a project then BOOM wifi is gone. It’s not only my wifi it’s reseau too. Sometimes i’d be talking with my boyfriend b solde and then it just cuts off and i have maximum 2 bars d reseau. This was not the case last year at all",
      "U have 2 sepArate issues\nYour network phone is not linked to ur wifi issue \n\nI suggest first to reset your router configuration and change ur password.\nIf the issue persist u call the support \nIf they don't resolve ur issue you report them to هيئة عليا للاتصالات I'm not sure about the name ..... If someone see my comment kindely correct for me",
      "Thank you so much this have been very helpful"
    ]
  },
  {
    "post_text": "Is 4Mbps/s the highest internet speed can I get for 200DH/Month?\n\nI've enrolled in the \"MT Duo ADSL\" package of Maroc Telecom for more than 5 years now.  \nI pay 199DH per month for an unlimited 4Mbps/s internet speed and a fixed-line phone.  \nAfter checking [IAM's website](http://www.iam.ma/particulier/Fixe-et-Internet/ADSL/), I found out that I'm paying 100DH+ only for that landline.  \nAnd because I don't use it, I thought about switching to the \"Offres ADSL\" package.  \nWhich will wether save me that 100DH or provide me with extra unlimited 8Mbps.  \nSo please, Have any of you went though this **process of switching IAM's packages**?  \nI'd be so grateful if you could share with me your insights.",
    "comments": [
      "Skip adsl, it's an old and very outdated technology. Go for optic fiber",
      "I agree with you actually, but I can't pay more than 200.  \nI think 4Mbps is enough for me, I may reduce that 200 hahaha",
      "Just to put things into perspective, the difference between the 4mb adsl plan and the 20mn fiber one is like using an iphone 3gs in 2025 compared to an iphone 12 in 2025. Sure you can get calls and basic messaging but thats about it. \n\nI'd be surprised if youtube is doable in a 4mb internet without buffering.\n\nThe 200dh for the 4mb is so bad it makes the already bad 250 for the 20mb fiber plan good smh.",
      "hell and i'm here thinking 100mbps isn't enough for me",
      "Really? I wonder what use cases 100mbps is not enough for.",
      "honestly it is pretty fast but not when it comes to downloading large files.. 100mbps can get pretty slow especially gaming with some games taking up 100Gb for a single game and they get a lot of updates",
      "Yeah i feel you, I also hate that part, especially seeing a streamer download it in a few minutes.\n\nBut oh well even with 200mbps which the max we can get AFAIK its still gonna take too long to download big games. The jump won't even be worth it.",
      "it's annoying as hell seeing my online friends in France having 1gbps for literally 30€ a month when we have to pay 50€ for 100mbps not to mention that being in Africa we have horrible latency in practically all games since all servers are either in Europe which is best case scenario or all the way in America so we get absolutely horrible latency",
      "Dude I have 3gbps/s fiber and sometimes, it's still not enough.\n\nI do have special use cases tho whee I deal with multi-terrabyte diles, but still.\n\nAlso, nice username.",
      "I'll find out if there are any better packages with the same price.",
      "new offers appeared",
      "IDK about switching packages, but I would skip ADSL altogether.\n\nCheck if they have fiber at your address. IAM's AFAIK start at 500 MAD/mo for 100mbps. [Orange](https://www.orange.ma/WiFi-a-la-Maison/Fibre-d-Orange/Offres-Fibre-d-Orange) and [Inwi](https://inwi.ma/particuliers/offres-internet/wifi-a-la-maison/fibre-optique) have offers that start at 250 MAD/mo for 20mbps IIRC. Call all three, check which have service at your address and shop around.\n\nIf able, I strongly recommend getting fiber over ADSL. Difference is day and night.\n\nIf you're not using the landline, you should be able to switch to 8mbps for less money or 12mbps for the same price. If they refuse and you have fulfilled the explicit term of your contract (typically 1 or 2 year) then you can just ask them to end your current contract and then immediately subscribe to a new plan.\nServing 4mbps for 200 MAD/mo in 2025 should be illegal. IAM is a garbage company.",
      "The contract was made since long ago, so I may make a new one.  \nI'll contact their CS support to ask if they accept switch or not.  \nThanks for sharing these info",
      "Go get some Orange or Inwi ADSL offer, it's the same ADSL infrastructure for all, but with 200 DH you get the highest speed possible to your location (up to 20M), and 2 hours of calls to cell phones, unlimited to other home phones.\n\nOr add 50 DH, and get some decent fiber if it's ready in your location.",
      "I'm scared to change Maroc Telecom honestly.  \nSince I've heard some customers' bad experiences with these other providers in my city",
      "All ADSL share the same MT infrastructure\n\nThe scariest thing is to still be with MT",
      "I think no one except MT is providing unlimited 4Mbps for 100DH/month  \nI'm ganna try to get this, or change the provider if it doesn't work.  \nThanks for the info",
      "200 DH actually, because ADSL can't run without phone line.\n\nWhile with other, with 200 DH, you have a max bitrate for an ADSL, plus extra free calls for the home line phone.",
      "Wakha y3yaw maykono bad maywesloch l 4mb/s ADSL  \n[Orange 20mb fibre b 250 dh mzyana. ](https://www.orange.ma/WiFi-a-la-Maison/Fibre-d-Orange/Offres-Fibre-d-Orange)Dak ADSL ghir dya3et lflouss.",
      "Correct",
      "So, what kind of problems have you faced with Orange?",
      "I had the orange 50mb before and faced no problems",
      "Oh! I thought you complained about them.  \nThat was about Maroc Telecom I think",
      "I complained about ADSL in general. Whether it's maroc telecom or orange.",
      "Even Optic is a scam",
      "No other options unfortunately",
      "Expensive yeah but i wouldn't call it a scam since it does perform as advertised (which is surprising for once)",
      "I pay 250 per month for DarBox by Orange.  Download speed is 28 Mbps,  but once you reach 5 GB downloaded in a day, the speed is reduced to 4 Mbps.  It resets at midnight.\n\n\nIn other words DarBox is fast and great as long as you don't download huge files or stream a LOT.  It's enough for me.   But if you regularly download very large files or stream HD content for hours and hours, then fiber optical is the only choice. ",
      "Thanks for sharing your experience.  \nPersonally, I couldn't pay more than 200, if I didn't reduce it.  \nWhat makes me think of changing the packege is not the internet  \nas it's more about the landline that I don't use.  \n4Mbps is totally fine for my personal use",
      "Orange and inwi DSL Offers 20 mbps (in reality its just 10~13) for only 150 dh / month, btw orange say that after a year you will get charged of 200dh/month yet i know somebody who is subscribed to this and still pays 150 db even after a year passed.",
      "I'll think about it",
      "inwi",
      " Orange ADSL (150 DH for the first year and 200 DH afterwards), and it works smoothly — I get 11 Mbps",
      "What didn't like about it so far?",
      "Non ça marche, mkhiyra",
      "Have u heard about orange and inwi ? U can pay just 150 Dh for a speed up to 20Mbps if anyone still use iam he s in 90's",
      "How much will it cost me to switch and register to their ADSL?",
      "Walo , 0 Dh , sirry l'agence dyal inwi/orange goli lihum rah 3ndi iam wbghit nder dyalkum maghay9t3osh 3lik la wifi la walo bnfss lcable ayglboh lik inwi/orange , smitha demande de portabilite",
      "I really appreciate it  \nThank you very much for sharing these info",
      "Mer7ba lah yawde lah ysekher l2omor",
      "As others said SKIIIP ADSL\n250mad offers 20mb fiber (orange) is plenty, I have it for 3 years or more now",
      "Is there another 20Mbps ADSL package for only 200DH?  \nThat I heard people saying.",
      "On inwi website, they say it's a 150dh the first 12 months, then 200a month.",
      "Okay, thanks",
      "Np good luck",
      "بالنسبة لadsl كاين عروض حسن عند inwi وorange، غي 150 درهم والديبي حسن من اتصالات، ولكن مشاكل ديال adsl ديما كاينين، وخا بالنسبة ليا ماديرش adsl، وخا ديباني بشي box 4G، تا تشوف هاد التشارك ديال الفيبر شنو غيديروا فيه، فكل الأحوال وياك تزيد شي كونترا مع اتصالات.",
      "Thanks.  \nI'm already using ADSL of Maroc Telecom for more than 5 years.  \nAnd it works, so just I'm checking if I missed a better offer.",
      "You can get 20 M from inwi for 150 , for a year, then 200 after the year ends. It's actually good internet for that price\nFind a Way to get rid of IAM , THEY SUCKK",
      "I'm convinced actually, I'm considering that",
      "Get INWI adsl extra for 150dh/month and don't get Orange one for same price",
      "I will  \nThank you",
      "Do NOT think about getting ADSL, i genuinely beg you",
      "I just need the internet for the personal use  \nJust a regular browsing, no gaming, streaming, or anything professional  \nThat's why I don't want to pay more than 200Dh for it.",
      "Well then, i'd recommend the 20Mbps ADSL that's offered by Inwi, idk if it costs 150 dh or 200 dh per month, but in general it's quite fast but only if you're the only one who uses it",
      "Thanks for the recommendation  \nI'll consider that",
      "I have inwi adsl 20mb for 200dh, i just did a speed test it is in 7.4mb with three phones connected to the wifi. I have it for more than a year and half\nIt used to be better +12mb.  But it's the cheapest i live in a 4th floor building i'm in the ground floor it cuts off sometimes for like a 1 minute and comes back.\nSome neighbors who live in the 4th floor they strugle with it, it becomes so slow for them they can't even watch a movie.\nAs a conclusion inwi is the cheapest 20mb for 200dh\nBut it's not stable especially if you have 5 or more devices connected to the wifi. But i think it's better than iam, also orange has 20mb for 200\nI will never go back to iam 4mb for 200dh",
      "So I think it's a most to have Inwi in this case  \nI'll consider that  \nThank you",
      "Box is good, could go up to 100m sometimes, but you only get 40GB for 200 mad, after it's finished it gets down to 10 max, pretty good deal compared ro this one i would say",
      "I actually prefer unlimited internet plans  \nand I think Orange and Inwi offer some good packages of that",
      "It's unlimited, as i said you get 40gb of 100m /s or so, after you use 40gb, the speed goes down to 10m or so give or take, internet is still there, just not 100, but yes inwi i believe has a 350 deal, which is better than this whole thing, or orange cpe if you have the entrepreneur status",
      "I'll consider that then  \nThanks for sharing"
    ]
  },
  {
    "post_text": "Internet is too freaking slow .",
    "comments": [
      "I'm surprised you could post this picture",
      "😂😂😂😂😂wlahima  kdbti😂😂 .I'm  even surprised  I can access reddit .",
      "At this point, just go completely offline, or you'll develop psychological problems",
      "Machi ldik daraja 😂 mais rah l3assab wlah.A simple 3mb file takes a long time to be downloaded. Wa tkhyl m3aya knt hadi progres de telechargement dial had file wlah ila kay telecharja 10kb b 10kb.😂😂",
      "layj3lha b maghfirat donob",
      "Amin asadi9i rah bzaf wlah .lah ijib lina chi khrja bra bla rj3a inchalah",
      "let's suppose that there is indeed a cap and OP exceeded that.\n\n100Kbps as the fallback speed is absolutely diabolical and should be illegal.",
      "Wlahima kdbti.i think had blan dial  limite howa li kay dwzouh bzrba taht mn chi pub ftele et mktoub sghiiir bzaf et mni tji dwi igoulou lik hna rah 3almink.and just to be clear bro  rah mni yalah darou dar had idar douk dial inwi galou lina 3andkoum simana ila ma3jbkoumch t9dou trj3ouh .wlah ila dak simana kan sri3 , kay wsl tal 30mbps ou la 20mbps wakha lil.",
      "rah kulhum greedy mfs, they're doing anything for their shareholders to see green numbers.\n\ngreed is what drives them, not morals, not common sense, not innovation, not the consumer's satisfaction, not the country. NOTHING\n\nonce you grasp this concept, not just read it and say \"real\", but consciously grasping it, level 1 or 2 of consciousness... everything around you will start to make perfect sense lmao.",
      "that's beyond low",
      "Wa bzaf wlah. Knt baghi  fibre  optique dial  orange  li au moins fih bzaf dial les offres.( dial 250dh / dial 350dh...) sa3a la mat9dch hit haga IAM chada البنية التحتية.la3ssab howa hada",
      "Galik rah 9rib . البنية اتعطى للكل.\nLmhm 7di rah db y7to les offes jdad",
      "Either shit 4G coverage or you're being throttled, all those boxes have a data cap mentioned in the smallest font possible in the contract",
      "Raccoons gang 🦝",
      "i dont have it in my contract",
      "You'll find it on some extended version probably on their website somewhere, all mobile network based internet solutions have a data cap, even if they say \"unlimited\"",
      "Chof ramachi internet libd3ifa, rasalt 7it 3andkon 4g darbox, ma7doda. For example at the beginning of each month you get 100Gb if you watch 720p videos and download games movies and stuff, daghia ghatsali dik 100gb, a7san 7aja hia dir  fibre optic 259dh fih 30 mb ou MAKATSALICH GAAAA3\nI download so many games the smallest ones are at least 50 GB AND the download speed is  approximately 45Mb hia ta9riban 3,9mb/s f download or 4 ping \nDir fibre outfakarni",
      "Wach ana krht fibre optique 😂? Lblassa li sakn fiha tbarklah kayn fiha gha fibre optique dial  IAM.Knt baghi  dial orange hit fih des offres bzaf  mais lil assaf makayn hal. And wakha eandi(4g darbox) hadchi makay 3nich my internet  speed tih tal 97kbps.rah bzaf akhoya wakha  ikounou 3atini internet  fabor w maydirouch haka",
      "There is a change coming soon, probably this month. ANRT forced IAM to share its fiber infrastructure, and I read some rumors that there will be new offers with lower prices (1 Gbps, 750 mbps, 500.. etc). Hopefully it's true.",
      "Wa ntmnaw  ikoun hadchi bsah akhay lebowski😂.hit rah bzaf 3la t9alat wlah",
      "Sma7li ma9ritch mzian, I have another idea, use ADSL inwi, kanet 3andi oumziana l ping t9il walakin kat9di lgharad. Lmohim anything but the damn 4G thing, I failed an exam because of it, tadawazt kolchi m9ad clickit 3la send ou ta7aja madazat mina 9alabt router ou speed l9tha 97kb b7al lmochkil dialak. Dakhalt ADSL temporarily till we got fibre optic",
      "Lah idir li fiha  khir. Wlah ila kan khssr flouss fl9ahwa gha hit homa dayrin fibre optique dial  IAM dial 100mb .wa video  360p fyoutube  kay khdm wi t9t3😂😂😂",
      "Sir you dropped this 👑",
      "Works just fine for me but we did not shy away from complaining, so perhaps the secret lies there",
      "nice internet bro, does the fiber cable connect directly to your phone?",
      "المغرب",
      "Idar duo dyal inwi ki3tiwk 3gb koula sba7, koulma ghadi o kat9ada koulma kin9ss debit, o kiwli fixed f 100kbps. Bdlouh l adsl xtra 7ssn bzf o bnfss taman",
      "Chhal ga3  kaywsl fdebit fhad adsl xtra?",
      "20mbps b 200dh per month",
      "Gracias amigo and chhal kaywslk mn megabites stp?",
      "15-17, ca depend wach bnadm mst3mlha fdar ola la, ms en tout cas 7ssn bzaaaaf mn idar",
      "Lah inwrk bro  hna gha 4 personnes fdar donc i don't  think  i9d it9al ldik daraja hhhh",
      "7na 5 o biiikhir hih",
      "Smh lia ila ktrt 3lik hhhhhh wach tahowa kay 9d iw93 fih had blan bhal li fpost dial itih debit  lhad daraja flil??",
      "Nn 3mro ta7 liya debit lhaka, kan 3ndna idar kihbt lkfss mn haka. Mra w7da kan t9t3 lina chi 4j o jaw 9adouh. Db mdwz m3ana 3 snin bikhir",
      "Nsit mangoulik, ra khass i7sbouh lik gha b 150dh fl3am lwl 7it hadchi li daro m3ana",
      "Imkn ban lia had blan fsite lnass li fayt 3andhoum idar yak?Anyway lah irhm lwalidin  3la infos",
      "Same here ... sing with me hala hala hala mgharba sbi3a wrjala",
      "المغرب راه راه رابع العالم ،أش كاتعرف نتا؟",
      "Damn i got 96Mbps",
      "Tana darbox orange 4g a little more and i'll break the shit out of it",
      "we went from the best north african country when it comes to internet providers to the worst in the span of a decade, that’s just sad.",
      "Bro I have the same problem or even worse sometimes the internet gets down to 1.5 kb/s",
      "[deleted]",
      "double what I had in the 90s with 56kb modems",
      "[deleted]",
      "cheaper? we had 1000dhs in phone bills lol",
      "Nessaba hado",
      "Morocco is a country at war bro so it's understandable \n\nOh wait , it's not......",
      "477 days to download gta5",
      "hadchi li kirkb fbnadm bomzwi",
      "All the mobile 4g subscriptions claiming unlimited 4G data are actually limited. By unlimited, they mean you will never be disconnected (offline). But they only \"guarantee\" 4g speeds for a specific quota. I believe orange has a monthly quota, and inwi has a daily one, or the opposite.\n\nThe only 4G boxes that are actually unlimited are business (enterprise).\n\nPersonally, I use Orange Business Box (got it using my company papers), and I pay 349 dh / month. It's actually pretty awesome! My connection speed never dips below 85mbps even in peak hours. My average is actually 150 - 165 mbps, and early morning I even reach 240 mbps sometimes, but it's rare. \n\nI've had months where I downloaded close to 6TB of data without issues. \n\nHere's the link if you wanna look into it: https://entreprise.orange.ma/Solutions-Business/Fixe/Business-Box-4G \nA company (Registre commerce) is mandatory for this.",
      "That's 97,000 ones and zeros per second. The first ever hard drive only had a storage capacity of 3.75 megabytes. That means with your internet speed you could fill that hard disk in less than 90 seconds. If that isn't a marvel of technology I don't know what is. Have some perspective.",
      "If you have a pc I could show you how to take your neighbor wifi it is super easy",
      "97 Lmmmmmmao",
      "use ADSL xtra dyal inwi ola fibre",
      "Next posts :\n- do jani ghali bzaaf\n- w9eft kantsena tobis 30min 3ad ja \n- ba9i ma9dertch nl9a chi papier toilette mzn kamlin qualité 3iyana kaytet9eb w sb3i kaymchi f t9bti. \nYaah 3la merd ay haja khaskom tpostiw 3liha aaaa 7ga ana gay walakin machi denbi mama 9bel ma twledni kant bagha bnt w ana tzadit weld walakin mli kbert bghit n79e9 liha oumniya dyalha💅 hhhhhhhhhh tmerkento hta tzom7to hhhhhhhhhh"
    ]
  },
  {
    "post_text": "Fastest WiFi I ever connected to in Morocco. How is it even possible!?",
    "comments": [
      "Ah it's INWI. Interesting. Maybe they stopped slowing down for the competition 😂",
      "I always wondered why all three major providers sell the same crippled (fiber) product.\nThere is certainly no technical reason. In fact it would be free to go faster.\nThe GPON equipment and the glas itself is good up to gigabits.",
      "in business, it’s called price fixing.\n\nmultiple companies decide to maintain the market prices and services quality, in order to profit the best and be the least competitive.",
      "But if the competitive edge costs you literally nothing because the infrastructure is already in place?",
      "هادي غير قانونية في المغرب ولاكن راك عارف",
      "half of maroc telecom revenues come from other african countries. They just don't want to invest in morocco.",
      "No investment needed. They just need to stop throttling.",
      "I don't think they are",
      "Arch ...",
      "Surprised OP didn't go \"Fastest WiFi I ever connected to in Morocco. How is it even possible!? (I use arch btw)\"",
      "least unhinged Arch Linux user haha",
      "my people",
      "still hasn't riced it up, once he does OP will take control of this sub.",
      "https://www.shlomifish.org/humour/by-others/funroll-loops/Gentoo-is-Rice.html\n\nA classic",
      "he'll be everywhere, spreading the good word",
      "![gif](giphy|gVoBC0SuaHStq)",
      "By the way",
      "what does arch do exactly?",
      "boost ur ego",
      "Side effects of having any linux system",
      "Arch linux is an open source, minimalistic, fully customizable operating system. Tho you're welcome to look it up 🙃",
      "i did, but what i didnt understand is what it has to do with the post of the wifi being that high",
      "It's an absolute insider joke.\n\nCompare it with the absolute oddity of a vegan making a comment about food without mentioning that he is vegan.",
      "So you can post your arch rice in r/unixporn and farm karma what else? (I also use arch btw)",
      "NixOS Masterrace here, btw...",
      "This is Inwi fiber as it clearly says on the image. \nThis is probably a 200Mbits as some operators seems to send out more bandwidth than advertised. \n\nI have 100mbits fiber by Orange at home and I get up to 160Mbits in tests.",
      "Not really, the \"Orange\" you see in the picture is just the server with which the test is being run.",
      "Hi, I'm planning on getting fiber from orange instead of IAM. Can you tell me about the service please. Did you face any problems with orange fiber before?",
      "Thanks for correcting, I'm not used to this specific speed test. I'll edit.",
      "Interesting. This makes sense.",
      "My uni back in 2015 had upwards of 600mb.",
      "universities, at least most of them, are part of the MARWAN network that connect everyone with with gigabit speeds internet for research.",
      "who provides it?",
      "It was orange if I recall correctly",
      "Huh which uni was it",
      "My money on UIR",
      "Yep",
      "Haha knew it, I ve been there few times and I published a screenshot of the speedtest several years ago !",
      "was there from 2013 - 2017 internet was a hit and miss. I was connected to the ethernet for better results and was not getting more than 200mbps",
      "UIR",
      "That’s optic fiber yeah. Fastest ones are the universities ones haha",
      "Where?",
      "Marrakesh, Morocco.",
      "Yes Marrakech is faster nowadays",
      "Rabat is better.",
      "Been to marrakesh last week and had a fine connection with about 100 mb but it crashed when multiple people logged in",
      "Which Marrakech? Never seen or heard about internet being this fast.",
      "In my home at marrakech we have 100 mb fiber for the past 4 years",
      "Which provider are you with?",
      "Orange",
      "Isn't it a shame that we still have 100 mbps today while other countries gave to their customers 2.5 gbps",
      "didn't they dig all of marrakesh last year just for that",
      "Where please because I'm there and it's not that fast 😭",
      "Where in Marrakesh are you located?",
      "Near lm7amid",
      "Pchaakh, rak b3iid; had café f Targa. Kayna wa7d monquotidien f m7amid je pense; normalement monquotidien dima 3endhom 100Mbps tal 150Mbps",
      "Ive seen 500mb in a few companies/call centers in morocco it's just not available for personal use yet...",
      "I shall bugg my Orange sales dude with that knowledge. Maybe he can give me a scoop.\nBut probably horrendously expensive",
      "Lol yea it most likely costs a ton considering the price of the 200mb one 💀😂",
      "You use arch btw",
      "Which Morocco is this?",
      "The Morocco located in Marrakesh",
      "😂",
      "I thought it was the one in my dreams isn’t it 😂",
      "4g can get to these speeds in some areas, as for fiber, 200Mbps is the max, sometimes Ookla's speedtest can be misleading, try downloading something to actually measure the real world performance.",
      "&gt; try downloading something to actually measure the real world performance.\n\ndepends on the distance of the server, and also on its speed limit. Downloading isn't a reliable metric.",
      "There's definitely some load balancing involved, with many combined fibre lines.",
      "Kinda annoys me because this speed is literally normal in others countries becauuse they pay only 250 dh per month . Our country make us pay 250dh / month for only 50 mbps lmao. :(",
      "Fibre, it's available since a long time ago, but it's kind of expensive I don't know if the prices were dropped.",
      "No they have not, 500dh for 100mbps/1000dh for 200mbps\n\nI want to upgrade my adsl to the 500dh plan but Im really hesistant since the prices are quite ridiculous",
      "Is 200Mbps available for regular consumers? It would be new information to me if that's the case!",
      "Yes it's available for everyone",
      "Yeah that's tissalat lmaghrib fastest optical fiber plan and it's available for everyone",
      "it has been availabe since the start of fiber, but it's really expensive.",
      "Orange has 50mbps for 300dh a month. It's plenty for a house of only a couple, and we both work online",
      "It's worth it. I have one and I don't regret spending 500dh every month.",
      "Have you checked internet prices in other countries?",
      "If you check the prices of other countries you wont say this. They give 500 mbps  for 270 dirham / month ( 25 euros)",
      "I don't think you understand. I took a course last year on networking, and my professor kept saying that only the military has access to the fastest bandwidth in Morocco, which is 200Mbps, which is what our infrastructure allows. Note that before I took the screenshot, it was 300Mbps. To achieve higher speeds, we're gonna need better infrastructure, which is really expensive to build..",
      "Commercial offers are 200mbit. But technically there is no reason it should be so slow. The infrastructure certainly can do more.\n\nPS: your professor is probably telling tales. I don't think the military is the reason for the sub-standard connection speed in Morocco.\n\nPPS: I don't know why this one is so fast. Maybe they stopped throttling people if they buy the 200mbit package? Or maybe it's some special commercial offer. (Highly unofficial I suspect because I would buy it for my business if it existed)",
      "What a load of BS lol, 200mbps has been available for years now, it's nothing special. \n\nThe infrastructure in some areas is capable of achieving even higher speeds.\n\nThe military has their own thing, and it's not measured in Mbps.",
      "I never really thought 200Mbps is available for regular consumers. Thanks for correcting my information.",
      "Wait so it is measured in gbps ???",
      "Your professor is an mis informed and talk to much.  I have 500mbps in some locations. It all about the price you will pay. \n\nYour university probably has 800 across 2 lines.\n\n200mps is retails , enterprise has other speeds but the price is 10-40x more more.",
      "This. \n\nUniversities in Morocco use MARWAN .. Last time I tapped into it was in 2018, but I don’t recall experiencing 800 throughput. Were there any upgrades to the infrastructure between now and then that you know of?",
      "Copper 'Ligne spécialisé' for marwan was deprecated for years.  \nThey moved to the fiber to replace copper cables for the connection. But the Marwan network (SD-WAN) (which is connectable via VPN with limited access) is still active.\n\nFor universities and hospitals, they use fiber and also 4g antennas as backup. They want to keep those infrastructure online in case of emergency.\n\nFun fact, it the only WAN in morocco that has  ipv6.\n\n  \nYou didn't see 800mps, because the connection is limited per client.  (they cannot let everybody have Gigabit)",
      "&gt;I have 500mbps in some locations. It all about the price you will pay. \n\nHow much does 500Mbps cost? Where can you even find it?",
      "i think over 6k MAD.\n\nBut if you not a company, you better go with 2-3 200mps  and use a cheap [Multiwan](https://www.tp-link.com/fr/business-networking/load-balance-router/) router.\n\nHowever if you are company that requires stable connection you pay extra, and you have 24/7 support and guaranteed speed.",
      "MARWAN literally offer 5Gbps internet\n\nhttps://www.marwan.ma/index.php/en/",
      "What are the avg speed in Morocco?",
      "depends on how much money you'll likely to put on, Fiber is more expensive that adsl, so most people still use adsl or use 4g boxes. But the maximum speed is 200mb",
      "I live in a large city in North America and that's about the average speed we get here. Although max speed can go up to 3gbs up/down but those are pretty expensive around $110/Month. I have 500mbs up/down for $75 but it's payed for by the company I work for. But most people are between 50-100.",
      "200MB is 100 dollars/month and 100MB is 50 dollars/month in morocco. https://www.iam.ma/catalogue/abonnements/abonnement-fo.aspx \n\nPS: nevermind orange is way cheaper: https://www.orange.ma/WiFi-a-la-Maison/Fibre-d-Orange/Offres-Fibre-d-Orange",
      "i thought internet would be way cheaper in morroco",
      "yeah we're getting robbed",
      "if i may ask how many telecom company do you have?",
      "maroc telecom\n\norange\n\ninwi",
      "nice and we are stuck with one lol",
      "Trust me it's the same shit, more competition does not mean better prices. And i saw your prices and they're pretty good",
      "wow That's still expensive though ouch",
      "Something like 20MB",
      "It's not as bad as I thought.",
      "Most public spaces will have 100 or 200Mbts fiber now. Nobody is using ADSL anymore unless in small towns or remote areas as it's not available.",
      "&gt; Nobody is using ADSL anymore\n\nWe don't live in the same morocco then.",
      "With these numbers and connection type. Morocco has about the same average speeds as most North American cities such as NY or Montreal.",
      "I have no idea about NA but western EU 1Gbits seems to be the new standard, it is about 20€ in France.",
      "20Euros is pretty cheap compared to our prices in NA. 1gbs is around $90",
      "which linux are you using",
      "Arch",
      "Fellow arch user , kinda sad that you use kde",
      "It's just a matter of preference. I prefer KDE because it's the most customizable DE.",
      "real chads use xfce",
      "that's nothing, i tried an orange wifi with 400mb in downloaded and 900mb in upload",
      "A glitch in the Matrix.",
      "I work in a place with 1 Gb/s internet speed in rabat",
      "Is this a public WiFi? \nI noticed cheap chaabi cafes have faster internet than expensive 3rd wave style cafes",
      "My school had an internet connection of up to 700~800 (public school btw)",
      "where?",
      "EST Agadir",
      "universities get 1gbps",
      "i have 2gbps at work",
      "Do all the main fibre ISPs use the same fibre network or do they use their own networks?",
      "Firefox on Arch Linux, you must either be a legit developer or just incredibly terminally online.",
      "سبيد تيست ماتيقش فيه ،جرب تيليشارجي شيحاجة شوف شحال السرعة، كيخص تلقى 25m/s",
      "Dont forget that the speed you see when youre downloading is often MB/s (MegBYTES) and the one listed here is Mb/s (Megabits). The difference is a megabyte equates to 8 megabits. So next time you see a slow downloading speed compared to the one speed tests give you try multiplying it by 8 and you'll see its very close to the actual speed tests provide you with.",
      "wifi pro can get to more than that",
      "Inwi btw\n[speedtest](https://imgur.com/a/AyKV0kv)",
      "There is professional product and other ISPs   \nBanks aren't running 200mb fiber",
      "I want to see the full speed test. It’s\nCommon to have a “burst” of speed in the very beginning of a download. I also wish to see the upload. \n\n\nThis doesn’t really prove anything. In the states, consumer internet will always burst at almost max speed but then will settle.",
      "for personal use you have 200mbps max, but for companies you can get more, I know there is 1gbps plan (1337 school and some companies I worked for has it) so yeah speed like that you can find it, just not in a house",
      "Meanwhile here I am stuck in 4mb adsl xD(there's no fibre in my area)",
      "I am stuck with that 249dh idar duo cuz I need portability,  my parents don't want a fiber optic or adsl ciz they are fix . I love my 400kbps - 950kbps download and 1mbps - 1.5mbps upload with 20ping.",
      "You forget to mention you use arch btw tho it's kde you will reach i3 one day incah2lah hhhhhhhh",
      "I read a couple stories recently, first one of a underground network in Cuba i believe and second one was Americans in rural areas who got tired of having only one price gouging ISP and decided to crowdfund a private network of sorts that linked up via a big satellite dish iirc... \n\nApart from the major cities, internet is basically dogshit in most of the country unless you pay exorbitant amounts of money.. and I've always wondered.... why Moroccan's of all people, with all their ingenuity, are seemingly contented with the offerings available to them instead of figuring out how to upgrade things themselves. I'm naive perhaps, but how much would it cost to crowdsource a private network that exceeded the 200mb threshold? If you factor in how much people and businesses are paying already, does it not seem likely that a new player could disrupt and push the market forward?",
      "at my school it reaches up to 1.2gbps",
      "The Sultan selling out to the IOF",
      "If you ever used uni's internet you get way higher speed than that ( connected to MAR WAN network)\nAlso there was a time where inwi somehow removed the speed cap of the fibre and everyone was having gigabit speed on their even \"cheap\" 20mbps home fibre",
      "[removed]",
      "Because it wasn't my IP address anymore. And even if it was, nobody could harm me using only an IP address.",
      "Lately everything I've had inwi is great, I urged our house to switch to inwi and get la fibre and omg has it been a game changer for my computer, I miss going back home and gaming/downloading stuff there\n\nIf you have slow internet with them, check first with a computer connected with LAN (wired directly) and if the computer isn't having problems but the phones do, its probably a mediocre router (which is often the case since they give it away for free)\n\nIf you're in this situation, I'd recommend getting a new router from them (idk if they sell any) or even better, buy another wireless access point to extend your range, if you don't know how to deal with this just ask your local tech 7anot they usually are happy to help as long as you describe your problem to them\n\nIn order not to be biased, I've heard Orange has good stuff too, but fuck IAM",
      "I know I won't be able to afford it (nor would I need it)  \nBut I can't wait for us to have gigabit internet in morocco",
      "Maybe its a Starlink wifi?",
      "Is this a wet dream?!",
      "My house WiFi ( Maroc Telecom) Reaches 700 to 800mbps, which is unexpected from Maroc telecom😂😂",
      "that s good for a tier 2 or 3 Isp network 👍",
      "That’s not the fastest connection in Morocco I’ve seen it as fast as 1.4 gb/s",
      "mine is 550.11 Download and 760.87 Upload Maroc Telecom, not possible to post an image here.",
      "cries in 5mb download speeds",
      "Funny thing is, this speed would even be possible with 5G. Which we don't have...",
      "just for lols i tried speed test on my 5g abroad, 750 mbps 😂",
      "fastest wifi is tisallat 200 mbps, maybe this is the elon musk one? (nsit smito)",
      "Starlink has been postponed until 2025 for morocco.",
      "ive just checked Starlink website, and it says \"starting in 2025\"([Starlink | Availability Map](https://www.starlink.com/map))",
      "kaynin des offres FTTX 3la 9bel charikat, lwifi dyalna f charika taytelechargé b 600mbps",
      "where can i find more info on this ? especially the offers",
      "what company provides it?",
      "[deleted]",
      "That's how a speed test works.",
      "that’s latency you’re describing, and it’s calculated in milliseconds.",
      "My wifi at home is over 7gbps. The LAN is even faster.",
      "Which plan at which provider?",
      "He didn't say his home was in morocco",
      "Reread what I wrote slowly."
    ]
  },
  {
    "post_text": "Maroc Telecom internet prices are cheaper in West Africa, compared to Morocco",
    "comments": []
  },
  {
    "post_text": "What am i really paying for? ",
    "comments": []
  },
  {
    "post_text": "Starlink soon in Morocco? ",
    "comments": []
  },
  {
    "post_text": "They fucked guys.",
    "comments": []
  },
  {
    "post_text": "I found a way to respring without jailbreak",
    "comments": []
  },
  {
    "post_text": "Our Palestinian brothers and sisters showed us what true faith looks like and what true submission means. May Allah forgive all their sins and grant them the highest ranks in Jannah.",
    "comments": []
  },
  {
    "post_text": "You think other companies will follow IAM?",
    "comments": []
  },
  {
    "post_text": "Diff welder",
    "comments": []
  },
  {
    "post_text": "[Request] What are the chances I get 4 consecutive numbers on a quick pick?",
    "comments": []
  },
  {
    "post_text": "Winwing is cooking somehting at FS Weekend...",
    "comments": []
  }
]